{"text": "Essays in Honor of Adolf Grilnbaum  Edited by  R. s. COHEN  Boston University  and  L. LAUDAN  Virginia Polytechnic Institute  Library of Congress Cataloging in Publication Data  Main entry under title:  Physics, philosophy, and psychoanalysis.  (Boston studies in the philosophy of science  v. 76)  Bibliography: p.  Includes index.  1. Physics-Philo sophy-Addresses, essays, lectures. 2. Philos- Sold and distributed in the U.S.A. and Canada  by Kluwer Boston Inc.,  In all other countries, sold and distributed  by Kluwer Academic Publishers Group,  All Rights Reserved.  Copyright © 1983 by D. Reidel Publishing Company, Dordrecht, Holland  and copyright holders as specified on appropriate pages within.  Softcover reprint of the hardcover 15t edition 1983  No part of the material protected by this copyright notice may be reproduced or  utilized in any form or by any means, electronic or mechanical,  including photocopying, recording or by any informational storage and  retrieval system, without written permission from the copyright owner.  We live in a society which sets great store by science. Scientific 'experts' play  a privileged role in many of our institutions, ranging from the courts of law  to the corridors of power. At a more fundamental level, most of us strive to  shape our beliefs about the natural world in the 'scientific' image. If scientists  say that continents move or that the universe is billions of years old, we  generally believe them, however counter-intuitive and implausible their claims  might appear to be. Equally, we tend to acquiesce in what scientists tell us  not to believe. If, for instance, scientists say that Velikovsky was a crank,  that the biblical creation story is hokum, that UFOs do not exist, or that  acupuncture is ineffective, then we generally make the scientist's contempt  for these things our own, reserving for them those social sanctions and disapprobations which are the just deserts of quacks, charlatans and con-men.  In sum, much of our intellectual life, and increasingly large portions of our  social and political life, rest on the assumption that we (or, if not we ourselves, then someone whom we trust in these matters) can tell the difference  between science and its counterfeit.  For a variety of historical and logical reasons, some going back more than  two millennia, that to whom we turn to find out the difference  usually happens to be the philosopher. Indeed, it would not be going too far  to say that, for a very long time, philosophers have been regarded as the  gatekeepers to the scientific estate. They are the ones who are supposed to  be able to tell the difference between real science and pseudo-science. In  the familiar academic scheme of things, it is specifically the theorists of  knowledge and the philosophers of science who are charged with arbitrating  and legitimating the claims of any sect to 'scientific' status. It is small wonder,  under the circumstances, that the question of the nature of science has  loomed so large in Western philosophy. From Plato to Popper, philosophers  have sought to identify those epistemic features which mark off science from  other sorts of belief and activity.  Nonetheless, it seems pretty clear that philosophy has largely failed to  deliver the relevant goods. Whatever the specific strengths and deficiencies of  111  the numerous well-known efforts at demarcation (several of which will be  discussed below), it is probably fair to say that there is no demarcation line  between science and non-science, or between science and pseudo-science,  which would win assent from a majority of philosophers. Nor is there one  which should win acceptance from philosophers or anyone else  but more of  that below.  What lessons are we to draw from the recurrent failure of philosophy to  detect the epistemic traits which mark science off from other systems of  belief? That failure might conceivably be due simply to our impoverished  philosophical imagination  it is conceivable, after all, that science really is  sui generis, and that we philosophers have just not yet hit on its characteristic  features. Alternatively, it may just be that there are no epistemic features  which all and only the diSCiplines we accept as 'scientific' share in common.  My aim in this paper is to make a brief excursion into the history of the  science/non-science demarcation in order to see what light it might shed on  the contemporary viability of the quest for a demarcation device.  As far back as the time of Parmenides, Western philosophers thOUght it  important to distinguish knowledge (episteme) from mere opinion (doxa),  reality from appearance, truth from error. By the time of Aristotle, these  epistemic concerns came to be focussed on the question of the nature of  scientific knowledge. In his highly influential Posterior Analytics, Aristotle  described at length what was involved in having scientific knowledge of  something. To be scientific, he said, one must deal with causes, one must  use logical demonstrations, and one must identify the universals which  'inhere' in the particulars of sense. But above all, to have science one must  have apodictic certainty. It is this last feature which, for Aristotle, most  clearly distinguished the scientific way of knowing. What separates the  sciences from other kinds of beliefs is the irtfallibility of their foundations  and, thanks to that infallibility, the incorrigibility of their constituent theories. The first principles of nature are directly intuited from sense  everything  else worthy of the name of science follows demonstrably from these first  principles. What characterizes the whole enterprise is a degree of certainty  which distinguishes it most crucially from mere opinion.  But Aristotle sometimes offered a second demarcation criterion, orthogonal to this one between science and opinion. Specifically, he distinguished  between know-how (the sort of knowledge which the craftsman and the  engineer possess) and what we might call 'know-why' or demonstrative understanding (which the scientist alone possesses). A shipbuilder, for instance,  knows how to form pieces of wood together so as to make a seaworthy vessel   but he does not have, and has no need for, a syllogistic, causal demonstration  based on the primary principles or first causes of things. Thus, he needs to  know that wood, when properly sealed, floats  but he need not be able to  show by virtue of what principles and causes wood has this property of  buoyancy. By contrast, the scientist is concerned with what Aristotle calls  the \"reasoned fact\"  until he can show why a thing behaves as its does by  tracing its causes back to first principles, he has no scientific knowledge of  the thing.  Coming out of Aristotle's work, then, is a pair of demarcation criteria.  Science is distinguished from opinion and superstition by the certainty of  its principles  it is marked off from the crafts by its comprehension of first  causes. This set of contrasts comes to dominate discussions of the nature  of science throughout the later Middle Ages and the Renaissance, and thus  to proVide a crucial backdrop to the re-examination of these issues in the  seventeenth century.  It is instructive to see how this approach worked in practice. One of  the most revealing examples is provided by pre-modern astronomy. By the  time of Ptolemy, mathematical astronomers had largely abandoned the  (Aristotelian) tradition of seeking to derive an account of planetary motion  from the causes or essences of the planetary material. As Duhem and others  have shown in great detail ,1 many astronomers sought simply to correlate  planetary motions, independently of any causal assumptions about the  essence or first principles of the heavens. Straightaway, this turned them  from scientists into craftsmen.2 To make matters worse, astronomers used a  technique of post hoc testing of their theories. Rather than deriving their  models from directly-intuited first principles, they offered hypothetical  constructions of planetary motions and positions and then compared the  predictions drawn from their models with the observed positions of the  heavenly bodies. This mode of theory testing is, of course, highly fallible and  non-demonstrative  and it was known at the time to be so. The central point  for our purposes is that, by abandoning a demonstrative method based on  necessary first principles, the astronomers were indulging in mere opinion  rather than knowledge, putting themselves well beyond the scientific pale.  Through virtually the whole of the Middle and indeed up until the  beginning of the seventeenth century, the predominant view of mathematical  astronomy was that, for the reasons indicated, it did not qualify as a 'science'.  (It is worth noting in passing that much of the furor caused by the astronomical work of Copernicus and Kepler was a result of the fact that they  were claiming to make astronomy 'scientific' again.)  More generally, the seventeenth century brought a very deep shift in  demarcationist sensibilities. To make a long and fascinating story unconscionably brief, we can say that most seventeenth century thinkers accepted  Aristotle's first demarcation criterion (viz., between infallible science and  fallible opinion), but rejected his second (between know-how and understanding). For instance, if we look to the work of Galileo, Huygens or Newton,  we see a refusal to prefer know-why to know-how  indeed, all three were  prepared to regard as entirely scientific, systems of belief which laid no claim  to an understanding grounded in primary causes or essences. Thus Galileo  claimed to know little or nothing about the underlying causes responsible  for the free fall of bodies, and in his own science of kinematics he steadfastly  refused to speculate about such matters. But Galileo believed that he could  still sustain his claim to be developing a 'science of motion' because the  results he reached were, so he claimed, infallible and demonstrative. Similarly,  Newton in Principia was not indifferent to causal explanation, and freely  admitted that he would like to know the causes of gravitational phenomena   but he was emphatic that, even without a knowledge of the causes of gravity,  one can engage in a sophisticated and scientific account of the gravitational  behavior of the heavenly bodies. As with Galileo, Newton regarded his  non-causal account as 'scientifical' because of the (avowed) certainty of its  conclusions. As Newton told his readers over and again, he did not engage  in hypotheses and speculations: he purported to be deriving his theories  directly from the phenomena. Here again, the infallibility of results, rather  than their derivability from first causes, comes to be the single touchstone  of scientific status.  Despite the divergence of approach among thinkers of the seventeenth and  eighteenth centuries, there is widespread agreement that scientific knowledge  is apodictically certain. And this consensus cuts across most of the usual  epistemological divides of the period. For instance, Bacon, Locke, Leibniz,  Descartes, Newton and Kant are in accord about this way of characterizing  science.3 They may disagree about how precisely to certify the certainty  of knowledge, but none quarrels with the claim that science and infallible  knowledge are co-terminous.  As I have shown elsewhere,4 this influential account fmally and decisively  came unraveled in the nineteenth century with the emergence and eventual  triumph of a fallibilistic perspective in epistemology. Once one accepts, as  most thinkers had by the mid-nineteenth century, that science offers no  apodictic certainty, that all scientific theories are corrigible and may be  subject to serious emendation, then it is no longer viable to attempt to  distinguish science from non-science by assimilating that distinction to  the difference between knowledge and opinion. Indeed, the unambiguous  implication of fallibilism is that there is no difference between knowledge and  opinion: within a fallibilist framework, scientific belief turns out to be just  a species of the genus opinion. Several nineteenth century philosophers of  science tried to take some of the sting out of this volte-face by suggesting that  scientific opinions were more probable or more reliable than non-scientific  ones  but even they conceded that it was no longer possible to make infallibility the hallmark of scientific knowledge.  With certainty no longer available as the demarcation tool, nineteenth  century philosophers and scientists quickly forged other tools to do the job.  Thinkers as diverse as Comte, Bain, Jevons, Helmholtz and Mach (to name  only a few) began to insist that what really marks science off from everything  else is its methodology. There was, they maintained, something called 'the  scientific method'  even if that method was not fool-proof (the acceptance  of fallibilism demanded that concession), it was at least a better technique for  testing empirical claims than any other. And if it did make mistakes, it was  sufficiently self-corrective that it would soon discover them and put them  right. As one writer remarked a few years later: \"if science lead us astray,  more science will set us straight\".5 One need hardly add that the nineteenth  century did not invent the idea of a logic of scientific inquiry  that dates  back at least to Aristotle. But the new insistence in this period is on a fallible  method which, for all its fallibility, is nonetheless superior to its non-scientific  rivals.  This effort to mark science off from other things required one to show  two things. First, that the various activities regarded as science utilized essentially the same repertoire of methods (hence the importance in the period  of the so-called thesis of the 'unity of method')  secondly, the epistemic  credentials of this method had to be established. At first blush, this program of identifying science with a certain technique of inquiry is not a  silly one  indeed, it still persists in some respectable circles even in our  time. But the nineteenth century could not begin to deliver on the two  requirements just mentioned because there was no agreement about what the  scientific method was. Some took it to be the canons of inductive reasoning  sketched out by Herschel and Mill. Others insisted that the basic methodological principle of science was that its theories must be restricted to observable  116  entities (the nineteenth century requirement of 'vera causa').6 Still others,  like Whewell and Peirce, rejected the search for verae causae altogether and  argued that the only decisive methodological test of a theory involved its  ability successfully to make surprising predictions.' Absent agreement on  what 'the scientific method' amounted to, demarcationists were scarcely  in a position to argue persuasively that what individuated science was its  method.  This approach was further embarrassed by a notorious set of ambiguities  surrounding several of its key components. Specifically, many of the meth- odological rules proposed were much too ambiguous for one to tell when  they were being followed and when breached. Thus, such common methodo- logical rules as \"avoid ad hoc hypotheses\", \"postulate simple theories\",  \"feign no hypotheses\", and \"eschew theoretical entities\" involved complex  conceptions which neither scientists nor philosophers of the period were  willing to explicate. To exacerbate matters still further, what most philoso- phers of science of the period offered up as an account of 'the scientific  method' bore little resemblance to the methods actually used by working  scientists, a point made with devastating clarity by Pierre Duhem in 1908. 8  As one can see, the situation by the late nineteenth century was more  than a little ironic. At precisely that juncture when science was beginning  to have a decisive impact on the lives and institutions of Western man, at  precisely that time when 'scientism' (Le., the belief that science and science  alone has the answers to all our answerable questions) was gaining ground, in  exactly that quarter century when scientists were doing battle in earnest with  all manner of 'pseudo-scientists' (e.g., homeopathic physicians, spiritualists,  phrenologists, biblical geologists), scientists and philosophers found them- selves empty-handed. Except at the rhetorical level, there was no longer any  consensus about what separated science from anything else.  Surprisingly (or, if one is cynically inclined, quite expectedly), the absence  of a plausible demarcation criterion did not stop fin de siecle scientists and  philosophers from haranguing against what they regarded as pseudo-scientific  nonsense (any more than their present-day counterparts are hampered by a  similar lack of consensus)  but it did make their protestations less compelling  than their confident denunciations of 'quackery' might otherwise suggest. It  is true, of course, that there was still much talk about 'the scientific method'   and doubtless many hoped that the methods of science could play the demar- cationist role formerly assigned to certainty. But, leaving aside the fact that  agreement was lacking about precisely what the scientific method was, there  was no good reason as yet to prefer anyone of the proposed 'scientific  methods' to any purportedly 'non-scientific' ones, since no one had managed  to show either that any of the candidate 'scientific methods' qualified them  as 'knowledge' (in the traditional sense of the term) or, even more minimally,  that those methods were epistemically superior to their rivals.  Before we move to consider and to assess some familiar demarcationist  proposals from our own epoch, we need to engage briefly in certain metaphilosophical preliminaries. Specifically, we should ask three central questions: (1) What conditions of adequacy should a proposed demarcation  criterion satisfy? (2) Is the criterion under consideration offering necessary  or sufficient conditions, or both, for scientific status? (3) What actions  or judgments are implied by the claim that a certain belief or activity is  'scientific' or 'unscientific'?  (1) Early in the history of thought it was inevitable that characterizations  of 'science' and 'knowledge' would be largely stipulative and a priori. After all,  until as late as the seventeenth century, there were few developed examples  of empirical sciences which one could point to or whose properties one could  study  under such circumstances, where one is working largely ab initio,  one can be uncompromisingly legislative about how' a term like 'science'  or 'knowledge' will be used. But as the sciences developed and prospered,  philosophers began to see the task of formulating a demarcation criterion  as no longer a purely stipulative undertaking. Any proposed dividing line  between science and non-science would have to be (at least in part) explicative  and thus sensitive to existing patterns of usage. Accordingly, if one were  today to offer a defmition of 'science' which classified (say) the major  theories of physics and chemistry as non-scientific, one would thereby have  failed to reconstruct some paradigmatic cases of the use of the term. Where  Plato or Aristotle need not have worried if some or even most of the intellectual activities of their time failed to satisfy their respective definitions of  'science', it is inconceivable that we would fmd a demarcation criterion  satisfactory which relegated to unscientific status a large number of the  activities we consider scientific or which admitted as sciences activities which  seem to us decidedly unscientific. In other words, the quest for a latter-day  demarcation criterion involves an attempt to render explicit those shared  but largely implicit sorting mechanisms whereby most of us can agree about  paradigmatic cases of the scientific and the non-scientific. (And it seems to  me that there is a large measure of agreement at this paradigmatic level, even  118  allowing for the existence of plenty of controversial problem cases.) A failure  to do justice to these implicit sortings would be a grave drawback for any  demarcation criterion.  But we expect more than this of a philosophically significant demarcation  criterion between science and non-science. Minimally, we expect a demarca- tion criterion to identify the epistemic or methodological features which  mark off scientific beliefs from unscientific ones. We want to know what, if  anything, is special about the knowledge claims and the modes of inquiry of  the sciences. Because there are doubtless many respects in which science  differs from non-science (e.g., scientists may make larger salaries, or know  more mathematics than non-scientists), we must insist that any philosophi- cally interesting demarcative device must distinguish scientific and non-scien- tific matters in a way which exhibits a surer epistemic warrant or evidential  ground for science than for non-science. If it should happen that there is no  such warrant, then the demarcation between science and non-science would  tum out to be of little or no philosophic significance.  Minimally, then, a philosophical demarcation criterion must be an adequate  explication of our ordinary ways of partitioning science from non-science  and it must exhibit epistemically significant differences between science and  non-science. Additionally, as we have noted before, the criterion must have  sufficient precision that we can tell whether various activities and beliefs  whose status we are investigating do or do not satisfy it  otherwise it is no  better than no criterion at all.  (2) What will the formal structure of a demarcation criterion have to  look like if it is to accomplish the tasks for which it is designed? Ideally,  it would specify a set of individually necessary and jointly sufficient con- ditions for deciding whether an activity or set of statements is scientific  or unscientific. As is well known, it has not proved easy to produce a set  of necessary and sufficient conditions for science. Would something less  ambitious do the job? It seems unlikely. Suppose, for instance, that someone offers us a characterization which purports to be a necessary (but not  sufficient) condition for scientific status. Such a condition, if acceptable,  would allow us to identify certain activities as decidedly unscientific, but it  would not help 'fix our beliefs', because it would not specify which systems  actually were scientific. We would have to say things like: \"Well, physics  might be a science (assuming it fulfills the stated necessary conditions), but  then again it might not, since necessary but not sufficient conditions for the  application of a term do not warrant application of the term.\" If, like Popper,  we want to be able to answer the question, \"when should a theory be ranked  as scientific?\",9 then merely necessary conditions will never permit us to  answer it.  For different reasons, merely sufficient conditions are equally inadequate.  If we are only told: \"satisfy these conditions and you will be scientific\",  we are left with no machinery for determining that a certain activity or  statement is unscientific. The fact that (say) astrology failed to satisfy a set  of merely sufficient conditions for scientific status would leave it in a kind  of epistemic, twilight zone - possibly scientific, possibly not. Here again,  we cannot construct the relevant partitioning. Hence, if (in the spirit of  Popper) we \"wish to distinguish between science and pseudo-science\", 10  sufficient conditions are inadequate. The importance of these seemingly  abstract matters can be brought home by considering some real-life examples.  Recent legislation in several American states mandates the teaching of 'creation science' alongside evolutionary theory in high school science classes.  Opponents of this legislation have argued that evolutionary theory is authentic  science, while creation science is not science at all. Such a judgment, and  we are apt to make parallel ones all the time, would not be warranted by  any demarcation criterion which gave only necessary or only sufficient  conditions for scientific status. Without conditions which are both necessary  and sufficient, we are never in a position to say \"this is scientific: but that is  unscientific\". A demarcation criterion which fails to provide both sorts of  conditions simply will not perform the tasks expected of it.  (3) Closely related to this point is a broader question of the purposes  behind the formulation of a demarcation criterion. No one can look at  the history of debates between scientists and 'pseudo-scientists' without  realizing that demarcation criteria are typically used as machines de guerre in  a polemical battle between rival camps. Indeed, many of those most closely  associated with the demarcation issue have evidently had hidden (and sometimes not so hidden) agendas of various sorts. It is well known, for instance,  that Aristotle was concerned to embarrass the practitioners of Hippocratic  medicine  and it is notorious that the logical positivists wanted to repudiate  metaphysics and that Popper was out to 'get' Marx and Freud. In every case,  they used a demarcation criterion of their own devising as the discrediting  device.  Precisely because a demarcation criterion will typically assert the epistemic  superiority of science over non-science, the formulation of such a criterion  will result in the sorting of beliefs into such categories as 'sound' and 'unsound', 'respectable' and 'cranky', or 'reasonable' and 'unreasonable'. Philosophers should not shirk from the formulation of a demarcation criterion  merely because it has these judgmental implications associated with it. Quite  the reverse, philosophy at its best should tell us what is reasonable to believe  and what is not. But the value-loaded character of the term 'science' (and  its cognates) in our culture should make us realize that the labelling of a  certain activity as 'scientific' or 'unscientific' has social and political ramifications which go well beyond the taxonomic task of sorting beliefs into two  piles. Although the cleaver that makes the cut may be largely epistemic in  character, it has consequences which are decidedly non-epistemic. Precisely  because a demarcation criterion will serve as a rationale for taking a number  of practical actions which may well have far-reaching moral, social and  economic consequences, it would be wise to insist that the arguments in  favor of any demarcation criterion we intend to take seriously should be  especially compelling.  With these preliminaries out of the way, we can turn to an examination of  the recent history of demarcation.  As we have seen, there was ample reason by 1900 to conclude that neither  certainty nor generation according to a privileged set of methodolOgical rules  was adequate to denominate science. It should thus come as no surprise that  philosophers of the 1920's and 1930's added a couple of new wrinkles to the  problem. As is well known, several prominent members of the Wiener Kreis  took a syntactic or logical approach to the matter. If, the logical positivists  apparently reasoned, epistemology and methodology are incapable of distinguishing the scientific from the non-scientific, then perhaps the theory of  meaning will do the job. A statement, they suggested, was scientific just in  case it had a determinate meaning  and meaningful statements were those  which could be exhaustively verified. As Popper once observed, the positivists thought that \"verifiability, meaningfulness, and scientific character all  coincide.\" 11  Despite its many reformulations during the late 1920's and 1930's verificationism enjoyed mixed fortunes as a theory of meaning. 12 But as a would-be  demarcation between the scientific and the non-scientific, it was a disaster.  Not only are many statements in the sciences not open to exhaustive verification (e.g., all universal laws), but the vast majority of non-scientific and  pseudo-scientific systems of belief have verifiable constituents. Consider, for  instance, the thesis that the Earth is flat. To subscribe to such a belief in the  twentieth century would be the height of folly. Yet such a statement is  verifiable in the sense that we can specify a class of possible observations  which would verify it. Indeed, every belief which has ever been rejected as  a part of science because it was 'falsified' is (at least partially) verifiable.  Because verifiable, it is thus (according to the 'mature positivists\" criterion)  both meaningful and scientific.  A second familiar approach from the same period is Karl Popper's 'falsificationist' criterion, which fares no better. Apart from the fact that it  leaves ambiguous the scientific status of virtually every singular existential  statement, however well supported (e.g., the claim that there are atoms, that  there is a planet closer to the sun than the Earth, that there is a missing link),  it has the untoward consequence of countenancing as 'scientific' every crank  claim which makes ascertain ably false assertions. Thus flat Earthers, biblical  creationists, proponents of laetrile or orgone boxes, Uri Geller devotees,  Bermuda Triangulators, circle squarers, Lysenkoists, charioteers of the  gods, perpetuum mobile builders, Big Foot searchers, Loch Nessians, faith  healers, polywater dabblers, Rosicrucians, the-world-is-about-to-enders,  primal screamers, water diviners, magicians, and astrologers all turn out to  be scientific on Popper's criterion - just so long as they are prepared to  indicate some observation, however improbable, which (if it came to pass)  would cause them to change their minds.  One might respond to such criticisms by saying that scientific status is a  matter of degree rather than kind. Sciences such as physics and chemistry  have a high degree of testability, it might be said, while the systems we regard  as pseudo-scientific are far less open to empirical scrutiny. Acute technical  difficulties confront this suggestion, for the only articulated theory of degrees  of testability (Popper's) makes it impossible to compare the degrees of  testability of two distinct theories except when one entails the other. Since  (one hopes!) no 'scientific' theory entails any 'pseudo-scientific' one, the  relevant comparisons cannot be made. But even if this problem could be  overcome, and if it were possible for us to conclude (say) that the general  theory of relativity was more testable (and thus by definition more scientific)  than astrology, it would not follow that astrology was any less worthy of  belief than relativity - for testability is a semantic rather than an episternic  notion, which entails nothing whatever about belief-worthiness.  It is worth pausing for a moment to ponder the importance of this difference. I said before that the shift from the older to the newer demarcationist  orientation could be described as a move from epistemic to syntactic and  semantic strategies. In fact, the shift is even more significant than that way of  describing the transition suggests. The central concern of the older tradition  had been to identify those ideas or theories which were worthy of belief.  To judge a statement to be scientific was to make a retrospective judgment  about how that statement had stood up to empirical scrutiny. With the  positivists and Popper, however, this retrospective element drops out altogether. Scientific status, on their analysis, is not a matter of evidential  support or belief-worthiness, for all sorts of ill-founded claims are testable  and thus scientific on the new view.  The failure of the newer demarcationist tradition to insist on the necessity  of retrospective evidential assessments for determining scientific status goes  some considerable way to undermining the practical utility of the demarcationist enterprise, precisely because most of the 'cranky' beliefs about which  one might incline to be dismissive turn out to be 'scientific' according to  falsificationist or (partial) verificationist criteria. The older demarcationist  tradition, concerned with actual epistemic warrant rather than potential  epistemic scrutability, would never have countenanced such an undemanding  sense of the 'scientific'. More to the point, the new tradition has had to pay  a hefty price for its scaled-down expectations. Unwilling to link scientific  status to any evidential warrant, twentieth century demarcationists have been  forced into characterizing the ideologies they oppose (whether Marxism,  psychoanalysis or creationism) as untestable in principle. Very occasionally,  that label is appropriate. But more often than not,\" the views in question can  be tested, have been tested, and have failed those tests. But such failures  cannot impugn their (new) scientific status: quite the reverse, by virtue of  failing the epistemic tests to which they are subjected, these views guarantee  that they satisfy the relevant semantic criteria for scientific status! The new  demarcationism thus reveals itself as a largely toothless wonder, which serves  neither to explicate the paradigmatic usages of 'scientific' (and its cognates)  nor to perform the critical stable-cleaning chores for which it was originally  intended.  For these, and a host of other reasons familiar in the philosophical literature, neither verificationism nor falsificationism offers much promise of  drawing a useful distinction between the scientific and the non-scientific.  Are there other plausible candidates for explicating the distinction?  Several seem to be waiting in the wings. One might suggest, for instance,  that scientific claims are well tested, whereas non-scientific ones are not.  Alternatively (an approach taken by Thagard),13 one might maintain that  scientific knowledge is unique in exhibiting progress or growth. Some have  suggested that scientific theories alone make surprising predictions which turn  out to be true. One might even go in the pragmatic direction and maintain  that science is the sole repository of useful and reliable knowledge. Or,  fmally, one might propose that science is the only form of intellectual systembuilding which proceeds cumulatively, with later views embracing earlier  ones, or at least retaining those earlier views as limiting cases.14  It can readily be shown that none of these suggestions can be a necessary  and sufficient condition for something to count as 'science', at least not as  that term is customarily used. And in most cases, these are not even plausible  as necessary conditions. Let me sketch out some of the reasons why these  proposals are so unpromising. Take the requirement of well-testedness.  Unfortunately, we have no viable over-arching account of the circumstances  under which a claim may be regarded as well tested. But even if we did, is it  plausible to suggest that all the assertions in science texts (let alone science  journals) have been well tested and that none of the assertions in such conventionally non-scientific fields as literary theory, carpentry or football strategy  are well tested? When a scientist presents a conjecture which has not yet been  tested and is such that we are not yet sure what would count as a robust test  of it, has that scientist ceased doing science when he discusses his conjecture?  On the other side of the divide, is anyone prepared to say that we have no  convincing evidence for such 'non-scientific' claims as that \"Bacon did not  write the plays attributed to Shakespeare\", that \"a mitre joint is stronger  than a flush joint\", or that \"off-side kicks are not usually fumbled\"? Indeed,  are we not entitled to say that all these claims are much better supported by  the evidence than many of the 'scientific' assumptions of (say) cosmology  or psychology?  The reason for this divergence is simple to see. Many, perhaps most,  parts of science are highly speculative compared with many non-scientific  disciplines. There seems good reason, given from the historical record, to  suppose that most scientific theories are false  under the circumstances,  how plausible can be the claim that science is the repository of all and only  reliable or well-confirmed theories?  Similarly, cognitive progress is not unique to the 'sciences'. Many disciplines (e.g., literary criticism, military strategy, and perhaps even philosophy)  can claim to know more about their respective domains than they did 50 or  100 years ago. By contrast, we can point to several 'sciences' which, during  certain periods of their history, exhibited little or no progress. iS Continuous,  or even sporadic, cognitive growth seems neither a necessary nor a sufficient  condition for the activities we regard as scientific. Finally, consider the  requirement of cumulative theory transitions as a demarcation criterion. As  several a\\lthors 16 have shown, this will not do even as a necessary condition  for marking off scientific knowledge, since many scientific theories - even  those in the so-called 'mature sciences' - do not contain their predecessors,  not even as limiting cases.  I will not pretend to be able to prove that there is no conceivable philosophical reconstruction of our intuitive distinction between the scientific and  the non-scientific. I do believe, though, that we are warranted in saying that  none of the criteria which have been offered thus far promises to explicate  the distinction.  But we can go further than this, for we have learned enough about what  passes for science in our culture to be able to say quite confidently that it is  not all cut from the same epistemic cloth. Some scientific theories are well  tested  some are not. Some branches of science are presently showing high  rates of growth  others are not. Some scientific theories have made a host of  successful predictions of surprising phenomena  some have made few if any  such predictions. Some scientific hypotheses are ad hoc  others are not. Some  have achieved a 'consilience of inductions'  others have not. (Similar remarks  could be made about several non-scientific theories and disciplines.) The  evident epistemic heterogeneity of the activities and beliefs customarily  regarded as scientific should alert us to the probable futility of seeking an  epistemic version of a demarcation criterion. Where, even after detailed  analysis, there appear to be no epistemic invariants, one is well advised not  to take their existence for granted. But to say as much is in effect to say that  the problem of demarcation - the very problem which Popper labelled 'the  central problem of epistemology' - is spurious, for that problem presupposes  the existence of just such invariants.  In asserting that the problem of demarcation between science and nonscience is a pseUdo-problem (at least as far as philosophy is concerned), I am  manifestly not denying that there are crucial epistemic and methodological  questions to be raised about knowledge claims, whether we classify them as  scientific or not. Nor, to belabor the obvious, am I saying that we are never  entitled to argue that a certain piece of science is epistemically warranted and  that a certain piece of pseudo-science is not. It remains as important as it ever  was to ask questions like: When is a claim well confirmed? When can we  regard a theory as well tested? What characterizes cognitive progress? But  once we have answers to such questions (and we are still a long way from that  happy state!), there will be little left to inquire into which is epistemically  significant.  One final point needs to be stress", "filename": "Adolph Gruenbaum - Physics, Philosophy and Psychoanalysis.pdf", "meta": {"bla": "huahaua"}}