{"text": "Porning of America : the Rise of Porn Culture, What It Means, and Where We Go from Here \nThe Porning of Americ a The Porning of America The Rise of Porn Culture,  What It Means, and  Where We Go from Here Carmine Sarracino and Kevin M. Scott beacon press boston Beacon Press\n25 Beacon Street\nBoston, Massachusetts 02108-2892\nwww.beacon.org Beacon Press books\nare published under the auspices of\nthe Unitarian Universalist Association of Congregations. © 2008 by Carmine Sarracino and Kevin Scott\nAll rights reserved\nPrinted in the United States of America This book is printed on acid-free paper that meets the uncoated paper \nANSI/NISO specifications for permanence as revised in 1992. Text design and composition by\nWilsted & Taylor Publishing Services Library of Congress Cataloging-in-Publication Data Sarracino, Carmine\nThe porning of America : the rise of porn culture, what it means, and where we go from here / Carmine Sarracino and Kevin M. Scott.\np. cm. aspects—United States.  3. Sex in popular culture—United States.  I. Scott, \nKevin M.  II. Title.  To Tamara, Dante, and Carina Sarracino and Mary Ann, Connor, and Maisie Scott— for their patience, support, and encouragement. Contents Introduction ix 1 Normalizing the Marginal 1 2 A Nation of Porn Stars 31 3 Popping Rosie’s Rivets: Porn in the Good Old Days 49 4 Porn Exemplars: Advancing the Front Lines of Porn 81 5 Would You Like Porn with That Burger? 117 6 The Nexus of Porn and Violence: \nAbu Ghraib and Beyond 137 7 Women and Porn 169 8 Where We Go from Here 195  Acknowledgments 223 Notes 225 Index 235 Introduction As college professors, we usually write about subjects that we hold at arm’s length: objective, intellectual, dispassionate. But not so in this book. We are very much part of—involved in, living through—the phenomenon we describe as the porning of America. We are American males, husbands, and parents of small children, each of us the father of a girl and a boy. Strolling in the mall last week, one of us came upon something we had before only read about: thong underwear for little girls. The other recently saw his four-year-old daughter, enrapt, watching a television ad for Bratz dolls, which look remarkably like prostitutes.1 Our sons, eight and ten, pretend indiƒerence when such ads appear on their cartoon stations, but we have seen them stealing glimpses, and even ogling, eyes riveted, when they didn’t know they were being watched. How can we, as fathers who are ourselves sexual males, blame them? We too appreciate the allure of the female form and of  sex. And we are thankful that our children will grow up in an at- mosphere of sexual freedom that will spare them most of the ig- norance, hypocrisy, and repression of earlier times. If guilt is  disappearing from sensuality and sex, along with shame about the human body, we happily wave goodbye to all that. But what is com- ing in its place? ix What has in fact already arrived is a culture increasingly being shaped by the dominant influence: porn. Porn has so thoroughly been absorbed into every aspect of our everyday lives—language, fashion, advertisements, movies, the Internet, music, magazines, television, video games—that it has almost ceased to exist as some- thing separate from the mainstream culture, something “out there.” That is, we no longer have to go to porn in order to get it. It is fil- tered to us, in some form, regardless of whether we want it or are even aware of it.  If we want porn, the Playboy Channel brings it right into our living rooms. But even if we don’t want it, Paris Hilton, for one, brings it into our living rooms via, for example, a television ad for the fast food chain Carl’s Jr. in which Hilton—it can only be de- scribed this way—performs oral sex on a hamburger. (Shortly after the ad aired, the comedian David Spade remarked that while watching TV he saw a hamburger get to second base with Paris Hilton.) The Internet oƒers literally millions of porn sites to anyone who wants a peek. But it also oƒers peeks if you don’t want them. For example, one of us, in the weeks before Christmas a few years ago, with an eager kid on each knee, made the mistake of Googling “toys.” (And that was in the days when, as is less common now, a closed porn screen automatically launched one or two new porn screens, creating an impromptu video game in which one must click closed pop-ups faster than new ones can open—flashing butts and breasts!—while simultaneously elbowing kids oƒ one’s knees and shouting, “Daddy needs a minute here!”)  For that matter, toys themselves have been, if not rendered pornographic, drafted into pornography’s service. Consider again the Bratz doll. The doll pictured here belongs to a line called Bratz Play Sportz, but it is di~cult to imagine any sport—outside of a pornographic video—that dresses young women in uniforms of thigh-high fishnets and stiletto heels (popularly called fuck-me Introductionx pumps). Bratz dolls fundamentally redefine girlhood—and lead many parents to feel as if porn is hunting their daughters. Porn is everywhere in ordinary American life in 2008; indeed, in this book we show that porn is a cultural trend aƒecting all age groups, all races, and all classes, and that virtually every aspect of or- dinary day-to-day life is being shaped by porn. It’s not, then, so Introduction xi Bratz doll. Kevin M. Scott much that porn has become mainstream, which we often hear, as that the mainstream has become porned. Increasingly in America, we live porn in our daily lives. What are we to make of this development? Are we worse oƒ, for instance, than we were in earlier times, when pornography  was consigned to the back alleys of our culture? The question is far from simple. In fact, it serves as a good entry point into the com- plexity of the porning phenomenon. For one thing, those earlier times, sometimes known as the good old days in America, are often sentimentalized. We forget, for instance, that in the nineteenth century boys were commonly told by trusted elders—ministers, fathers, grandfathers—that the sin of “self-pollution” would bring not only eternal damnation in the next world, but physical debility and even insanity in this one. They often sat through blood-chilling lectures that were part of  antimasturbation moralist campaigns. Girls, for their part, were informed by their mothers, grandmothers, and aunts that women took no pleasure from sexual intercourse and bore with it simply to produce children. The only women who were exceptions to this rule were prostitutes, whose supposed abnormal sensuality led them to a disgraced life on the streets. Suƒering resulted from such sexual ignorance, repression, and hypocrisy. In 1856 Walt Whitman wrote the first poem in American literature dealing with masturbation, “Spontaneous Me,” trying to reassure young men and women that such irre- pressible urges were completely natural. Porn has always existed in some form in America, and it can be found in all the cultures of the world, ancient and modern. If nothing else, the universality of porn forces us to acknowledge a fundamental reality: men and women are, in fact, sexual creatures. And the more that porn has emerged from the shadows and back alleys, the more directly and honestly we as a culture have had to face our own sexuality and decide what we will make of it. Introductionxii In America today, porn has blown away most of the old dodges and blinders. There are certainly exceptions depending on where one lives and whether one identifies with a religious faith, but it is more di~cult now than ever before, for instance, to maintain that pubescent boys and girls should never masturbate. Or that we ex- perience sexual desire only with our “one true love,” so that having sex (“making love”) becomes the proof positive of having found the chosen one we were destined to marry. Or that normal women have no sexual urges, a falsehood that has been falling away piece- meal over time—the sexual double standard being one of the last vestiges to begin to totter in our own day. Or, to cite another bit of sexual ignorance only now (when the elderly figure prominently on many porn websites) beginning to crumble: that past a certain age, perhaps sixty or seventy, men and women cease to exist as sex- ual beings. For all the minuses that exist, then, there is clearly a positive side to porn as well. But it’s di~cult to make an overall, blanket judgment about porn because the word itself is so imprecise, so vague, that two people arguing on opposite sides of the question might in fact not even be talking about the same thing. Studying porn for the past few years in preparation for this book, we realized almost immedi- ately that porn is not one thing. Porn is not, to put it this way, a sin- gle color but rather a whole spectrum. Therefore, its influences on the culture are similarly varied and complex. Some porn is clearly, unequivocally damaging, such as child pornography. As parents, we wish we could consign it not just to the back alleys, but to the back alleys of some distant planet.  And along with child pornography, a good deal of porn can be labeled cultural toxic waste, such as the very dark porn eerily gain- ing popularity on the Internet, featuring physical abuse, violence, and torture. But there is another side of the spectrum. Some porn movies, especially those produced and directed by women, as well as some amateur homemade adult videos posted on websites,  Introduction xiii celebrate sensuality and a joyful, mutually shared, playful and aƒectionate sexuality. It seems mistaken, then, to group these cele- bratory movies with, say, films depicting sexual torture, as if the two were the same, or equivalent. To put it simply, there’s a whole lot of stuƒ out there, dramati- cally varied but all called porn. We need, first of all, to sort through the various types of material and indicate the important diƒer- ences among them. But in preparing to sort through material re- ferred to as porn and pornography, it’s enlightening first of all to consider that the words have diƒerent associations and can convey diƒerent things. Porn is the grandchild of pornography. Porn may share the same gene pool, more or less, as pornography, but it is much younger and hipper, and far more varied. The word pornography was invented (from the Greek roots porne + graphien, or “depicting the acts of prostitutes”) by nineteenth-century European art histo- rians who were abashed and flummoxed by what they regarded  as obscene paintings, sculptures, and frescoes. The National Mu- seum of Naples was the focal point for this problem, as it held  extensive materials from excavations at Pompeii. The excavations had begun in the mid-eighteenth century and almost immediately unearthed shockingly sexual artifacts: a representation of the god Priapus, for instance, with an enormously exaggerated erect phal- lus, along with frescoes depicting couples copulating. What to do with this Roman art? As art historians, their aes- thetic values compelled them to respect it. But as Catholics, their religious values forbade them from publicly displaying it. How, then, to catalog and store it? To include it in the museum’s hold- ings would have meant exposing the public, especially the young, to the corrupting, immoral influence of graphic sexuality. So a secret room for the “Pornographic Collection,” as it was o~cially cataloged, was created in the National Museum of Naples Introductionxiv in 1866, a room constantly under lock and key, whose doors were guarded day and night. Pornography was thus created, both as a word and as a category of human sexuality. It was in a sense an as- semblage, stitched together from disparate parts, a painting here, a fresco there, rather like a certain monster similarly pieced together a bit earlier in the century by a young Englishwoman with a wild imagination. And like Mary Shelley’s monster, it soon slipped the locks of its secret room and began to rove among the populace, striking fear across the continent. Pornography, then, the older of the two words, is much more heavily stigmatized. To the curators of the National Museum of Naples, pornography connoted “bad.” Similarly, the oldest pornog- raphy in America consisted of what most of us would regard as —if not bad—undesirable, sexist, objectionable. That is, early por- nography in America, from the stereoscopic slides of the Civil War soldiers through the 8 mm blue movies of the decades just after World War I, generally depicted males dominating females for their own pleasure, and often demeaning their female partners, who were usually prostitutes. American feminists generally had in mind male-dominated, exploitative sexuality when they began at- tacking pornography in the 1960s. In the 1960s and 1970s the word porn began to replace pornog- raphy. Nowadays, one hears and sees porn far more often than pornography. The words diƒer not only in that porn refers to a much larger body of material that is far less homogeneous than what was covered by pornography, but also in that porn is much less stigmatized than its forerunner.  Pornography applied almost exclusively to visual images, either still photos or movies, and only occasionally to writing. On the other hand, porn is used loosely, especially by those under forty,  to label a great variety of material, including movies, photos, and writing, as well as anime, video games, peep shows, sex toys, and  Introduction xv X-rated lingerie—all without the judgmental sense of “bad.” The word porn even feels more casual and familiar than pornography, like the nickname of a pal. In Chapter 1, we provide a brief history of pornography in America, showing that in order to enter the mainstream, porn stars began to imitate ordinary men and women. Then, in turn, or- dinary men and women began imitating porn stars.  We open the chapter with a discussion of Timothy Greenfield- Sanders’ 2004 exhibit, XXX. In this exhibit Greenfield-Sanders, a renowned photographer who has photographed presidents and the most famous celebrities, presented paired portraits of porn  stars: on one panel, a nude shot as the individual is familiarly seen in porn films, and in the next, the same individual in street clothes —looking like an ordinary person, someone like you and me.  How did porn stars come to be like you and me? And, more significantly, how have we come to be like porn stars? The answers to these questions bring us to the heart of the cultural phenome- non we call the porning of America.  In Chapter 2 we look at one result of this phenomenon: uni- versal sexualization. Increasingly, ordinary life mimics the ethic of porn, that everyone—regardless of age, profession, social rank— exists to a heightened degree as a sexual entity and therefore as  a potential sex partner. The unprecedented sexualization of chil- dren (we look closely in Chapter 1 at the Olsen twins) is one mani- festation of this phenomenon. But the elderly too are sexualized  as never before. Indeed, whatever one’s public identity—athlete, politician, schoolteacher—everyone is sexualized in a way and to  a degree historically unprecedented before the last quarter of the twentieth century. Chapter 3 again takes a historical perspective, examining a time often idealized for its supposed dramatic contrast with con- temporary times, the 1950s. It was precisely in this “innocent” era of the postwar 1940s and 1950s, however, that pornography began Introductionxvi slipping out of the alleys and back rooms of American society and into mainstream culture, especially in comics and men’s maga- zines. Bettie Page, for example, regularly appeared nude in leather and lingerie. But she also appeared in bondage and domination photos that express the struggle to contain the rising social threat —to many men, a threat—of female economic and sexual inde- pendence. The porning of America involves so many important figures that it is impossible to consider them all. In Chapter 4 we have  selected (from a possible multitude including Ralph Ginzburg, Henry Miller, Hugh Hefner, Larry Flynt, and Seka) six figures we  regard as porn exemplars: Russ Meyer, Al Goldstein, Madonna, Jenna Jameson, Snoop Dogg, and Paris Hilton. We present short portraits of each, focusing on what these individuals brought to the process of furthering the normalization of porn. Advertising has played a vital role in America’s porning, and this is the topic of Chapter 5. We look first at the advertising indus- try’s use of porn to sell all sorts of products, some quite directly linked to sex, but others sexualized only through the porn-derived context of the ad. Hamburgers, for instance, are inherently non- sexual but were presented sexually in the Paris Hilton television commercial for Carl’s Jr. Every ad that uses porn to sell a product is at the same time an advertisement for porn. In this chapter we also look at the way thinking about our bodies and sexuality as com- modities (an attitude derived from porn) finds popular expression on such websites as Craigslist, MySpace, and Stickam. In Chapter 6 we examine what might become a major direc- tion for porn, for it is growing in popularity on the Internet, and perhaps in our culture as well: violent sex that emphasizes debase- ment, humiliation, and the infliction of serious pain. We regard the mistreatment of detainees at the Iraqi prison Abu Ghraib  as a watershed in the connection between degradation porn and  violence. Introduction xvii So, is this a pro- or anti-porn book? Before addressing that  important question directly, in Chapter 7 we look at women’s re- sponses to porn. We discuss the first assaults on porn made by feminists such as Andrea Dworkin and Catharine MacKinnon in the 1960s and 1970s, and the often heated debate over porn that continues to the present day. We review the current research sur- rounding such important questions as whether porn causes vio- lence against women, and we discuss women’s influence on the industry as both consumers and producers of porn. In the last chapter, thinking about where we go from here,  we stake out our own position. We would reframe the question of whether our book is anti- or pro-porn and say that it is unequivocally pro-sex. We regard sexuality as a great good in human life, not only for the taking of one’s own pleasure, but also for the giving of pleasure—that is, for the enhanced joy of both receiving and im- parting a surpassingly ecstatic experience. Of all the ways in which we interact with others in this world, the back-and-forth exchange of sensual pleasure is one of the most satisfying and blissful of all possibilities. Being wholeheartedly pro-sex, then, we have to say that porn  is often not pro-sex, and sometimes even anti-sex. Women’s porn (produced and directed by women and intended for a female audi- ence), and true amateur porn, consisting mostly of video clips posted on host sites by ordinary men and women, are the most pro-sex porn we have seen. Typically, in true amateur porn, the sex partners, who are not paid, engage in passionate, playful, personalized sex: they seem to know and like each other and to want to please each other sexually. Their bodies might not be perfect—in fact are sometimes far from perfect—but their sensual excitement and pleasure is undimin- ished. Contributor blurbs, on sites that include them, often indi- cate committed relationships—“me and my boyfriend,” or even “me and my husband.” Often, the sex partners look into each Introductionxviii other’s eyes, as almost never happens in professional porn, some- times grin or giggle. For all the lust, in other words, there is also aƒection and an evident desire to please the partner. Early in our final chapter we present a critique of porn. An im- portant part of our critique consists of considering alternatives to the anti-sex porn, exploring directions that would remove from porn its—surprising, perhaps—vestiges of Puritanism. For to surf through websites is to revisit, in an odd way, American Puri- tanism: the sex these sites oƒer is nasty, bad, dirty, the women  sluts and whores. The pornographers and the Puritans start from the same premises. The main diƒerence between them is that the porn sites revel in what the Puritans fled. But there are alternatives to sex rooted in sin and shame. Tantra, which we briefly discuss, is one tangible example of a sensual, ecstatic approach to sexuality that is completely absent the stigma and guilt, and consequent degradation and humiliation, characterizing so much porn. In thinking about where we go from here, we identify sexual- ization—which is rampant in our culture—as the root problem underlying the damaging and dangerous practice of turning indi- viduals, especially girls and young women, into sexual objects. Through sexualization individuals are seen as having no value be- yond their sexuality. In this regard, we look to the landmark Report of the American Psychological Association Task Force on the Sexual- ization of Girls (2007) for our analysis of the problem, and also for ways to counteract and combat it. Sex without sexualization is an ideal to be pursued.  Porn, then, as the word is used in 2008, ranges from the liber- ating to the objectionable. The title of our book, The Porning of America, simply recognizes that the whole range of possibilities  is active now in shaping American culture—in some ways for the better, but in many ways for the worse.  We enjoy enormous sexual freedom in America. As individu- als we can explore our own sexuality and make choices about ap- Introduction xix pearance, dress, behavior, identity—about what is broadly called lifestyle—as never before in this country. The walls of restriction, limitation, taboo, are everywhere toppling. In The Brothers Karamazov, a main character, Ivan, thinking about the general decline of traditional codes of right and wrong, says, “Now everything is permitted!” Ivan is thrilled at the prospect of unlimited freedom. But he is also deeply troubled. For everything is permitted is as daunting a realization as it is  exhilarating. There are, after all, no built-in guarantees, and with unlimited options, we can choose badly as easily as choose well. Vi- olent sexuality, for instance, is gaining in popularity on the Internet and even in Hollywood movies. The abuse and torture at Abu Ghraib alert us to the dangers posed to our very humanity by pornography that is based on sexual humiliation and degradation. The Porning of America, then, will help you understand clearly what is going on in our culture. And, more than that, it will help you make the most, and not the worst, of our hard-won sexual  freedom.  Introductionxx 1. Normalizing the Marginal On a cool Saturday night in New York City, October 30, 2004,  a much-anticipated show at a Fifth Avenue art gallery, the Mary Boone, is drawing the bright and the beautiful. The exhibition will eventually travel across the country to other galleries, but this is the opening, and it is part of an intricately choreographed rollout in- volving book, documentary, and music releases that will get much of elite America talking about its subject: porn.  Ben Stiller and his wife, Christine Taylor, wander the gallery, bumping into the likes of movie directors Barry Levinson and Dar- ren Aronofsky. Calvin Klein, Rachel Weisz, and, of all people, tele- vision handyman Bob Vila are present and chat casually with the artist, Timothy Greenfield-Sanders.  Greenfield-Sanders is one of the most famous photographers in America. He has photographed a number of recent tenants  of the White House, including President George W. Bush and  and Rosalind Carter, Hillary Clinton, and Vice President Al Gore and several Supreme Court justices. He has photographed world- famous actors, musicians, artists, and writers. Like appearing on the cover of Time as a politician, or reaching the $20-million-per- movie level as an actor, to be photographed by Greenfield-Sanders is to be recognized as having made it. Big time.  At the gallery, however, neither the glitterati nor the renowned 1 photographer are suns around which the planets orbit. Rather, at- tention goes to the subjects of several of Greenfield-Sanders’s  exhibited portraits who are present in the room: Gina Lynn, Nina Hartley, Tera Patrick, Savanna Sampson, and Chad Hunt. To- gether, they have starred in well over a thousand porn films. Greenfield-Sanders was inspired to create this exhibition, XXX, after he watched the 1997 Paul Thomas Anderson film Boo- gie Nights, which explores the lives of porn stars. If there is a plot  at all to Boogie Nights, it is the growth of the porn industry: its  increasing awareness of what popular audiences want and, in re- sponse, its imitation of Hollywood. (The fictional director, played by Burt Reynolds, finally realizes his great dream of making porn —With a plot! Like a real movie! ) Similarly, Greenfield-Sanders’s exhibition attempts to show porn as mainstream. The exhibit is a series of thirty diptychs, each depicting side-by-side portraits of an individual in identical poses, except that in one the porn star is clothed, and in the other, naked. The portraits are large, about five by four feet, and placed high on the wall, so the viewer must look up at the faces (and chests) of the figures. Several are slightly larger than life size, yet each figure stares straight out from the photo. With a few exceptions, the figures exude confidence and ease, especially in the nude photos. To most Americans, the names of those pictured would be un- familiar, but a few figures have achieved a kind of fame that breaks through the old barriers against pornography. Ron Jeremy, the porn everyman, portly and unthreatening, regularly takes cameos in movies and television shows. Nina Hartley has become an intellec- tual critic of porn, and of culture in general. Most famous of all, certainly, is Jenna Jameson, a voluptuous blonde who looks back at the viewer with a gaze both sexual and challenging—a Marilyn Monroe with attitude. It is a purposely provocative show. Greenfield-Sanders has said The Porning of America2 that his intention for the exhibit is to start a discussion about who these people are and what they do. Who, indeed, are they, then? And what do they do? The back-and-forth visual transference from the clothed, aver- age-looking person (as most of them are) to the naked, sexual one, breaks down the diƒerence between the two. On one side is the portrait of an apparently ordinary man or woman, dressed in a sweater and jeans or some other casual outfit. On the other side, we see the same person in almost the identical pose, but wearing not a stitch. The overall eƒect of these side-by-side presentations, clothed/naked, clothed/naked, one after another, is to fuse the or- dinary and the normal with the world of porn.  Who are these people? People like you and me. What do they do? They make a living naked, having sex in front of a camera. The XXX exhibit was an artistic expression of a truth about American life: porn had found its way into mainstream culture. How many of the exhibit viewers, though, exiting into the chilly New York City night, thought about the other side of the equation of porn stars and themselves? The side of the equation dealing with porn’s transformative impact on the way people live. That is,  if porn stars have become like us, how have we in turn become like porn stars? When we ask the question in terms of how porn has changed us, we get to the heart of the matter. We are then asking not how porn has become mainstream but, much more important, how the mainstream has become porned. A host of further questions then arise: How has porn changed the way we see one another and our- selves? How has it altered our personal relationships and our sex- ual behavior? How has it changed the social order? How has it shaped our individual identities, and our national identity? To begin to answer these questions, we need to have some understanding of the development of pornography in America. Normalizing the Marginal 3 growth of the porn runt  Nathaniel Philbrick’s In the Heart of the Sea: The Tragedy of the Whaleship Essex (2000) tells about a surprisingly sexually active re- ligious sect in colonial America: the Quakers living oƒ the coast of Massachusetts on Nantucket Island. In this community, where men were at sea hunting whales for long periods of time, some- times even years, it was an open secret that the women had learned to pleasure themselves. Their journals contain opaque references to their masturbatory activities, including code words for dildos, such as he’s at homes. In 1979, homeowners remodeling a house in the historic district of Nantucket found a six-inch dildo made of clay.  Still, examples of what might be considered porn from  seventeenth- and eighteenth-century America are rare, and consist mainly of cheaply printed pamphlets, called chapbooks, contain- ing smutty jokes, lewd drawings, and cartoons.1 The chapbooks were produced surreptitiously, bought for a penny or two, and passed around among males.  Unlike the Nantucket Quakers, the Puritans, the largest group of earliest settlers, kept their secret sex lives, if they had them, se- cret. And yet, as we will show, the Puritans figure importantly in the construction of the American idea of pornography. Despite the stereotype of them as austere and sexually re- pressed, the Puritans were quite sexually active. Recent scholars, for instance, have examined the records of births, deaths, and mar- riages in various colonies and discovered that quite often the date of a first child’s birth was less than nine months from the time of the parents’ marriage. This may well have been a result of the prac- tice of bundling, in which prospective couples were allowed to sleep in the same bed, typically in the home of the young woman’s parents, provided they were individually restrained in garments or separated by a board. Unsurprisingly, many young people found their way around these obstacles and into each other’s embrace. Also, remarriage after the death of a spouse often happened The Porning of America4 quickly, without the observance of what many today would con- sider a proper period of mourning. One cannot help wondering whether the later marriage had originated as a liaison of some sort.2 But the reason we connect the Puritans with pornography has to do with their religious condemnation of sexuality as sinful and sa- tanic, and the denial (whether hypocritical or not) of their own sen- sual nature, which they constantly tried to hold in check.  One of the first things that the Puritans built in the New World were high walls separating their settlements from the natural world, which they feared for both rational and irrational reasons. Rationally, there were of course beasts and hostile Indians to fear. But reading their journals and letters, it quickly becomes clear that their fear of “the howling wilderness,” as one eminent Puritan, William Bradford, repeatedly described the American landscape in his journals, had more to do with their phobia regarding wildness than with any actual threat. The term so came to describe the new continent for the Puritans that Josias Winslow used it in his elegy of Bradford as a man who, if God bade him, would again follow God into “a howling wilderness.”  The beasts out there and the Indians out there . . . on the other side of the wall, in the dark woods . . . were wild! They gave in to all sorts of base and lewd desires. But within the settlement walls the Puritans could hold themselves apart from lawless, godless, unchecked impulses. They could remain focused on Scripture and under control, no matter how white-knuckled and tight-lipped.  Pornography, as it grows and strides across America over the mid-nineteenth and twentieth centuries, and then dominates American culture at the turn of the new millennium, typically has an essentially Puritan point of view on sensuality and sex. The vo- cabulary of the typical Internet porn site could be written by one of Nathaniel Hawthorne’s Scarlet Letter Puritans: Sex is sinful! Nasty! Naughty! The only diƒerence in this regard between the Puritans Normalizing the Marginal 5 and the pornographers is that from the same starting point they go not merely in diƒerent, but in opposite, directions. Porn revels in what Puritanism rejects. In the world of porn, sex is dirty, the women are sluts—but un- like what happens in the world of Puritanism, in porn all restraints are oƒ. The walls are down. The Puritan wilderness becomes the porn playground. The immensely popular contemporary series of porn films called Girls Gone Wild is a Puritan nightmare come horribly, horribly true.3 from the civil war to celebrity culture:  porn comes into its own In all the changes wrought by the Civil War, from the earthshaking to the trivial, the oddest may be this: the War Between the States marked the beginning of the pornography industry in America.4 In the middle of the nineteenth century, for the first time, it be- came technologically possible to cheaply and quickly produce mul- tiple prints of a photograph. And just when this happened, the Civil War separated hundreds of thousands of men and boys from their wives and sweethearts. For most of them it was their first time away from home. They were lonely and bored in camps. The words horny and hooker came into widespread usage.5 Photographs of all kinds were important to the soldiers. In the pockets of their frock coats they carried ambrotypes of their loved ones. They mailed home small calling cards, called cartes de visite, showing themselves photographed in uniform, wielding Colt re- volvers and bowie knives. And deep down in their haversacks, or under the straw mattresses of their winter quarters, they hid stereoscopic photos of seductive women. When viewed through a special holder, two side-by-side photographic images transformed into the three-dimensional form of a girl clad only in see-through gauze, or brazenly lying with her legs spread. The popular carte de visite had a prurient incarnation: a prostitute’s nude form occupied The Porning of America6 the space normally reserved for the image of the gallant soldier. It did not take long for some to spot a market opportunity, how- ever illicit. Young men may have been horny before the war, but they were spread thinly across a nation of farms. Now they were amassed in camps, by the thousands and tens of thousands, away from the prying eyes at home that would certainly have prevented them from tra~cking in pornography via the mail. Companies such as G. S. Hoskins and Co. and Richards & Roche in New York City sent out flyers and catalogs to the soldiers, detailing their oƒerings: photographs of Parisian prostitutes; condoms and dil- dos; even miniaturized photographs that could be concealed in jewelry such as stickpins, and that, when held close to the eye, re- vealed a couple engaged in a sex act.  Despite the sea of catalogs that were printed, only a handful survive. From time to time field commanders “cleaned up camp” and built bonfires with the copious material. No doubt countless more after the war fell victim to former soldiers’ pangs of con- science or to the fear that a family member might happen upon them. In The Story the Soldiers Wouldn’t Tell: Sex in the Civil War, Thomas P. Lowry reviews five catalogs, including one that ended up in the National Archives because a Capt. M. G. Tousley wrote  to President Lincoln complaining of the obscene catalogs and thought to include a sample. We don’t know whether Lincoln ever saw the catalog, but it is droll to imagine him, in those darkly ser- ious days, paging through “mermaids wearing only mist and foam,” and “The Temptation of St. Anthony,” showing the “naked charms” of the seductresses, and “Storming the Enemy’s Breast- works,” in which a Northern soldier quite literally assaults the breasts of a Southern belle. A new industry had been created, and a lot of money was changing hands. So much obscene material was passing through the mail that the Customs Act of 1842, which contained the first federal antiobscenity legislation, was strengthened in 1857. In Normalizing the Marginal 7 1865, in an attempt to check the flood of pornography triggered by the Civil War, a federal statute prohibited the use of the mail to ship obscene books and pictures. After the war, alarmed moralists led by the zealous crusader Anthony Comstock, who was truly ob- sessed with stamping out smut, passed the Comstock Act of 1873, making it illegal to trade in “obscene literature and articles of  immoral use.” As Walter Kendrick notes in The Secret Museum: Pornography in Modern Culture, Comstock himself, in 1874, re- ported seizing and destroying in a two-year period 134,000 pounds of “books of improper character” as well as 194,000 pictures and 60,300 “sundries” such as “rubber articles.”  Those who today look to legislation, or to a moral crusade, as the best means to limit if not eliminate pornography, would do well to recall Comstock’s relentless, but ultimately futile, eƒorts. Attorney General Edwin Meese and his Commission on Pornography, con- vened about a hundred years after Comstock’s campaign (the com- mission’s final report was issued, and almost immediately ignored, in 1986), could have saved time and energy had it recalled that ear- lier zealot’s failure.  And zealot he certainly was. Comstock, who was not above us- ing false names and even disguises to investigate obscene materi- als, pursued wrongdoers with the tenacity of a pit bull. He drove one oƒender, W. Haines, a surgeon by training who became rich producing more than three hundred obscene books, to suicide.  Before Haines, an Irishman, appeared on the scene, America had only imported from Europe, but not produced, obscene books. Haines changed all that. By 1871 he was selling one hundred thou- sand such books a year. The night before he killed himself, Haines received a message: “Get out of the way. Comstock is after you. Damn fool won’t look at money.” In later years Comstock, who would blush at an indelicate photograph, boasted about the sui- cide, which he regarded as a victory over the forces of evil. But neither the criminalization of obscenity in 1865 nor Com- The Porning of America8 stock’s obsessive crusade killed oƒ pornography. Another war, the Great War, was not far on the horizon, and it would once again concentrate huge numbers of lonely, horny men—and with photo- graphic and printing technologies further advanced, oƒer them an improved, more enticing product. Porn’s birth weight had been low, and the runt was pushed into the dark alleys of American life. But there it thrived. By the end of the twentieth century, it had emerged mature and powerful—son  of the European curators’ Frankenstein. Widely known if not re- spected, it had corporate o~ces in New York, Chicago, and Los An- geles. Its annual earnings at the turn of the twenty-first century were estimated at $10 billion to $14 billion. But the financial success of the pornography industry, including its close ties to Fortune 500 corporations, is not our principal in- terest. As teachers and scholars, we have been drawn to culture studies. One of us has for many years taught a college course called Growing Up in America. The other has written and lectured on twentieth-century popular culture, such as comic books, men’s magazines, and video games. Along such lines of interest, we have turned our attention to pornography.  Why would we do so? Because porn increasingly dominates American life in 2008, shaping our entertainments, influencing the way we dress and talk, the way we see one another, and the way we behave sexually. If we want to know who we are now—as indi- viduals and as a nation—we must recognize a", "filename": "Carmine Sarracino, Kevin M. Scott - The Porning of America_ The Rise of Porn Culture, What It Means, and Where We Go from Here-Beacon Press (2008).pdf", "meta": {"bla": "huahaua"}}