{"text": "An introduction to Zen Buddhism  An Evergreen Black Cat Book An Introduction to Zen Buddhism An Introduction to Zen Buddhism Professor of Buddhist Philosophy Otani University, Kyoto With a Foreword by An Evergreen Black Cat %fi Book All Rights Reserved Library of Congress Catalog Card Number: 61-14383 First Evergreen Black Cat Edition 1964 Fourth Printing Manufactured in the United States of America Author's Preface 8 I Preliminary 31 n What is Zen? 38 m Is Zen Nihilistic? 48 rv Illogical Zen 58 V Zen a Higher Affirmation 66 VI Practical Zen 74 vn Satori, or Acquiring a New Viewpoint 88 vra The Koan 99 DC The Meditation Hall and the Monk's Life 118 T„HE articles collected here were originally written for the J^ew East, which was published in Japan during the 191 4 War under the editorship of Mr. Robertson Scott. The editor suggested publishing them in book-form, but I did not feel like doing so at that time. Later, they were made the basis of the First Series of my J^en Essays (1927), which, therefore, naturally cover more or less the same ground. Recently, the idea came to me that the old papers might be after all reprinted in book-form. The reason is that my ^en Essays is too heavy for those who wish to have just a little preliminary knowledge of Zen. Will not, therefore, what may be regarded as an introductory work be welcomed by some of my foreign friends? With this in view I have gone over the entire MS., and whatever inaccuracies I have come across in regard to diction as well as the material used have been corrected. While there are quite a few points I would like to see now expressed somewhat differendy, I have left them as they stand, because their revision inevitably involves the recasting of the entire context. So long as they are not misrepresenting, they may remain as they were written. If the book really serves as a sort of introduction to Zen Buddhism, and leads the reader up to the study of my other works, the object is attained. No claim is made here for a scholarly treatment of the subject-matter. The companion book. Manual of ^en Buddhism, is recommended to be used with this Introduction. Kamakura, August 1934 by Dr. C. G. Jung D AiSETz Teitaro Suzuki's w'orks on Zen Buddhism are among the best contributions to the knowledge of living Buddhism that recent decades have produced, and Zen itself is the most impxDrtant fruit that has sprung from that tree whose roots are the collections of the Pali-Canon.^ We cannot be sufficiendy grateful to the author, first for the fact of his having brought Zen closer to Western understanding, and secondly for the manner in which he has achieved this task. Oriental religious conceptions are usually so very different from our Western ones that even the very translation of the words brings one up against the greatest difficulties, quite apart from the meaning of the ideas exposed, which under certain circumstances are better left untranslated. I have only to mention the Chinese \"Tao'\\ which no European translation has yet achieved. The original Buddhist writings themselves contain views and ideas which are more or less unassimilable by the average Western understanding. I do not know, for example, just what spiritual (or perhaps climatic?) background or preparation is necessary before one can deduce any completely clear idea from the Buddhist Kamma. In spite of all that we know about the essence of Zen, here too there is the question of a central perception of unsurpassed singularity. This strange perception is called Saton, and may be translated as \"Enlightenment\". Suzuki says (see page 95), \"Satori is the raison d'etre of Zen, and without it there is no Zen.\" It should not be too difficult for the Western mind to grasp what a mystic understands by \"enlightenment\", or what is known as \"enlightenment\" in religious parlance. • The origin, aa Oriental authors themselves admit, is the \"Flower Sermon\" of Buddha. On this occasion he held up a flower to a gathering of students, without uttering a word. Only Kas>apa understood him. (Shuej Ohasama: ^en. Dtr Ubendige Buddhismus in Japan, 1925, p. 3.) 9 Satori, however, depicts an art and a way of enlightenment which is practically impossible for the European to appreciate. I would point out the enlightenment of Hyakujo (Pai-chang 92-3 of this book. The following may serve as a fiirther example: A monk once went to Gensha, and wanted to learn where the entrance to the path of truth was. Gensha asked him, \"Do you hear the murmuring of the brook?\" \"Yes, I hear it,\" answered the monk. \"There is the entrance,\" the master instructed him. I will be content with these few examples, which illustrate clearly the opacity of the satori experiences. Even if we take example after example, it is still extremely hazy how such an enlightenment comes and of what it consists   in other words, by what or about what one is enlightened. Kaiten Nukariya, who was himself a Professor at the So-To-Shu Buddhist College in Tokyo,^ says, sp>eaking of enlightenment : \"Having set ourselves free from the misconception of Self, next we must awaken our innermost wisdom, pure and divine, called the Mind of Buddha, or Bodhi, or Prajna by Zen Masters. It is the divine light, the inner heaven, the key to all moral treasures, the source of all influence and power, the seat of kindness, justice, sympathy, impartial love, humanity, and mercy, the measure of all things. When this innermost wisdom is fully awakened, we are able to realize that each and every one of us is identical in spirit, in essence, in nature with the universal life or Buddha, that each ever lives face to face with Buddha, that each is beset by the abundant grace of the Blessed One, that He arouses his moral nature, that He opens his spiritual eyes, that He unfolds his new capacity, that He appoints his mission, and that life is not an ocean of birth, disease, old age and death, nor the vale of tears, but the holy temple of Buddha, the Pure Land, where he can enjoy the bliss of Nirvana. Then our minds go through an entire revolution. We are no more troubled by anger and hatred, no more bitten by envy and ambition, no more stung by sorrow and chagrin, no more overwhelmed by melancholy and despair,\" etc. That is how an Oriental, himself a disciple of Zen, describes the essence of enlightenment. It must be admitted that this passage would need only the most minute alterations in order not to be out of place in any Christian mystical book of devotion. Yet somehow it fails to help us as regards understanding the satori experience described by this all-embracing casuistry. Presumably Nukariya is speaking to Western rationalism, of which he himself has acquired a good dose, and that is why it all sounds so flatly edifying. The abstruse obscurity of the Zen anecdotes is preferable to this adaptation: ad usum Delphini  it conveys a great deal more, while saying less. ^en is anything but a philosophy in the Western sense of the word.^ This is the opinion expressed by Rudolf Otto in his introduction to Ohasama's book on ^en, when he says that Nukariya has fitted the magic oriental world of ideas into our Western philosophic categories, and confused it with these. If psycho-physical parallelism, the most wooden of all doctrines, is invoked in order to explain this mystical intuition of Not-twoness {^fichtzweiheit) and Oneness and the coincidentia oppositorium, one is completely ejected from the sphere of koan and kwatsu and satori} It is far better to allow oneself to become deeply imbued beforehand with the exotic obscurity of the Zen anecdotes, and to bear in mind the whole time that satori is a mysterium ineffabile, as indeed the Zen masters wish it to be. Between the anecdotes and the mystical enlightenment there is, for our understanding, a gulf, the pMDSsibility of bridging which can at best be indicated but never in practice achieved.' One has the feeling of touching up>on a true secret, not something that has been imagined or pretended   this is not a case of mystifying secrecy, but rather of ' \"Zen is neither psychology nor philosophy.\" Otto in Ohasama : ^<n, p. viii. * If in spite of this I attempt \"explanationa\" in what follows, I am still fully aware that in the sense ofsatcri what I say can only be useless. I could not resist, however, the attempt to manoeuvre our Western understanding at least into the proximity of an understanding—a task so difficult that in so doing one must take upon oneself certain crimes against the spirit of Zen. II an experience that baffles all languages. Satori comes as something unexpected, not to be expected. When within the realm of Christianity visions of the Holy Trinity, the Madonna, the Crucifixion or the Patron Saint are vouchsafed, one has the impression that this is more or less as it should be. That Jacob Boehme should obtain a glimpse into the centrum naturae by means of the sunbeam reflected in the tin plate is also understandable. It is harder to accept Master Eckehart's vision of \"the litde naked boy\",^ or even Swedenborg's \"man in the red coat\" who wanted to wean him from overeating, and whom, in spite of this or perhaps because of it, he recognized as the Lord God.* Such things are difficult to accept, bordering as they do on the grotesque. Many of the satori experiences, however, do not merely border on the grotesque  they are right there in the midst of it, sounding like complete nonsense. For anyone, however, who has devoted considerable time to studying with loving and understanding care the flowerlike nature of the spirit of the Far East, many of these amazing things, which drive the all too simple European from one perplexity to another, fall away. Zen is indeed one of the most wonderful blossoms of the Chinese spirit,' which was readily impregnated by the immense thought-world of Buddhism. He, therefore, who has really tried to understand Buddhist doctrine, if only to a certain degree—i.e. by renouncing various Western prejudices—will come upon certain depths beneath the bizarre cloak of the individual satori experiences, or will sense disquieting difficulties which the philosophic and religious West has up to now thought fit to disregard. As a philosopher, one is exclusively concerned with that understanding which, for its own part, has nothing to do with life. And as a Christian, one has nothing to do with paganism (\"I thank thee. Lord, that I am not as other men\"). There is no satori within these Western bounds—that is an Oriental affair. But is it really so? Have we in fact no satori? • See Texte am der deuUchen Mystik des 14 und 15, Jahrhunderts, published by Adolf Spamer, 1912, p. 143. • William White: Emanuel Swedenborg, 1867, Vol. I, p. 243. • \"Zen is undoubtedly one of the most precious and in many respects one of the most remarkable spiritual graces with which Oriental man has been blessed.\" (Suzviki: Essays, I, p. 249.) 12 When one examines the Zen text attentively, one cannot escape the impression that, with all that is bizarre in it, satori is, in fact, a matter of natural occurrence, of something so very simple^ that one fails to see the wood for the trees, and in attempting to explain it, invariably says the very thing that drives others into the greatest confusion. Nukariya* therefore is right when he says that any attempt to explain or analyse the contents of Zen vs-ith regard to enlightermaent would be in vain. Nevertheless, this author does venture to say of enlightenment that it embraces an insight into the nature of self, and that it is an emancipation of the conscious from an illusionary conception of self.' The illusion regarding the nature of self is the common confusion of the ego with self. Nukariya understands by \"self\" the All-Buddha, i.e. simply a total consciousness {Bewtisstsein- stotalitdl) of life. He quotes Pan Shan, who says, \"The world of the mind encloses the whole universe in its light,\" adding, \"It is a cosmic life and a cosmic spirit, and at the same time an individual life and an individual spirit.\"* However one may define self, it is always something other than the ego, and inasmuch as a higher understanding of the ego leads on to self the latter is a thing of wider scope, embracing the knowledge of the ego and therefore surpassing it. In the same way as the ego is a certain knowledge of my self so is the self a knowledge of my ego, which, however, is no longer experienced in the form of a broader or higher ego, but in the form of a non-ego {Nichi-Ich). Such thoughts are zdso familiar to the author of Deutsche Theologie^: \"Any creature who is to become conscious of this perfection must first lose all creaturelikeness (Geschopfesart), something-ness {Etwasheit) amd self.\" If I take any good to my- * A master sa>'s : \"Before a man studies Zen, mountains are mountains to him, and waters jirc waters. But when he obtains a glimpse into the truth of Zen through the instruction of a good master, mountauis are no longer mountains, nor waters waters   later, however, when he has really reached the place of Rest (i.e. has attained satori), mountains are again moimtains, and waters %witers.\" (Suzuki: Essays, I, p. 12.) * Religion of the Samurai, p. 123. * \"Erdightenment includes an insight into the nattire of self. It is a libera- tion of the mind from deception regarding self.\" * L.C. p. 132. * Das BucMein vom oollksmmtn Leben. Published by H. Buttner, 1907. «3 self, that comes from the delusion that it is mine, or that I am Good. That is always a sign of imperfection and folly. Were I conscious of the truth, I would also be aware that I am not Good, that Good is not mine and is not of me.\" \"Man says, 'Poor fool that I am, I was under the delusion that I was it, but I find it is and was truly God'.\" That already states a considerable amount regarding the contents of enlightenment. The occurrence of satori is interpreted and formulated as a break-through of a consciousness limited to the ego-form in the form of the non-ego-like self. This con- ception answers to the nature of Zen, but also to the mysticism of Master Eckehart.^ The master says, in his sermon on \"Blessed are the poor in spirit\" : \"When I came out from God, all things said, 'There is a God!' But that cannot make me blissful, for with it I conceive myself to be a creature. But in the break- through,^ when I wish to remain empty in the will of God, and empty also of this will of God and of all his works, and of God himself—then I am more than all creatures, for I am neither God nor creature : / am what I am, and what I will remain, now and forever ! Then I receive a jerk, which raises me above all the angels. In this jerk I become so rich that God cannot suffice me, in spite of all that he is as God, in spite of all his Godly works  for in this break-through I perceive what God and I are in common. / am then what I was,^ I grow neither less nor more, for I am an immovable being who moves all things. Here God no longer abides in man, for man through his poverty has won back what he has always been and will always be.\" Here the master is actually describing a satori experience, a release of the ego through self, to which \"Buddha-Nature\", or godly universality, is added. Since, out of scientific modesty, I do not here presume to make any metaphysical declaration, but mean a change of consciousness that can be experienced, * MeisUr Eckehart's SckrifUn und PredigUn. Published by H. Buttner, 1912. * There is a similar image in Zen : when a master was asked of what * Cf. Suzuki: Essays in Z\"^ Buddhism, pp. 220, 241. Zen signifies a glimpse into the original nature of mankind, or the recognition of original man. (Sec also p. 144.) «4 I treat satori first of all as a psychological problem. For anyone who docs not share or understand this point of view, the \"explanation\" will consist of nothing but words which have no tangible meaning for him. He is not then able to make of these abstractions a bridge to the facts related  in other words, he cannot understand how the perfume of the blossoming laurel (p. 90-1) or the tvN'eaked nose (p. 87) should effect such a con- siderable change of consciousness. The simplest thing would be, of course, to relegate all these anecdotes to the realm of amusing fairv' stories, or at least, if one accepts the facts as they are, to dispose of them as instances of self-deception. (One would also willingly use here the expression \"auto-suggestion\", that pathetic white elephant from the store of spiritual inadequacies !) A serious and responsible examination of the strange phenomena cannot lighdy pass over these facts. We can of course never decide definitely whether a person is really \"enlightened\" or \"redeemed\", or whether he merely imagines it. We have no criteria for this. Moreover, we know weU enough that an imaginary pain is often far more painful than a so-called real one, in that it is accompanied by a subtle moral suffering caused by the gloomy feeling of secret self-accusation. It is not, therefore, a question of \"actual fact\" but o[ spiritual reality  that is to say, the psychic occurrence of the happening known as satori. Every spiritual happening is a picture and an imagination  were this not so, there could be no consciousness and no phenomenality of the occurrence. The imagination itself is a psychic occurrence, and therefore whether an \"enlightenment\" is called \"real\" or \"imaginary\" is quite immaterial. The man who has enlightenment, or alleges that he has it, thinks in any case that he is enlightened. WTiat others think about it can determine nothing whatever for him with regard to his experience. Even if he were to lie, his lie would be a spiritual fact. Yes, even if all religious reports were nothing but conscious inventions and falsifications, a very interesting psychological treatise could still be written on the fact of such lies, with the same scientific treatment w^th which the psychopathology of delusions is presented. The fact that there is a religious movement upon which many briUiant minds have worked over a period of many centuries is sufficient reason for venturing at least »5 upon a serious attempt to bring such happenings within the realm of scientific understanding. Earlier on I raised the question of whether we have anything like satori in the West. If we except the sayings of our Western mystics, a superficial glance discloses nothing that could be likened to it in even the faintest degree. According to our thinking, the possibility that there are steps in the development of consciousness does not exist. The mere thought that there is a tremendous psychological difference between the consciousness of the existence of an object and the \"consciousness of the consciousness\" of an object borders on a subtlety which can scarcely be answered. One could hardly bring oneself to take such a problem so seriously as to take account of the psychological conditions of the setting of any such problem. It is characteristic that the posing of such and similar questions does not as a rule arise from any intellectual need, but where it exists is nearly always rooted in a primitive religious practice. In India it was Yoga and in China Buddhism which supplied the motive power for these attempts to wrest oneself from the bonds of a certain state of consciousness which was felt to be incomplete. As far as Western mysticism is concerned, its texts are full of instructions as to how man can and must release himself from the \"I-ness\" (Ichha/tigkeit) of his consciousness, so that through the know- ledge of his being he may raise himself above it and reach the inward (godlike) man. Ruysbroeck makes use of an image which is also known to Indian philosophers, namely the tree that has its roots above and its top below,^ \"And he must climb up into the tree of belief, which grows downwards, since it has its roots in the godhead.\"^ Ruysbroeck also says, like Yoga, \"Man shall be free and without images, freed from all attachments and empty of all creatures.\"^ \"He must be untouched by lust and suffering, profit and loss, rising and falling, concern ' \"There is the old tree, her roots grow upwards, her branches downwards. ... It is called Brahman, and he alone is the undying.\" {Kalha-Upanishad, II Adhyaya, 6 Valli, i.) It cannot be supposed that this Flemish mystic, who was bom in I973> borrowed this image from any Indian text. * John of Ruysbroeck : The Adornment of the Spiritual Marriage. Transl. from the Flemish by C. A. Wynschck Dom, igi6, p. 47. about others, enjoyment and fear, and he shall not cling to any creature.\"^ It is in this that the \"unity\" of the being consists, and this means \"being turned inwards\". This means \"that a man is turned inwards, in his own heart, so that thereby he can feel and understand the inner working and the inner words of God\".^ This new condition of consciousness, arising from religious practice, is distinguished by the fact that outward things no longer affect an ego-like consciousness, whence a reciprocal attachment has arisen, but that an empty consciousness stands open to another influence. This \"other\" influence will no longer be felt as one's own activity, but as the work of a non-ego which has consciousness as its object.' It is as though the subject-character of the ego had been overrun, or taken over, by another subject which has taken the place of the ego.* It is a question of that well-known religious experience which has been formulated by St. Paul {Gal. ii, 20). Here a new condition of consciousness is undoubtedly described, separated from the former condition of consciousness by means of a far-reaching process of religious transformation. It could be objected that consciousness in itsel/was not changed, but only the consciousness of something, just as though one had turned over the page of a book and now saw a different picture with the same eyes. I am afraid this conception is no more than an arbitrary interpretation, as it does not conform with the facts. The fact is that in the text it is not merely a different picture or object that is described, but rather the experience of a transformation, often resulting from the most violent convulsions. The erasing of one picture and its substitution by another is quite an everyday occurrence which has none of the attributes of a transformation experience. It is not that something different is seen, but that one sees differently. It is as though the spatial act of seeing were changed by a new dimension. When the master asks, \"Do you hear the murmuring of the brook?\" he obviously means something quite different from ordinary \"hearing\".^ Consciousness is something like percep- tion, and just as the latter is subjected to conditions and limits, so is consciousness. For instance, one can be conscious at various stages, in a narrower or wider sphere, more superficially or more deeply. These diflferences of degree are, however, often differences of character, in that they depend completely upon the development of the personality — that is to say, upon the nature of the perceiving subject. The intellect has no interest in the condition of the perceiving subject, in so far as the latter thinks only logically. The intellect is of necessity occupied with the digesting of the contents of the consciousness, and with the methods of digesting. It needs a philosophical passion to force the attempt to overcome the intellect and to push through to perception of the perceiving. Such a passion, however, is practically indistinguishable from religious motive power, and this whole problem belongs, there- fore, to the religious transformation process, which is incom- mensurable with intellect. Antique philosophy is undoubtedly to a great extent at the service of the transformation process, which can be said less and less of the new philosophy. Schopenhauer is implicitly antique. Nietzsche's J^arathustra is, however, no philosophy but a dramatic transformation pro- cess, which has completely swallowed up intellect. It is no longer a question of thought, but in the highest sense ofthe thinker of thought—and this on every page of the book. A new man, a completely transformed man, is to appear on the scene, one who has broken the shell of the old man and who not only looks upon a new heaven and a new earth, but has created them. Angelus Silesius has expressed it rather more modestly than Zarathustra : Mein Leib ist ein Schal, in dent ein KQchelein Vom Geist der Ewigkeit will ausgebriiUt sein. (My body is a shell, in which a chicken will be hatched from the spirit of eternity.) Satori corresponds in the province of Christianity to a religious transformation experience. As there are, however, various 1 Suzuk isays of this change, \"The earlier form of contemplation is for- 18 degrees and ts-pcs of such an experience, it would not be super- fluous to designate more exactly that category which corresponds most closely to the Zen experience. This is undoubtedly the mN^stic experience, distinguishable from similar experiences in that its preparation consists of \"letting oneself go\" {suh lassen), an \"emptying of images\" and other such things   this is in contrast to religious experiences which, like the Exercises of St. Ignatius, are based upon the practice and en\\Tsaging of holy images. I should like to include in this latter category transformation through belief and prayer, and through communal experience in Protestantism, since in this a ver^' definite supposition plan's the decisive role, and by no means \"emptiness\" or \"release\". The statement, characterisdc of the latter state, \"God is a Nothing\", would be incompatible in principle \\s-ith the contemplation of passion, with belief and communal expectation. Thus the analogy- ofsatcri with \\Vestem experience is confined to those few Christian m\\-stics whose sayings for the sake of paradox^- skirt the border of heterodoxv* or have actually over- stepped it. It was avowedly this quality' thai drew dovvTi upon Meister Eckehart the condemnation of the Church. If Buddhism were a \"Church\" in our sense of the word, the Zen movement would certainly have been an intolerable burden to her. The reason for this is the extremely individual form of the methods,* as also the iconoclastic attitude of many masters.' In so far as Zen is a movement, collective forms have been shap)ed in the course of the centuries, as can be seen from Suzuki's works on TTu Training of the ^en Buddhist Monk,' but in form and content they concern externals only. Apart firom the t^pe of habits, the way of spiritual training or forming seems to consist of koan methods. By kocn is understood a paradoxical question, expression or action of the master. According to Suzuki's description it seems to be chiefly a matter of master questions • \"Sciori is the most intimate of all individual experiences.\" (Suzuki : are riding.\" (Suzuki : Essays in ^en Buddhism, II, p. 59.) A master saNT : \"Understanding which does not understand, that is Buddha. •9 handed down in the form of anecdotes. These are submitted by the teacher to the student for meditation. A classic example is the Wu- or Mu-anecdote. A monk once asked the master, \"Has a dog Buddhist nature, too?\", whereupon the master answered, \"Wu.\" As Suzuki remarks, this \"Wu\" means quite simply \"Wu\", obviously just what the dog himself would have said in answer to the question. At first glance it would apj>ear that the submission of such a question as food for meditation would mean an anticipation or prejudicing of the final result, and that the contents of the meditation would be determined thereby, rather like the Jesuit Exercises, or certain Yogi meditations, the substance of which is determined by a task submitted by the teacher. The koans, however, are of such great variety, such ambiguit)', and above all of such overwhelming paradoxy, that even an expert is completely in the dark as to what may emerge as a suitable solution. Moreover, the descriptions of the experiences are so obscure that in no single case could one perceive any unobjectionable rational connection betsveen the koan and the experience. Since no logical succession can ever be proved, it is to be suppKDsed that the koan method lays not the smallest restriction up>on the freedom of the spiritual occurrences, and that the final result therefore comes fi-om nothing but the individual predisposition of the initiate. The complete destruction of the rational intellect aimed at in the training creates an al- most perfect lack of supposition of the consciousness. Conscious supposition is thereby excluded as far as possible, but not unconscious supposition  that is, the existing but unperceived psychological disposition, which is anything but emptiness and lack of supposition. It is a nature-given factor, and when it answers—as is ob\\'iously the satori experience—it is an answer of Nature, who has succeeded in conveying her reactions direct to the consciousness.^ What the unconscious nature of the student opposes to the teacher or to the koan as an answer is manifestly satori. This, at least, appears to me to be the \\-iew which, by all descriptions, would express the essence of satori more or less correctly. This view is also supported by the fact ^ Suzuki {Essays in ^en Buddhism, II, p. 46) says, \". . . Zen consciousness . . . which is a glunpse into the unconscious\". 30 that the \"glimpse into one's ovm nature\", the \"original man\" and the depth of the being are often to the Zen master a matter of supreme concern.^ Zen differs from all other philosophic and religious meditation practices in its principle of lack of supposition ( Voraussetzung) . Buddha himself is sternly rejected   indeed, he is almost blasphemously ignored, although—or perhaps just because—he could be the strongest spiritual supposition of all. But he too is an image and must therefore be set aside. Nothing must be present except what is actually there   that is, man with his complete, unconscious supposition, of which, simply because it is unconscious, he can never, never rid himself. The answer which appears to come from a void, the light which flares up from the blackest darkness, these have always been experiences of wonder- ful and blessed illumination. The world of consciousness is inevitably a world full of restrictions, of walls blocking the way. It is of necessity always one-sided, resulting from the essence of consciousness. No consciousness can harbour more than a very small number of simultaneous conceptions. All else must lie in shadow, withdrawn from sight. To increase the simultaneous content creates immediately a dimming of consciousness   confusion, in fact, to the point of disorientation. Consciousness does not simply demand, but is, of its very essence, a strict limitation to the few and hence the distinct. For our general orientation we are indebted simply and solely to the fact that through attentiveness we are able to effect a comparatively rapid succession of images. Attentiveness is, however, an effort of which we are not permanently capable. We have therefore to make do, so to speak, with a minimum of simultaneous perceptions and successions of images. Hence wide fields of possible perceptions are per- ai manently eliminated, and consciousness is always bound to the narrowest circle. What would happen if an individual consciousness were to succeed in embracing at one glance a simultaneous picture of all that it could imagine is beyond conception. If man has already succeeded in building up the structure of the world from the few clear things that he can perceive at one and the same time, what godly spectacle would present itself to his eyes were he able to perceive a great deal all at once and distinctly? This question only concerns perceptions that are possible to us. But if we add to those the unconscious contents —i.e. contents which are not yet, or no longer, capable of consciousness—and then try to imagine a complete spectacle, why, this is beyond the most audacious fantasy. This unimagin- ableness is of course a complete impossibility in the conscious form, but in the unconsciousness form it is a fact, inasmuch as all that is seething below is an ever-present potentiality of conception. The unconscious is an unglimpsable completeness of all subliminal psychic factors, a \"total exhibition\" of potential nature. It constitutes the entire disposition from which con- sciousness takes fragments from time to time. Now if consciousness is emptied as far as possible of its contents, the latter will fall into a state (at least a transitory state) of unconsciousness. This displacement ensues as a rule in Zen through the fact of the energy of the conscious being withdrawn from the contents and transferred either to the conception of emptiness or to the koan. As the two last-named must be stable, the succession of images is also abolished, and with it the energy which maintains the kinetic of the conscious. The amount of energy that is saved goes over to the unconscious, and reinforces its natural supply up to a certain maximum. This increases the readiness of the unconscious contents to break through to the conscious. Since the emptying and the closing down of the conscious is no easy matter, a special training and an indefinitely long period of time^ is necessary to produce that maximum of tension which leads to the final break-through of unconscious contents into the conscious. The contents which break through are by no means com- 22 pletely unspecified. As psychiatric experience with insanity shows, peculiar relations exist between the contents of the conscious and the delusions and deliria that break in upon it. They are the same relations as exist between the dreams and the working conscious of normal men. The connection is in substance a compensatory^ relationships : the contents of the uncon- scious bring to the surface everything necessary^ in the broadest sense for the completion, i.e. the completeness, of conscious orientation. If the fragments offered by, or forced up from, the unconscious are successfully built into the life of the conscious, a psychic existence form results, which corresponds better to the whole of the individual personality, and therefore abolishes fruitless conflict between the conscious and the unconscious personality. Modem psycho-therapy rests upon this principle, inasmuch as it was able to break away from the historic prejudice that the unconscious harbours only infantile and morally inferior contents. There is certainly an inferior comer, a lumber-room of dirty secrets, which are however not so much unconscious as hidden and only half forgotten. But this has about as much to do with the whole of the unconscious as a hollow tooth has with the complete personality. The unconscious is the matrix of all metaphysical assertions, of all mythology, all philosophy (in so far as it is not merely critical) and all forms of life which are based upon psychological suppositions. Every invasion of the unconscious is an answer to a definite condition of the conscious, and this answer follows from the whole of the idea-possibilities that are present   that is to say, from the complete disposition which, as explained above, is a simultaneous image in potentia of psychic existence. The splitting up into the single, the one-sided, the fragmentary character suits the essence of the conscious. The reaction from the disposition always has the character of completeness, as it corres- ponds with a nature which has not been divided up by any * More probable than one that is purely complementary. * For this I must refer the reader to medico-psychological specialist litera- ture. * This \"necessity\" is a working hypothesis. People can be, and are, of very different opinions about it. For instance, are religious conceptions \"necessary\"? Only the course of the individual life can decide this, i.e. individual experience. There are no abstract criteria for this, 23 discriminating conscious.^ Hence its overpowering effect. It is the unexpected, comprehensive, completely illuminating answer, which operates all the more as illumination and revelation, since the conscious has wedged itself into a hopeless blind-alley.^ When therefore, after many years of the hardest practice and the most strenuous devastation of rational understanding, the Zen student receives an answer—the only true answer — from Nature herself, everything that is said of satori can be understood. As can easily be seen, it is the naturelike-ness {Naturhaftigkeit) of the answer which shines forth from most of the Zen anecdotes. Yes, one can accept with complete complaisance the enlightened student who, as one story relates, wished his master a sound thrashing as a reward (see pages 93-4). How much wisdom lies in the master's \"Wu\", the answer to the question about the Buddha nature of the dog ! One must always consider, however, that on the one hand there are any number of people who cannot distinguish between a spiritual witticism and nonsense, and on the other hand very many people who are convinced of their own cleverness to such an extent that they have never in their lives met any but fools. Great as is the value of Zen Buddhism for the understanding of the religious transformation process, its use among Western people is very improbable. The spiritual conceptions necessary to Zen are missing in the West. Who amongst us would produce such implicit trust in a superior master and his incomprehensible ways? This respect for the greater human personality exists only in the East. Who could boast of believing in the possibility of a transformation experience paradoxical beyond measure  to the extent, moreover, of sacrificing many years of his life to the wearisome pursuit of such an object? And finally, who would dare to take up>on himself the authority of a heterodoxical transformation experience? Let it be a man of little trustworthiness, one who, maybe from pathological reasons, has too much to say for himself  such a man would have no cause to * \"When mind discriminates, there is manifoldness of things  when it does not it looks into the true state of things.\" (Suzuki : Elssays in ^tn Buddhum, I, p. 88.) * See the passage beginning, \"Have your naind like unto space. . . .\" (Suzuki : Essays in J^en Buddhism, I, p. 209.) 84 complain of any lack of following among us. But if the \"Master\" sets a hard task, which requires more than a lot of parrot talk, the European begins to have doubts, for the steep path of selfdevelopment is to him as mournful and dark as Hell. I have no doubt that the satori experience does occur also in the West, for we too have men who scent ultimate ends and will spare themselves no pains to draw near to them. But they will keep silence, not only out of shyness but because they know that any attempt to convey their experiences to others would be hopeless. For there is nothing in our culture approaching these aspirations, not even the Church, the custodian of religious goods. It is in fact her function to oppose all such extreme experiences, for these can only be heterodox. The only movement within our culture which partly has, and partly should have, some understanding of these aspirations is psychotherapy. It is therefore not a matter of chance that this foreword is written by a psychotherapist. Taken basically, psychotherapy is a dialectic relationship between the doctor and the patient. It is a discussion between two spiritual wholes, in which all wisdom is merely a tool. The goal is transformation  not indeed a predetermined, but rather an indeterminable, change, the only criterion of which is the disappearance of I-ness. No efforts on the part of the doctor force the experience. The most he can do is to make easy the path of the patient towards the attainment of an attitude which will oppose the least resistance to the decisive experience. If knowledge plays no small part in our Western pr", "filename": "Daiets Taiatsu Suzuki - An Introduction to Zen Buddhism.pdf.pdf", "meta": {"bla": "huahaua"}}