{"text": "Microsoft Word - 2D_Semantics.doc \nTwo-Dimensional Semantics   David J. Chalmers \nPhilosophy Program \nResearch School of Social Sciences \nAustralian National University    Two-dimensional approaches to semantics, broadly understood, recognize two  “dimensions” of the meaning or content of linguistic items. On these approaches,  expressions and their utterances are associated with two different sorts of semantic  values, which play different explanatory roles. Typically, one semantic value is  associated with reference and ordinary truth-conditions, while the other is associated  with the way that reference and truth-conditions depend on the external world. The  second sort of semantic value is often held to play a distinctive role in analyzing  matters of cognitive significance and/or context-dependence.  In this broad sense, even Frege’s theory of sense and reference might qualify as a  sort of two-dimensional approach. More commonly, two-dimensional approaches are  understood more narrowly to be a species of possible-worlds semantics, on which  each dimension is understood in terms of possible worlds and related modal notions.  In possible-world semantics, linguistic expressions and/or their utterances are  first associated with an extension. The extension of a sentence is its truth-value: for  example, the extension of ‘Plato was a philosopher’ is true. The extension of a  singular term is its referent: for example, the extension of ‘Don Bradman’ is  Bradman. The extension of a general term is the class of individuals that fall under the  term: for example, the extension of ‘cat’ is the class of cats. Other expressions work  similarly.  One can then associate expressions with an intension, which is a function from  possible worlds to extensions. The intension of a sentence is a function that is true at a  possible world if and only if the sentence is true there: the intension of ‘Plato was a  philosopher’ is true at all worlds where Plato was a philosopher. The intension of a  singular term maps a possible world to the referent of a term in that possible world:  In (E. Lepore & B. Smith, eds) Oxford Handbook of the Philosophy of Language. Oxford University \nPress, forthcoming.  the intension of ‘Don Bradman’ picks out whoever is Bradman in a world. The  intension of a general term maps a possible world to the class of individuals that fall  under the term in that world: the intension of ‘cat’ maps a possible world to the class  of cats in that world.  It can easily happen that two expressions have the same extension but different  intensions. For example, Quine’s terms ‘cordate’ (creature with a heart) and ‘renate’  (creature with a kidney) pick out the same class of individuals in the actual world, so  they have the same extension. But there are many possible worlds where they pick out  different classes (any possible world in which there are creatures with hearts but no  kidneys, for example), so they have different intensions. When two expressions have  the same extension and a different intension in this way, the difference in intension  usually corresponds to an intuitive difference in meaning. So it is natural to suggest  that an expression’s intension is at least an aspect of its meaning.  Carnap (1947) suggested that an intension behaves in many respects like a  Fregean sense, the aspect of an expression’s meaning that corresponds to its cognitive  significance. For example, it is cognitively significant that all renates are cordates and  vice versa (this was a nontrivial empirical discovery about the world), so that ‘renate’  and ‘cordate’ should have different Fregean senses. One might naturally suggest that  this difference in sense is captured more concretely by a difference in intension, and  that this pattern generalizes. For example, one might suppose that when two singular  terms are cognitively equivalent (so that ‘a=b’ is trivial or at least knowable a priori,  for example), then their extension will coincide in all possible worlds, so that they  will have the same intension. And one might suppose that when two such terms are  cognitively distinct (so that ‘a=b’ is knowable only empirically, for example), then  their extensions will differ in some possible world, so that they will have different  intensions. If this were the case, the distinction between intension and extension could  be seen as a sort of vindication of a Fregean distinction between sense and reference.  However, the work of Kripke (1980) is widely taken to show that no such  vindication is possible. According to Kripke, there are many statements that are  knowable only empirically, but which are true in all possible worlds. For example, it  is an empirical discovery that Hesperus is Phosphorus, but there is no possible world  in which Hesperus is not Phosphorus (or vice versa), as both Hesperus and  Phosphorus are identical to the planet Venus in all possible worlds. If so, then  ‘Hesperus’ and ‘Phosphorus’ have the same intension (one that picks out the planet  Venus in all possible worlds), even though the two terms are cognitively distinct. The  same goes for pairs of terms such as ‘water’ and ‘H2O’: it is an empirical discovery  that water is H2O, but according to Kripke, both ‘water’ and ‘H2O’ have the same  intension (picking out H2O in all possible worlds). Something similar even applies to  terms such as ‘I’ and ‘David Chalmers’, at least as used by me on a specific occasion:  ‘I am David Chalmers’ expresses nontrivial empirical knowledge, but Kripke’s  analysis entails that I am David Chalmers in all worlds, so that my utterances of these  expressions have the same intension. If this is correct, then intensions are strongly  dissociated from cognitive significance.  Still, there is a strong intuition that the members of these pairs (‘Hesperus’ and  ‘Phosphorus’, ‘water’ and ‘H2O’, ‘I’ and ‘David Chalmers’) differ in some aspect of  meaning. Further, there remains a strong intuition that there is some way the world  could turn out so that these terms would refer to different things. For example, it  seems to be at least epistemically possible (in some broad sense) that these terms  might fail to corefer. On the face of it, cognitive differences between the terms is  connected in some fashion to the existence of these possibilities. So it is natural to  continue to use an analysis in terms of possibility and necessity to capture aspects of  these cognitive differences. This is perhaps the guiding idea behind two-dimensional  semantics.  Two-dimensional approaches to semantics start from the observation that the  extension and even the intension of many of our expressions depend in some fashion  on the external world. As things have turned out, my terms ‘water’ and ‘H2O’ have  the same extension, and have the same (Kripkean) intension. But there are ways  things could have turned out so that the two terms could have had a different  extension, and a different intension. So there is a sense in which for a term like  ‘water’, the term’s extension and its Kripkean intension depend on the character of  our world. Given that this world is actual, it turns out that ‘water’ refers to H2O, and  its Kripkean intension picks out Venus in all possible worlds. But if another world  had been actual (e.g. Putnam’s Twin Earth world in which XYZ is the clear liquid in  the oceans), ‘Hesperus’ might have referred to something quite different (e.g. XYZ),  and it might have had an entirely different Kripkean intension (e.g. one that picks out  XYZ in all worlds).  This suggests a natural formalization. If an expression’s (Kripkean) intension  itself depends on the character of the world, then we can represent this dependence by  a function from worlds to intensions. As intensions are themselves functions from  worlds to extensions, this naturally suggests a two-dimensional structure. We can  represent this structure diagramatically as follows:     H2O-world XYZ-world …  … … … …    This diagram expresses an aspect of the two-dimensional structure associated  with the term ‘water’. It is intended to express the intuitive idea that if the H2O -world  turns out to be actual (as it has), then ‘water’ will have a Kripkean intension that picks  out H2O in all worlds; but if the XYZ-world turns out to be actual (as it has not), then  ‘water’ will have a Kripkean intension that picks out XYZ in all worlds. Intuitively,  the worlds in the column on the left represent ways the actual world can turn out  (these are sometimes thought of more precisely as possible contexts of utterances, and  are sometimes thought of as epistemic possibilities), while the worlds across the top  reflect counterfactual ways that a world could have been (these are sometimes thought  of more precisely as possible circumstances of evaluation, and sometimes thought of  as metaphysical possibilities). It is sometimes said that worlds on the left column (one  world per row), making up the “first dimension” of the matrix, correspond to different  worlds considered as actual; while the worlds in the top row (one world per column),  making up the “second dimension” of the matrix, correspond to different worlds  considered as counterfactual.  This two-dimensional matrix can be seen as a two-dimensional intension: a  function from ordered pairs of worlds to extensions. Such a function is equivalent to a  function from worlds to intensions, and seen this way can be regarded as capturing the  intuitive idea that a term’s intension depends on the character of the actual world. One  can also recover the intuitive idea that a term’s extension depends on the character of  the actual world by examining the “diagonal” of this matrix, i.e. the cells that  correspond to the same world considered as actual and as counterfactual. In the  example above: where the H2O -world is considered as actual and as counterfactual,  then ‘water’ picks out H2O, while if the XYZ-world is considered as actual and as  counterfactual, then ‘water’ picks out XYZ. We can say that an expression’s  “diagonal intension” is a function mapping a world w to the term’s extension when w  is taken as both actual and as counterfactual. So the diagonal intension of ‘water’  We can then see how pairs of terms with the same extension and the same  Kripkean intension might nevertheless have different two-dimensional intensions, and  different diagonal intensions. For example, ‘water’ and ‘H2O’ have the same  Kripkean intension, but it is plausible that if the XYZ-world had turned out to be  actual, they would have had different Kripkean intensions: ‘water’ would have had an  intension that picked out XYZ in all worlds, while ‘H2O’ still would have had an  intension that picked out H2O in all worlds. If so, then these terms have different two- dimensional intensions and different diagonal intensions.  One can make a case that something similar applies with ‘Hesperus’ and  ‘Phosphorus’, and with ‘I’ and ‘David Chalmers’: the members of each pair have a  different two-dimensional intension and a different diagonal intension. If so, then this  begins to suggest that there is some sort of connection between an expression’s two- dimensional intension (or perhaps its diagonal intension) and its cognitive  significance. One might even speculate that an expression’s diagonal intension  behaves in some respects like a Fregean sense, in a way that might vindicate Carnap’s  project.  At this point it must be acknowledged that things are not so simple. A number of  different two-dimensional approaches to semantics have been developed in the  and Jackson (1998), among others; and closely related two-dimensional analysis of  modal notions have been put forward by Evans (1977) and by Davies and  Humberstone (1981). These approaches differ greatly in the way that they make the  intuitive ideas above precise. They differ, for example, in just what they take the  “worlds” in the left column to be, and they differ in their analysis of how a term’s  intension and/or extension depends on the character of the actual world. As a result,  different approaches associate these terms with quite different sorts of two- dimensional semantic values, and these semantic values have quite different  connections to cognitive significance.  In what follows, I will first go over the two-dimensional approaches pioneered in  the 1970s by Kaplan, Stalnaker, Evans, and Davies and Humberstone.1 Each of these  approaches can be seen as sharing some of the formal structure described above, but  with quite different conceptual underpinnings. Each of the approaches asserts some  sort of connection between two-dimensional semantic values and apriority, but the  connection is usually limited in scope, applying to indexicals (Kaplan) and to  descriptive names (Evans), and ‘actually’-involving expressions (Davies and  Humberstone), while Stalnaker’s later work rejects a connection to apriority  altogether. I will then describe the more general two-dimensional approach to  semantics developed in the 1990s by Chalmers, Jackson, and others. This approach  associated two-dimensional semantic values with expressions of all kinds, and asserts  a strong general connection between these semantic values and the domain of  apriority and cognitive significance. I will close by briefly describing some  applications of the framework, and by considering and responding to a number   of objections.  2  Early two-dimensional approaches  2.1  Kaplan: Character and content  Perhaps the best-known broadly two-dimensional approach is Kaplan’s analysis  of the character and content of indexicals (Kaplan 1979, 1989). According to Kaplan,  his work is partly grounded in work in tense logic by Kamp (1971) and Vlach (1973),  which gives a sort of two-dimensional analysis of the behavior of ‘now’. Kaplan  applies his analysis to indexicals such as ‘I’, ‘here’, and ‘now’, as well as to  demonstratives such as ‘this’ and ‘that’. Kaplan’s well-known analysis is described  elsewhere in this volume, so I will describe it only briefly here.  For Kaplan, the “worlds” involved in the first dimension are contexts of  utterance: these can be seen as at least involving the specification of a speaker and a  time and place of utterance, within a world. The “worlds” involved on the second  dimension are circumstances of evaluation: these are ordinary possible worlds at  which the truth of an utterance is to be evaluated.  Consider an expression such as:  (1) I am hungry now  According to Kaplan’s analysis, when this expression is uttered by Joe at time t1,  it expresses a proposition that is true if and only if Joe is hungry at t1. We can call this  proposition expressed the content of the utterance. This content can naturally be  represented as an intension that is true at all and only those worlds (those  circumstances of evaluation) in which Joe is hungry. (Kaplan regards propositions as  structured entities rather than intensions, but the difference does not matter much  here.) In a different context — say, a context with Diana speaking at t2 — an utterance  of the same expression will have a different content. This content will be a  proposition that is true at a world if and only if Diana is hungry at t2 in that world.  The character of an expression is a function from contexts to contents, mapping  a context of utterance to the content of that expression in that context. (If content is  seen as an intension, then character is a sort of two-dimensional intension.) So the  character of ‘I am hungry’ maps the first context above to the proposition that Joe is  hungry at t1, and the second context above to the proposition that Diana is hungry at  t2. Extending this idea to subsentential indexical terms, we can say that the character  of ‘I’ maps the first context to Joe and the second context to Diana; more generally, it  maps any context into the speaker in that context. Similarly, the character of ‘now’  maps any context into the time specified in that context.  The above definition of character is still somewhat imprecise, and many tricky  issues come up in giving a precise definition. But to a rough first approximation, one  can say that the character of an expression maps a context to the content that the  expression would have if uttered in that context. There is more to say than this  (especially as Kaplan intends his analysis to apply even to contexts in which there is  no token of the relevant utterance), but this is enough for now. In general, character is  associated with an expression type rather than with an expression token, although this  matter is complicated somewhat by the case of demonstratives such as ‘this’ and  ‘that’, whose character may vary between different utterances.  On Kaplan’s analysis, the character of indexicals such as ‘I’, ‘now’, and ‘here’,  as well as the character of demonstratives such as ‘this’ and ‘that’, reflects their  cognitive significance. For example, ‘I am here now’ has a propositional content that  is true in only some worlds, but its character yields a proposition that is true in all  contexts of utterance. (Kaplan does not “diagonalize” character into an intension, but  it would be easy enough to do so. If one did so, then ‘I am here now’ would be  associated with a diagonal intension that is necessarily true.) So the character rather  than the content seems to reflect the fact that the sentence can be known a priori (or  near enough). Likewise, when a true utterance of ‘this is that’ is cognitively  significant, the occurrences of ‘this’ and ‘that’ will refer to the same object, but their  characters will differ. So at least in these domains, character behaves a little like a  Fregean sense.  This behavior does not extend to other expressions, however. For example,  Kaplan holds that names refer to the same individual in any context of utterance.   On this view, co-extensive names such as ‘Mark Twain’ and ‘Samuel Clemens’ will  have exactly the same character, and an identity such as ‘Mark Twain is Samuel  Clemens’ will have a character that yields a true proposition in every context, even  though the identity appears to be a posteriori and cognitively significant. Something  similar applies to natural kind terms such as ‘water’. So on Kaplan’s analysis, names  and natural kind terms have a “constant character” that is dissociated from their  cognitive roles.  One can diagnose the situation by noting that character is most closely tied to the  patterns of context-dependence associated with an expression, rather than to the  expression’s cognitive significance. In the case of indexicals, the patterns of context- dependence of an expression are themselves closely associated with the expression’s  cognitive significance. But for many other expressions, such as names and natural  kind terms, cognitive significance is strongly dissociated from patterns of context- dependence. (The same goes for numerous ordinary context-dependent expressions,  such as ‘tall’.) As a result, in the general case, Kaplan’s framework is better suited to  the analysis of the context-dependence of expressions than to an analysis of their  cognitive significance.  2.2  Stalnaker: Diagonal proposition and proposition expressed  Stalnaker’s analysis starts with the idea that although sentences such as  ‘Hesperus is Phosphorus’ express necessary truths, they are sometimes used to convey  contingent information about the world. Stalnaker (1978) analyzes this contingent  information as the diagonal proposition associated with an utterance.  On Stalnaker’s analysis, the proposition expressed by an utterance is a standard  intension, or a set of possible worlds. So the proposition expressed by an ordinary  utterance of ‘Hesperus is Phosphorus’ is the set of worlds in which Hesperus is  Phosphorus, which is the set of all worlds (leaving aside questions about existence).  Stalnaker defines the propositional concept associated with an utterance as a function  from possible worlds to propositions, mapping a world to the proposition that that  utterance would express in that world. He then defines the diagonal proposition  associated with an utterance as a function that maps a possible world to the truth value  of that utterance when used in that possible world.  Stalnaker individuates utterances in such a way that a given utterance could have  been used with an entirely different meaning. For example, an utterance of ‘Hesperus  is Phosphorus’ could have been used to express the proposition that Mark Twain is  George Bush, in a world w in which ‘Hesperus’ is used as a name for Twain and  ‘Phosphorus’ is used as a name for Bush. It follows that while the propositional  concept of my utterance maps the actual world to the proposition that Hesperus is  Phosphorus, it maps world w to the proposition that Twain is Bush (which is itself  presumably the empty set of worlds). The diagonal proposition of my utterance maps  the actual world to the truth-value of the former proposition in the actual world (true),  and maps world w to the truth-value of the latter proposition in w (false). So although  my utterance of ‘Hesperus is Phosphorus’ expresses a necessary proposition in the  ordinary sense, it is associated with a contingent diagonal proposition.  Stalnaker’s propositional concept is a sort of two-dimensional intension, and his  diagonal proposition is the associated diagonal intension. Like Kaplan, Stalnaker’s  framework can be seen as capturing a certain way in which the content of an utterance  depends on the context in which it is uttered. But while Kaplan’s analysis is in effect  restricted to contexts in which the expression retains its original meaning, Stalnaker’s  analysis ranges over contexts in which the expression is used with entirely different  meanings. As a result, Stalnaker characterizes his use of the two-dimensional  framework as a “metasemantic” use: unlike Kaplan’s character, diagonal propositions  are not really part of the meaning of an utterance, but rather capture something about  how meaning is determined by the external world.  Stalnaker uses this framework mainly to analyze the information conveyed by  assertions. In a context where the hearer knows the full meanings of the terms used in  an utterance (e.g., if they know that ‘Hesperus’ and ‘Phosphorus’ both refer to  Venus), and where this knowledge is common ground between speaker and hearer,  then the utterance will convey its original propositional content. But if the hearer does  not know the meanings of the terms, then the utterance will convey a different  content. In particular, it will convey the diagonal proposition of the utterance: here,  the proposition that ‘Hesperus is Phosphorus’ expresses a truth. If the common  ground between speaker and hearer includes partial knowledge of meaning — say, the  knowledge that ‘Hesperus’ is used to refer to the evening star and that ‘Phosphorus’ is  used to refer to the morning star — then worlds outside this common ground are in  effect excluded by presuppositions, and the diagonal proposition will in effect be  equivalent to the proposition that the morning star is the evening star (at least across  the relevant range of worlds). So in such a context, an assertion of ‘Hesperus is  Phosphorus’ will convey the information that the morning star is the evening star.  In his 1978 paper, Stalnaker says that if one defines an operator ‘†’ such that ‘†P’  is true iff P has a necessary diagonal proposition, then ‘†’ is equivalent to the “a priori  truth” operator. In later work (e.g. Stalnaker 2004), however, he retracts that claim. It  is easy to see why. Even paradigmatic a priori claims such as ‘1+1=2’ do not have a  necessary diagonal proposition: the diagonal proposition of ‘1+1=2’ is false at a world  where ‘1’ refers to 3 and ‘2’ refers to 7, for example. It is true that a statement such as  ‘Hesperus is the evening star’, which is arguably an a priori truth, will have a diagonal  proposition that is true in all worlds in a class that is restricted as in the previous  paragraph (by imposing the restriction that ‘Hesperus’ is used to refer to the evening  star). But in this case, it is the restriction that is doing all the work in connecting the  diagonal proposition to a priori truth.  Because of this, there is no strong connection between diagonal propositions and  a priori truth. There is sometimes a connection between an utterance’s diagonal  proposition and its cognitive significance, but this connection arises only in certain  contexts where certain special restrictions due to limited knowledge of meaning are in  force. Because of this, Stalnaker’s diagonal propositions cannot be used to ground a  two-dimensional approach to the cognitive significance of linguistic items in general.  Instead, they are most useful for analyzing what is conveyed by utterances when there  is limited knowledge of meaning in place.  2.3  Evans: Deep necessity and superficial necessity  Evans’ analysis (Evans 1977) is focused on descriptive names: names whose  reference is fixed by a description. His main example is the name ‘Julius’, which is  stipulated to be a name for whoever invented the zip, if anyone uniquely invented it (I  will omit references to uniqueness in what follows, but they should be tacitly  understood). He considers the following sentence:  (2) If anyone invented the zip, Julius invented the zip.  If one follows Kripke, then (2) expresses a contingent proposition. ‘Julius’ picks  out the actual inventor (William C. Whitworth) in all worlds, so the proposition is  false in all worlds where someone other than Whitworth invented the zip.  According to Evans, however, this sort of contingency is superficial. (2) is  superficially contingent, in that the claim ‘It might have been the case that someone  other than Julius invented the zip’ is true. Superficial necessity and contingency of a  sentence turns on how it embeds within modal operators: S is superficially necessary  iff ‘It is necessary that S’ is true. But Evans suggests that in a deeper sense, (2) is  necessary. He holds that the sentence is necessary because it expresses a necessary  content. On Evans’ view, there is a semantic rule connecting ‘Julius’ with the  invention of the zip, and this semantic rule makes it the case that the content of (2) is  necessarily true.  Evans’ framework has two modal operators, rather than two intensions. The  framework does have two semantic values: the proposition expressed by an sentence,  which is something like the familiar proposition that is true in all worlds where  Whitworth invented the zip, and the content of the sentence, which behaves as  characterized above. Neither propositions nor contents are characterized as intensions,  but it is easy enough to define intensions in the vicinity. We can say that the  superficial intension of S is the set of worlds in which the proposition expressed by S  is true: roughly, the set of worlds w such that ‘if w had obtained, S would have been  the case’ is true. We can say that the deep intension of S is the set of worlds in which  the content of S is true. In these terms, (2) has a superficial intension that is false at  some worlds, but a deep intension that is true at all worlds.  In the case of descriptive names such as ‘Julius’, deep necessity (as opposed to  superficial necessity) seems closely connected to apriority, and deep intensions are  closely connected to an expression’s cognitive role. It is tempting to extend this  connection beyond the case of descriptive names, but Evans does not discuss other  expressions, and it is not entirely clear how an extension would go. A more precise  analysis of Evans’ notion of deep necessity would require a more precise  understanding of his notion of “content”, which serves as something of an unanalyzed  primitive in his 1978 article.  From other work, it seems clear that Evans thinks in the case of ordinary proper  names (as opposed to descriptive names), there is a semantic rule that ties a name to  its referent, so that the referent is part of the content. Correspondingly, it seems that  Evans held that identities involving ordinary proper names have a content that is  necessary, so that an identity such as ‘Mark Twain is Samuel Clemens’ is not only  superficially necessary but deeply necessary. If this is right, then the two names  involved will have the same deep intension. So in these cases (and probably in  analogous cases involving natural kind terms), deep necessity and deep intensions are  not as strongly connected to cognitive significance or to apriority as in the case of  descriptive names.  2.4  Davies and Humberstone: ‘Fixedly Actually’ and ‘Necessarily’  The two-dimensional framework of Davies and Humberstone (1981) is based on  an analysis of the operator ‘actually’ (A). AP is true in a world w iff P is true in the  actual world. Davies and Humberstone note that ‘P iff AP’ is contingent but knowable  a priori. They suggest that although the sentence is contingent, there is an intuitive  sense in which it is necessary: intuitively, no matter which world turns out to be the  actual world, ‘P iff AP’ will be true. Likewise, for a contingent empirical truth P, AP  will be necessary, but there is an intuitive sense in which it is contingent: intuitively,  there are some worlds such that if those worlds had been actual, then AP would have  been false.  This intuition can be formalized by introducing a “floating” actual world into a  possible-worlds model. Instead of simply designating a fixed world as the actual  world, we take actuality to be a feature that can attach to different worlds. We can  then evaluate sentences in a world w, where a world w’ is taken to be actual  (“considered as actual”). Or equivalently, we can evaluate sentences at pairs of worlds  (w’, w), where the first world represents the world that is designated as actual, and the  second world represents the world in which the sentence is evaluated (relative to the  designation of the first world as actual).2  Doubly-indexed evaluation behaves as follows. A sentence P without modal  operators is true at (w’, w) iff P is true at w according to ordinary singly-indexed  evaluation. P is true at (w’, w) iff P is true at (w’, v) for all v (i.e. iff P is true at all  worlds relative to w’ considered as actual). AP is true at (w’, w) iff P is true at (w’, w)  (i.e. iff P is true at w’ when w’ is considered as actual). In conjunction with the  obvious semantics for truth-functional logical operators, this suffices to recursively  define doubly-indexed evaluation of sentences in modal propositional logic (including  ‘’ and ‘A’) in terms of standard singly-indexed evaluation of atomic sentences.  Davies and Humberstone then introduce the further operator “fixedly” (F), which  can be defined as follows: FP is true at (w’, w) iff P is true at (v, w) for all v (i.e. iff P  is true at w relative to all worlds considered as actual). The “fixedly actually” operator  FA is consequently such that FAP is true at (w’, w) iff AP is true at (v, w) for all v,  i.e., iff P is true at (v, v) for all v. So FAP is true iff P is true at all worlds w when w  itself is considered as actual.  The two crucial modal operators here are  and FA. We can say that P is  necessary when P is true (i.e. when P is true at all worlds when our world is  considered as actual), and that P is FA-necessary when FAP is true (i.e. when P is  true at all worlds w when w is considered as actual). Let us say that P is A-involving  iff P contains an instance of A or of F. It is easy to see that when P is not A- involving, P will be FA-necessary iff it is necessary. But when P is A-involving, the  two may come apart. In particular, the sentence ‘P iff AP’ is not necessary, but it is  FA-necessary. Likewise, for a contingent atomic truth P, AP is necessary, but it is  FA-contingent. So Davies and Humberstone suggest that FA-necessity captures the  intuitive sense in which these two sentences are necessary and contingent  respectively.  Davies and Humberstone also extend the discussion to Evans’ case of descriptive  names. They observe that descriptive names such as ‘Julius’ behave very much like  A-involving descriptions of the form ‘The actual inventor of the zip’. For example,  just as ‘Julius invented the zip’ seems contingent and a priori, ‘The actual inventor   of the zip invented the zip’ seems contingent and a priori. Furthermore, it is easy to  see that when formalized in modal predicate logic, sentences of the latter form are not  necessary but are FA-necessary. This mirrors Evans’ claim that ‘Julius (if he exists)  invented the zip’ is not superficially necessary but is deeply necessary.   Davies and Humberstone suggest the natural hypothesis that descriptive names are   in fact abbreviated A-involving descriptions, and that Evans’ deep necessity is just  FA-necessity.  Davies and Humberstone speculate that all contingent a priori sentences may be  (perhaps tacitly) A-involving sentences that are contingent and FA-necessary.3 They  also suggest that some necessary a posteriori sentences are A-involving sentences that  are necessary and FA-contingent: for example, ‘The actual F is G’ (where ‘the F is G’  is contingent) and analogous claims involving descriptive names. They speculate  tentatively that natural kind terms (such as ‘water’) might be seen as abbreviated A- involving descriptions (such as ‘the actual waterish stuff around here’), in which case  necessary a posteriori identities such as ‘water is H2O’ may also be   necessary and FA-contingent. However, they do not extend the claim to all necessary  a posteriori sentences. In particular, they hold that ordinary proper names are not A- involving, so that identities involving ordinary proper names (such as   ‘John is Tom’) are FA-necessary iff they are necessary. It follows from this that  necessary a posteriori identities involving these names are FA-necessary, rather than  FA-contingent.  Davies and Humberstone do not posit two semantic values to go along with their  two modal operators, but one could naturally do so. We can say that the standard  intension of P is true at w iff P is true at w when our world is considered as actual (i.e.  iff P is true at (a, w), where a is the actual world), and that the FA-intension of P is  true w iff P is true at w when w is considered as actual (i.e. iff P is true at (w, w)). We  can also define the two-dimensional intension of P in the obvious way; then the FA- intension will be equivalent to the “diagonal” of the two-dimensional intension.  As defined here, FA-intensions are closely tied to apriority for some sentences:  especially for A-involving sentences, and for tacitly A-involving sentences such as  those involving descriptive names and perhaps natural kind terms (if these are indeed  tacitly A-involving). If the “actually” operator were the only source of the necessary a  posteriori and the contingent a priori, then there would be a strong general tie between  FA-intensions and apriority. But if there are other sources of the necessary a posteriori  and the contingent a priori (such as ordinary proper names and indexicals), then in  these cases, FA-intensions will not be closely tied to apriority at all.  3  Two-Dimensionalism  The two-dimensional approaches discussed above all introduce “first- dimensional” semantic values or modal notions that are more strongly connected to  apriority and to cognitive significance than are the more familiar “second- dimensional” semantic values and modal notions. But in each of these approaches, the  connection is somewhat attenuated. In the case of Kaplan’s character, the connection  only applies in the case of indexicals. In the case of Evans it is asserted only for  descriptive names. In the case of Davies and Humberstone, it holds only for A- involving expressions and tacitly A-involving expressions such as descriptive names  and perhaps some natural kind terms. In the case of Stalnaker, it applies only under  certain strong restrictions on the domain of a diagonal proposition, or not at all.  In recent years, a number of philosophers (e.g. Chalmers 1996, 2002, 2004 and  have advocated a two-dimensional approach on which first-dimensional semantic  values are connected to apriority and cognitive significance in a much stronger and  more general way. On this approach, the framework applies not just to indexicals and  descriptive names, but to expressions of all sorts. Proponents hold that any expression  (or at least, any expression token of the sort that is a candidate for having an  extension) can be associated with an intension that is strongly tied to the role of the  expression in reasoning and in thought. The term two-dimensionalism is usually used  for views of this sort.  3.1  The core claims of two-dimensionalism  Five core claims of two-dimensionalism are as follows.  (T1) Every expression token (of the sort that is a candidate to have an  extension) is associated with a primary intension, a secondary intension,  and a two-dimensional intension. A primary intension is a function from  scenarios to extensions. A secondary intension is a function from  possible worlds to extensions. A two-dimensional intension is a function  from ordered pairs of scenarios and worlds to extensions.  (T2) When the extension of a complex expression token depends  compositionally on the extensions of its part, the value of each of its  intensions at an index (world, scenario, or ordered pair) depends in the  same way on the values of the corresponding intensions of its parts at  that index.  (T3) The extension of an expression token coincides with the value of its  primary intension at the scenario of utterance and with the value of the  secondary intension at the world of utterance.  (T4) A sentence token S is metaphysically necessary iff the secondary  intension of S is true at all worlds.  (T5) A sentence token S is a priori (epistemically necessary) iff the  primary intension of S is true at all scenarios.  In what follows I will first clarify and motivate these principles, without  precisely defining all of the key notions or making a case for their truth. In later  sections, I will discuss how the relevant notions (especially the notion of a primary  intension) can be defined, in such a way that the principles might be true.  These  principles should not be taken to provide an exhaustive characterization of two- dimensionalism, but they lie at the core of the view.  Start with claim (T1). Here, a scenario is something akin to a possible world, but  it need not be a possible world. In the most common two-dimensionalist treatments, a  scenario is a centered world: an ordered triple of a possible world along with an  individual and a time in that world. Other treatments of scenarios are possible (see  Chalmers 2004), but I will use this understanding here.  An expression’s secondary intension (or what Jackson calls its C-intension) is  just its familiar post-Kripkean intension, picking out the extension of the expression  in counterfactual worlds. For example, the secondary intension of a token of ‘I’ as  used by speaker S picks out S in all worlds. The secondary intension of ‘water’ picks  out H2O in all worlds. The secondary intension of ‘Julius’ picks out William C.  Whitworth in all worlds. And so on.  An expression’s primary intension works quite differently. I will defer a full  characterization, but some examples will give a rough idea. The primary intension of  a token of ‘I’, evaluated at a centered world, picks out the designated individual at the  “center” of that world. (So the primary intension of my use of ‘I’, evaluated at a world  centered on Napoleon, picks out Napoleon, rather than David Chalmers.) The primar", "filename": "David Chalmers - Two Dimensional Semantics.pdf", "meta": {"bla": "huahaua"}}