{"text": "Translated by Myra Bergman Ramos  With an Introduction by Donaldo Macedo  The Continuum International Publishing Group Ltd  The Tower Building, 11 York Road, London SE1 7NX  Copyright © 1970, 1993 by Paulo Freire  Introduction © 2000 by Donaldo Macedo  All rights reserved. No part of this book may be reproduced,  stored in a retrieval system, or transmitted, in any form or  by any means, electronic, mechanical, photocopying, recording,  or otherwise, without the written permission of  The Continuum International Publishing Group Inc.  Printed in the United States of America  Library of Congress Cataloging-in-Publication Data  Freire, Paulo, 1921[Pedagogia del oprimido. English]  Pedagogy of the oppressed / Paulo Freire   translated by Myra  Bergman Ramos   introduction by Donaldo Macedo.—30th anniversary ed.  p. cm.  education—Philosophy. 4. Critical pedagogy. I. Title.  To the oppressed,  and to those who suffer with them  and fight at their side  Contents  Publisher's Foreword 9  Introduction to the Anniversary Edition  Preface ^ 35  Chapter 1 43  The justification for a pedagogy of the oppressed  the contradiction  between the oppressors and the oppressed, and how it is overcome   oppression and the oppressors  oppression and the oppressed   liberation: not a gift, not a self-achievement, but a mutual process.  Chapter 2 71  The \"banking\" concept of education as an instrument of oppression—  its presuppositions—a critique  the problem-posing concept of  education as an instrument for liberation—-its presuppositions  the  \"banking\" concept and the teacher-student contradiction  the  problem-posing concept and the supersedence of the teacherstudent contradiction  education: a mutual process, world-mediated   people as uncompleted beings, conscious of their incompletion, and  their attempt to be more fully human.  Chapter 3 87  Dialogics—the essence of education as the practice of freedom   dialogics and dialogue  dialogue and the search for program  content  the human-world relationship, \"generative themes,\" and  the program content of education as the practice of freedom  the  investigation of \"generative themes\" and its methodology  the  awakening of critical consciousness through the investigation of  \"generative themes\"  the various stages of the investigation.  Chapter 4 125  Antidialogics and dialogics as matrices of opposing theories of  cultural action: the former as an instrument of oppression and the  latter as an instrument of liberation  the theory of antidialogical  action and its characteristics: conquest, divide and rule,  manipulation, and cultural invasion  the theory of dialogical  action and its characteristics: cooperation, unity, organization, and  cultural synthesis.  2  A careful analysis of the teacher-student relationship at any level, inside or outside the school, reveals its fundamen­tally narrative character. This relationship involves a nar­ rating Subject (the teacher) and patient, listening objects (the  students). The contents, whether values or empirical dimensions of  reality, tend in the process of being narrated to become lifeless and  petrified. Education is suffering from narration sickness.  The teacher talks about reality as if it were motionless, static,  compartmentalized, and predictable. Or else he expounds on a topic  completely alien to the existential experience of the students. His  task is to \"fill\" the students with the contents of his narration—  contents which are detached from reality, disconnected from the  totality that engendered them and could give them significance.  Words are emptied of their concreteness and become a hollow, alien­ ated, and alienating verbosity.  The outstanding characteristic of this narrative education, then,  is the sonority of words, not their transforming power. \"Four times  four is sixteen  the capital of Para is Belem.\" The student records,  memorizes, and repeats these phrases without perceiving what four  times four really means, or realizing the true significance of \"capital\"  in the affirmation \"the capital of Para is Belem,\" that is, what Belem  means for Pard and what Para means for Brazil.  Narration (with the teacher as narrator) leads the students to  memorize mechanically the narrated content. Worse yet, it turns  them into \"containers,\" into \"receptacles\" to be \"filled\" by the  teacher. The more completely she fills the receptacles, the better a  teacher she is. The more meekly the receptacles permit themselves  to be filled, the better students they are.  Education thus becomes an act of depositing, in which the students are the depositories and the teacher is the depositor. Instead  of communicating, the teacher issues communiques and makes deposits which the students patiently receive, memorize, and repeat.  This is the \"banking\" concept of education, in which the scope of  action allowed to the students extends only as far as receiving, filing,  and storing the deposits. They do, it is true, have the opportunity  to become collectors or cataloguers of the things they store. But in  the last analysis, it is the people themselves who are filed away  through the lack of creativity, transformation, and knowledge in this  (at best) misguided system. For apart from inquiry, apart from the  praxis, individuals cannot be truly human. Knowledge emerges only  through invention and re-invention, through the restless, impatient,  continuing, hopeful inquiry human beings pursue in the world, with  the world, and with each other.  In the banking concept of education, knowledge is a gift bestowed  by those who consider themselves knowledgeable upon those whom  they consider to know nothing. Projecting an absolute ignorance  onto others, a characteristic of the ideology)of oppression, negates  education and knowledge as processes of inquiry. The teacher presents himself to his students as their necessary opposite  by considering their ignorance absolute, he- justifies his own existence. The  students, alienated like the slave in the Hegelian dialectic, accept  their ignorance as justifying the teachers existence—but, unlike the  slave, they never discover that they educate the teacher.  The raison d'etre of libertarian education, on the other hand, lies  in its drive towards reconciliation. Education must begin with the  solution of the teacher-student contradiction, by reconciling the  poles of the contradiction so that both are simultaneously teachers  and students.  This solution is not (nor can it be) found in the banking concept.  On the contrary, banking education maintains and even stimulates  the contradiction through the following attitudes and practices,  which mirrOr oppressive society as a whole:  (a) the teacher teaches and the students are taught   (b) the teacher knows everything and the students know nothing   (c) the teacher thinks and the students are thought about   (d) the teacher talks and the students listen—meekly   (e) the teacher disciplines and the students are disciplined   (f) the teacher chooses and enforces his choice, and the students  comply   (g) the teacher acts and the students have the illusion of acting  through the action of the teacher   (h) the teacher chooses the program content, and the students  (who were not consulted) adapt to it   (i) the teacher confuses the authority of knowledge with his or  her own professional authority, which she and he sets in oppo­ sition to the freedom of the students   (j) the teacher is the Subject of the learning process, while the  pupils are mere objects.  It is not surprising that the banking concept of education regards  men as adaptable, manageable beings. The more students work at  storing the deposits entrusted to them, the less they develop the  critical consciousness which would result from their intervention in  the world as transformers of that world. The more completely they  accept the passive role imposed on them, the more they tend simply  to adapt to the world as it is and to the fragmented view of reality  deposited in them.  The capability of banking education to minimize or annul the  students creative power and to stimulate their credulity serves the  interests of the oppressors, who care neither to have the world re­ vealed nor to see it transformed. The oppressors use their \"humanitarianism\" to preserve a profitable situation. Thus they react almost  instinctively against any experiment in education which stimulates  the critical faculties and is not content with a partial view of reality  but always seeks out the ties which link one point to another and  one problem to another.  Indeed, the interests of the oppressors lie in \"changing the consciousness of the oppressed, not the situation which oppresses  them\" 1 for the more the oppressed can be led to adapt to that  situation, the more easily they can be dominated. To achieve this  end, the oppressors use the banking concept of education in conjunction with a paternalistic social action apparatus, within which  the oppressed receive the euphemistic title of \"welfare recipients.\"  They are treated as individual cases, as marginal persons who deviate from the general configuration of a \"good, organized, and just\"  society. The oppressed are regarded as the pathology of the healthy  society, which must therefore adjust these \"incompetent and lazy\"  folk to its own patterns by changing their mentality. These marginals  need to be \"integrated,\" \"incorporated\" into the healthy society that  they have \"forsaken.\"  The truth is, however, that the oppressed are not \"marginals,\" are  not people living \"outside\" society. They have always been  \"inside\"—inside the structure which made them \"beings for others.\"  The solution is not to \"integrate\" them into the structure of oppression, but to transform that structure so that they can become \"beings  for themselves.\" Such transformation, of course, would undermine  the oppressors purposes  hence their utilization of the banking concept of education to avoid the threat of student cpnscientizagdo.  The banking approach to adult education, for example, will never  propose to students that they critically consider reality. It will deal  instead with such vital questions as whether Roger gave green grass  to the goat, and insist upon the importance of learning that, on the  contrary, floger gave green grass to the rabbit. The \"humanism\" of  the banking approach masks the effort to turn women and men into  automatons—the very negation of their ontological vocation to be  more fully human.  Those who use the banking approach, knowingly or unknowingly  (for there are innumerable well-intentioned bank-clerk teachers who  do not realize that they are serving only to dehumanize), fail to  perceive that the deposits themselves contain contradictions about  reality. But, sooner or later, these contradictions may lead formerly  passive students to turn against their domestication and the attempt  to domesticate reality. They may discover through existential experi­ ence that their present way of life is irreconcilable with their voca­ tion to become fully human. They may perceive through their  relations with reality that reality is really a process, undergoing  constant transformation. If men and women are searchers and their  ontological vocation is humanization, sooner or later they may per­ ceive the contradiction in which banking education seeks to main­ tain them, and then engage themselves in the struggle for their  liberation.  But the humanist, revolutionary educator cannot wait for this pos­ sibility to materialize. From the outset, her efforts must coincide  with those of the students to engage in critical thinking and the  quest for mutual humanization. His efforts must be imbued with a  profqund trust in people and their creative power. To achieve this,  they must be partners of the students in their relations with them.  The banking concept does not admit to such partnership—and  necessarily so. To resolve the teacher-student contradiction, to ex­ change the role of depositor, prescriber, domesticator, for the role  of student among students would be to undermine the power of  oppression and serve the cause of liberation.  Implicit in the banking concept is Uie assumption of a dichotomy  between human beings and the world: a person is merely in the  world, not with the world or with others  the individual is spectator,  not re-creator. In this view, the person is not a conscious being  (corpo consciente)  he or she is rather the possessor of a conscious­ ness: an empty \"mind\" passively open to the reception of deposits  of reality from the world outside. For example, my desk, my books,  my coffee cup, all the objects before me—as bits of the world which  surround me—would be \"inside\" me, exactly as I am inside my  study right now. This view makes no distinction between being accessible to consciousness and entering consciousness. The distinction, however, is essential: the objects which surround me are simply  accessible to my consciousness, not located within it. I am aware of  them, but they are not inside me.  It follows logically from the banking notion of consciousness that  the educator s role is to regulate the way the world \"enters into\" the  students. The teachers task is to organise a process which already  occurs spontaneously, to \"fill\" the students by making deposits of  information which he or she considers to constitute true knowledge.2  And since people \"receive\" the world as passive entities, education  should make them more passive still, and adapt them to the world.  The educated individual is the adapted person, because she or he  is better \"fit\" for the world. Translated into practice, this concept is  well suited to the purposes of the oppressors, whose tranquility rests  on how well people fit the world the oppressors have created, and  how little they question it.  The more completely the majority adapt to the purposes which  the dominant minority prescribe for them (thereby depriving them  of the right to their own purposes), the more easily the minority can  continue to prescribe. The theory and practice of banking education  serve this end quite efficiently. Verbalistic lessons, reading requirements,3 the methods for evaluating \"knowledge,\" the distance between the teacher and the taught, the criteria, for promotion:  everything in this ready-to-wear approach serves to obviate  thinking.  The bank-clerk educator does not realize that there is no true  security in his hypertrophied role, that one must seek to live with  others in solidarity. One cannot impose oneself, nor even merely  2. This concept corresponds to what Sartre calls the \"digestive\" or \"nutritive\"  concept of education, in which knowledge is \"fed\" by the teacher to the students  to \"fill them out.\" See Jean-Paul Sartre, \"Une idee fundamentale de la phenomenologie de Husserl: L'intentionalite,\" Situations I (Paris, 1947).  3. For example, some professors specify in their reading lists that a book should  be read from pages 10 to 15—and do this to \"help\" their students!  co-exist with one's students. Solidarity requires true communica­ tion, and the concept by which such an educator is guided fears and  proscribes< communication.  Yet only through communication can human life hold meaning.  The teachers thinking is authenticated only by the authenticity of  the students thinking. The teacher cannot think for her students,  nor can she impose her thought on them. Authentic thinking, think­ ing that is concerned about reality, does not take place in ivory  tower isolation, but only in communication. If it is true that thought  has meaning only when generated by action upon the world, the  subordination of students to teachers becomes impossible.  Because banking education begins with a false understanding of  men and women as objects, it cannot promote the development  of what Fromm calls \"biophily,\" but instead produces its opposite:  \"necrophily.\"  While life is characterized by growth in a structured, functional  manner, the necrophilous person loves all that does not grow, all  that is mechanical. The necrophilous person is driven by the  desire to transform the organic into the inorganic, to approach  life mechanically, as if all living persons were things. . . . Mem­ ory, rather than experience  having, rather than being, is what  counts. The necrophilous person can relate to an object—a  flower or a person—only if he possesses it  hence a threat to his  possession is a threat to himself  if he loses possession he loses  contact with the world. . . . He loves control, and in the act of  controlling he kills life.4  Oppression—overwhelming control—is necrophilic  it is nour­ ished by love of death, not life. The banking concept of education,  which serves the interests of oppression, is also necrophilic. Based  on a mechanistic, static, naturalistic, spatialized view of conscious­ ness, it transforms students into receiving objects. It attempts to  control thinking and action, leads women and men to adjust to the  world, and inhibits their creative power.  When their efforts to act responsibly are frustrated, when they  find themselves unable to use their faculties, people suffer. \"This  suffering due to impotence is rooted in the very fact that the human  equilibrium has been disturbed/'5 But the inability to act which  causes people's anguish also causes them to reject their impotence,  by attempting  . . . to restore [their] capacity to act. But can [they], and how?  One way is to submit to and identify with a person or group  having power. By this symbolic participation in another persons  life, [men have] the illusion of acting, when in reality [they] only  submit to and become a part of those who act.6  Populist manifestations perhaps best exemplify this type of behav­ ior by the oppressed, who, by identifying with charismatic leaders,  come to feel that they themselves are active and effective. The rebel­ lion they express as they emerge in the historical process is moti­ vated by that desire to act effectively. The dominant elites consider  the remedy to be more domination and repression, carried out in  the name of freedom, order, and social peace (that is, the peace of  the elites). Thus they can condemn-—logically, from their point of  view—\"the violence of a strike by workers and [can] call upon the  state in the same breath to use violence in putting down the strike.\"7  Education as the exercise of domination stimulates the credulity  of students, with the ideological intent (often not perceived by edu­ cators) of indoctrinating them to adapt to the world of oppression.  This accusation is not made in the naive hope that the dominant  elites will thereby simply abandon the practice. Its objective is to  call the attention of true humanists to the fact that they cannot use  banking educational methods in the pursuit of liberation, for they  would only negate that very pursuit. Nor may a revolutionary society  inherit these methods from an oppressor society. The revolutionary  society which practices banking education is either misguided or  mistrusting of people. In either event, it is threatened by the specter  of reaction.  Unfortunately, those who espouse the cause of liberation are  themselves surrounded and influenced by the climate which gener­ ates the banking concept, and often do not perceive its true signifi­ cance or its dehumanizing power. Paradoxically, then, they utilize  this same instrument of alienation in what they consider an effort  to liberate. Indeed, some \"revolutionaries\" brand as \"innocents,\"  \"dreamers,\" or even \"reactionaries\" those who would challenge this  educational practice. But one does not liberate people by alienating  them. Authentic liberation—the process of humanization—is not  another deposit to be made in men. Liberation is a praxis: the action  and reflection of men and women upon their world in order to  transform it. Those truly committed to the cause of liberation can  accept neither the mechanistic concept of consciousness as an empty  vessel to be filled, nor the use of banking methods of domination  (propaganda, slogans—deposits) in the name of liberation.  Those truly committed to liberation must reject the banking con­ cept in its entirety, adopting instead a concept of women and men  as conscious beings, and consciousness as consciousness intent upon  the world. They must abandon the educational goal of deposit-mak­ ing and replace it with the posing of the problems of human beings  in their relations with the world. \"Problem-posing\" education, re­ sponding to the essence of consciousness—intentionality—rejects  communiques and embodies communication. It epitomizes the spe­ cial characteristic of consciousness: being conscious of, not only as  intent on objects but as turned in upon itself in a Jasperian  \"split\"—consciousness as consciousness of consciousness.  Liberating education consists in acts of cognition, not transferrals  of information. It is a learning situation in which the cognizable  object (far from being the end of the cognitive act) intermediates  the cognitive actors—teacher on the one hand and students on the  other. Accordingly, the practice of problem-posing education entails  at the outset that the teacher-student contradiction to be resolved.  Dialogical relations—indispensable to the capacity of cognitive  actors to cooperate in perceiving the same cognizable object—are  otherwise impossible.  Indeed, problem-posing education, which breaks with the vertical  patterns characteristic of banking education, can fulfill its function  as the practice of freedom only if it can overcome the above contradiction. Through dialogue, the teacher-of-the-students and the students-of-the-teacher cease to exist and a new term emerges: teacherstudent with students-teachers. The te&her is no longer merely  the-one-who-teaches, but one who is himself taught in dialogue with  the students, who in turn while being taught also teach. They become jointly responsible for a process in which all grow. In this  process, arguments based on \"authority\" are no longer valid  in order  to function, authority must be on the side of freedom, not against  it. Here, no one teaches another, nor is anyone self-taught. People  teach each other, mediated by the world, by the cognizable objects  which in banking education are \"owned\" by the teacher.  The banking concept (with its tendency to dichotomize everything) distinguishes two stages in the action of the educator. During  the first, he cognizes a cognizable object while he prepares his lessons in his study or his laboratory  during the second, he expounds  to his students about that object. The students are not called upon  to know, but to memorize the contents narrated by the teacher. Nor  do the students practice any act of cognition, since the object towards which that act should be directed is the property of the  teacher rather than a medium evoking the critical reflection of both  teacher and students. Hence in the name of the \"preservation of  culture and knowledge\" we have a system which achieves neither  true knowledge nor true culture.  The problem-posing method does not dichotomize the activity of  the teacher-student: she is not \"cognitive\" at one point and \"narrative\" at another. She is always \"cognitive,\" whether preparing a project or engaging in dialogue with the students. He does not regard  cognizable objects as his private property, but as the object of reflection by himself and the students. In this way, the problem-posing  educator constantly re-forms his reflections in the reflection of the  students. The students—no longer docile listeners—are now critical  co-investigators in dialogue with the teacher. The teacher presents  the material to the students for their consideration, and re-considers  her earlier considerations as the students express their own. The  role of the problem-posing educator is to create  together with the  students, the conditions under which knowledge at the level of the  doxa is superseded by true knowledge, at the level of the logos,  Whereas banking education anesthetizes and inhibits creative  power, problem-posing education involves a constant unveiling of  reality. The former attempts to maintain the submersion of consciousness  the latter strives for the emergence of consciousness and  critical intervention in reality.  Students, as they are increasingly posed with problems relating  to themselves in the world and with the world, will feel increasingly  challenged and obliged to respond to that challenge. Because they  apprehend the challenge as interrelated to other problems within a  total context, not as a theoretical question, the resulting comprehension tends to be increasingly critical and thus constantly less alienated. Their response to the challenge evokes new challenges,  followed by new understandings  and gradually the students come  to regard themselves as committed.  Education as the practice of freedom—as opposed to education  as the practice of domination—denies that man is abstract, isolated,  independent, and unattached to the world  it also denies that the  world exists as a reality apart from people. Authentic reflection considers neither abstract man nor the world without people, but people in their relations with the world. In these relations consciousness  and world are simultaneous: consciousness neither precedes the  world nor follows it.  La conscience et le monde sont donnes d'un meme coup: exterieur par essence a la conscience, le monde est, par essence relatif a elle.8  In one of our culture circles in Chile, the group was discussing  (based on a codification9) the anthropological concept of culture. In  the midst of the discussion, a peasant who by banking standards was  completely ignorant said: \"Now I see that without man there is no  world.\" When the educator responded: \"Let's say, for the sake of  argument, that all the men on earth were to die, but that the earth  itself remained, together with trees, birds, animals, rivers, seas, the  stars . . , wouldn't all this be a world?\" \"Oh no,\" the peasant replied  emphatically. \"There would be no one to say: This is a world'.\"  The peasant wished to express the idea that there would be lacking the consciousness of the world which necessarily implies the  world of consciousness. 7 cannot exist without a non-I. In turn, the  not-I depends on that existence. The world which brings consciousness into existence becomes the world of that consciousness. Hence,  the previously cited affirmation of Sartre: \"La conscience et le monde  sont donnes dun meme coup.\"  As women and men, simultaneously reflecting on themselves and  on the world, increase the scope of their perception, they begin to  direct their observations towards previously inconspicuous phenomena:  In perception properly so-called, as an explicit awareness  [Gewahren], I am turned towards the object, to &e paper, for  instance. I apprehend it as being this here and now  The apprehension is a singling out, every object having a background in  experience. Around and about the paper lie books, pencils, inkwell, and so forth, and these in a certain sense are also \"perceived\", perceptually there, in the \"field of intuition\"  but whilst  I was turned towards the paper there was no turning in their  direction, nor any apprehending of them, not even in a secondary sense. They appeared and yet were not singled out, were  not posited on their own account. Every perception of a thing  has such a zone of background intuitions or background awareness, if \"intuiting\" already includes the state of being turned  towards, and this also is a \"conscious experience\", or more briefly  9. See chapter 3.—Translator's note.  a \"consciousness of* all indeed that in point of fact lies in the  co-perceived objective background.10  That which had existed objectively but had not been perceived in  its deeper implications (if indeed it was perceived at all) begins to  \"stand out,\" assuming the character of a problem and therefore of  challenge. Thus, men and women begin to single out elements from  their \"background awareness\" and to reflect upon them. These ele­ ments are now objects of their consideration, and, as such, objects  of their action and cognition.  In problem-posing education, people develop their power to per­ ceive critically the way they exist in the world with which and in  which they find themselves  they come to see the world not as a  static reality, but as a reality in process, in transformation. Although  the dialectical relations of women and men with the world exist  independently of how these relations are perceived (or whether or  not they are perceived at all), it is also true that the form of action  they adopt is to a large extent a function of how they perceive them­ selves in the world. Hence, the teacher-student and the studentsteachers reflect simultaneously on themselves and the world without  dichotomizing this reflection from action, and thus establish an au­ thentic form of thought and action.  Once again, the two educational concepts and practices under  analysis come into conflict. Banking education (for obvious reasons)  attempts, by mythicizing reality, to conceal certain facts which ex­ plain the way human beings exist in the world  problem-posing edu­ cation sets itself the task of demythologizing. Banking education  resists dialogue  problem-posing education regards dialogue as in­ dispensable to the act of cognition which unveils reality. Banking  education treats students as objects of assistance  problem-posing  education makes them critical thinkers. Banking education inhibits  creativity and domesticates (although it cannot completely destroy)  the intentionality of consciousness by isolating consciousness from  the world, thereby denying people their ontological and historical  vocation of becoming more fully human. Problem-posing education  bases itself on creativity and stimulates true reflection and action  upon reality, thereby responding to the vocation of persons as beings  who are authentic only when engaged in inquiry and creative transformation. In sum: banking theory and practice, as immobilizing  and fixating forces, fail to acknowledge men and women as historical  beings  problem-posing theory and practice take the peoples historicity as their starting point.  Problem-posing education affirms men and women as beings in  the process of becoming—as unfinished, uncompleted beings in and  with a likewise unfinished reality. Indeed, in contrast to other animals who are unfinished, but not historical, people know themselves  to be unfinished  they are aware of their incompletion. In this incompletion and this awareness lie the very roots of education as an  exclusively human manifestation. The unfinished character of human beings and the transformational character of reality necessitate  that education be an ongoing activity.  Education is thus constantly remade in the praxis. In order to be,  it must become. Its \"duration\" (in the Bergsonian meaning of the  word) is found in the interplay of the opposites permanence and  change. The banking method emphasizes permanence and becomes  reactionary  problem-posing education—which accepts neither a  \"well-behaved\" present nor a predetermined future—roots itself in  the dynamic present and becomes revolutionary.  Problem-posing education is revolutionary futurity. Hence it is  prophetic (and, as such, hopeful). Hence, it corresponds to the historical nature of humankind. Hence, it affirms women and men as  beings who transcend themselves, who move forward and look  ahead, for whom immobility represents a fatal threat, for whom  looking at the past must only be a means of understanding more  clearly what and who they are so that they can more wisely build  the future. Hence, it identifies with the movement which engages  people as beings aware of their incompletion—an historical movement which has its point of departure, its Subjects and its objective.  The point of departure of the movement lies in the people them­ selves. But since people do not exist apart from the world, apart  from reality, the movement must begin with the human-world rela­ tionship. Accordingly, the point of departure must always be with  men and women in the \"here and now,\" which constitutes the situ­ ation within which they are submerged, from which they emerge,  and in which they intervene. Only by starting from this situation—  which determines their perception of it—can they begin to move.  To do this authentically they must perceive their state not as fated  and unalterable, but merely as limiting—and therefore challenging.  Whereas the banking method directly or indirectly reinforces  men's fatalistic perception of their situation, the problem-posing  method presents this very situation to them as a problem. As the  situation becomes the object of their cognition, the naive or magical  perception which produced their fatalism gives way to perception  which is able to perceive itself even as it perceives reality, and can  thus be critically objective about that reality.  A deepened consciousness of their situation leads people to ap­ prehend that situation as an historical reality susceptible of transfor­ mation. Resignation gives way to the drive for transformation and  inquiry, over which men feel themselves to be in control. If people,  as historical beings necessarily engaged with other people in a move­ ment of inquiry, did not control that movement, it would be (and  is) a violation of their humanity. Any situation in which some indi­ viduals prevent others from engaging in the process of inquiry is  one of violence. The means used are not important  to alienate  human beings from their own decision-making is to change them  into objects.  This movement of inquiry must be directed towards humanization—the people's historical vocation. The pursuit of full humanity,  however, cannot be carried out in isolation or individualism, but  only in fellowship and solidarity  therefore it cannot unfold in the  antagonistic relations between oppressors and oppressed. No one  can be authentically human while he prevents others from being so.  Attempting to be more human, individualistically, leads to having  more, egotistically, a form of dehumanization. Not that it is not  fundamental to have in order to be Human. Precisely because it is  necessary, some men's having must not be allowed to constitute an  obstacle to others having, must not consolidate the power of the  former to crush the latter.  Problem-posing education, as a humanist and liberating praxis,  posits as fundamental that the people subjected to domination must  fight for their emancipation. To that end, it enables teachers and  students to become Subjects of the educational process by overcoming authoritarianism and an alienating intellectualism  it also enables  people to overcome their false perception of reality. The world—no  longer something to be described with deceptive words—becomes  the object of that transforming action by men and women which  results in their humanization.  Problem-posing education does not and cannot serve the interests  of the oppressor. No oppressive order could permit the oppressed  to begin to question: Why? While only a revolutionary society can  carry out this education in systematic terms, the revolutionary leaders need not take full power before they can employ the method. In  the revolutionary process, the leaders cannot utilize the banking  method as an interim measure, justified on grounds of expediency,  with the intention of later behaving in a genuinely revolutionary  fashion. They must be revolutionary—that is to say, dialogical—from  the outset.", "filename": "Freire - Pedagogy of The Oppresed.pdf", "meta": {"bla": "huahaua"}}