{"text": "H. P. Grice  Logic and Conversation  Readers are reminded that copyright subsists in this extract and the work from which it was taken.  Except as provided for by the terms of a rightsholder's license or copyright law, no further copying,  storage or distribution is permitted without the consent of the copyright holder. The author (or authors)  of the Literary Work or Works contained within the Licensed Material is or are the author(s) and may  have moral rights in the work. The Licensee shall not cause of permit the distortion, mutilation or other  modification of, or other derogatory treatment of, the work which would be prejudicial to the honour of  the author.  Reprinted from Syntax and semantics 3: Speech arts, Cole et al. \"Logic and conversation\", pp. 41-58,  (1975), with permission from Elsevier.  This is a digital version of copyright material made under licence from the rightsholder, and its  accuracy cannot be guaranteed. Please refer to the original published edition.  Licensed for use at University College London for the Pragmatic Theory Online Course  Permission granted January 2004  •  I  I  l  H. P. GRICE  University of California, Berkeley  It is a commonplace of philosophical logic that there are, or appear  to be, divergences in meaning between, on the one hand, at least  some of what I shall call the FORMAL devices-~, 1\\, V, ::J, (x), 3 (x), f x  (when these are given a standard two-valued interpretation)-and,  on the other, what are taken to be their analogs or counterparts in  natural language-such expressions as not, and, or, if, all, some (or at  least one), the. Some logicians may at some time have wanted to  claim that there are in fact no such divergences  but such claims, if  made at all, have been somewhat rashly made, and those suspected  of making them have been subjected to some pretty rough handling.  Those who concede that such divergences exist adhere, in the  main, to one or the other of two rival groups, which for the purposes  of this article I shall call the formalist and the informalist groups. An  outline of a not uncharacteristic formalist position may be given as  follows: Insofar as logicians are concerned with the formulation of  very general patterns of valid inference, the formal devices possess a  decisive advantage over their natural counterparts. For it will be possible to construct in terms of the formal devices a system of very general formulas, a considerable number of which can be regarded as, or  are closely related to, patterns of inferences the expression of which  involves some or all of the devices: Such a system may consist of a  0 Used by permission of the author and publisher from H. Paul Grice's William  James Lectures, delivered at Harvard University in 1967, and to be published by  Harvard University Press. Copyright 1975 by II. Paul Grice.  41  - certain set of simple formulas that must be acceptable if the devices  have the meaning that has been assigned to them, and an indefinite  number of further formulas, many of them less obviously acceptable,  each of which can be shown to be acceptable if the members of the  original set are acceptable. We have, thus, a way of handling dubiously acceptable patterns of inference, and if, as is sometimes possible, we can apply a decision procedure, we have an even better  way. Furthermore, from a philosophical point of view, the possession  by the natural counterparts of those elements in their meaning,  which they do not share with the corresponding formal devices, is to  be regarded as an imperfection of natural languages  the elements in  question are undesirable excrescences. For the presence of these  elements has the result that the concepts within which they appear  cannot be precisely/clearly defined, and that at least some statements  involving them cannot, in some circumstances, be assigned a definite  truth value  and the indefiniteness of these concepts is not only objectionable in itself but leaves open the way to metaphysics-we  cannot be certain that none of these natural language expressions is  metaphysically 'loaded'. For these reasons, the expressions, as used  in natural speech, cannot be regarded as finally acceptable, and may  tum out to be, finally, not fully intelligible. The proper course is to  conceive and begin to construct an ideal language, incorporating the  formal devices, the sentences of which will be clear, determinate in  truth value, and certifiably free from metaphysical implications  the  foundations of science will now be philosophically secure, since the  statements of the scientist will be expressible (though not necessarily actually expressed) within this ideal language. (I do not wish to  suggest that all formalists would accept the whole of this outline, but  I think that all would accept at least some part of it.)  To this, an informalist might reply in the following vein. The philosophical demand for an ideal language rests· on certain assumptions  that should not be conceded  these are, that the primary yardstick by  which to judge the adequacy of a language is its ability to serve the  needs of science, that an expression cannot be guaranteed as fully intelligible unless an explication or analysis of its meaning has been  provided, and that every explication or analysis must take the form of  a precise definition that is the expression/assertion of a logical equivalence. Language serves many important purposes besides those of  scientific inquiry  we can know perfectly well what an expression  means (and so a fortiori that it is intelligible) without knowing its  analysis, and the provision of an analysis may (and usually does) consist in the specification, as generalized as possible, of the conditions  Logic and Conversation 43  that count for or against the applicability or the expression being  analyzed. Moreover, while it is no doubt true that the t\"ormal devices  are especially amenable to systematic treatment by the logician, it  remains the case that there are very many inferences and arguments,  expressed in natural language and not in terms of thes~ devices, that  are nevertheless recognizably valid. So there must be a place for an  unsimplified, and so more or less unsystematic, logic of the natural  counterparts of these devices  this logic may be aided and guided by  the simplified logic of the formal devices but cannot he Sllpplanted  by it  indeed, not only do the two logics difFer, hut somel111J<'S they  come into conflict  rules that hold for a formal device ma) 1 <>t hold  for its natural counterpart.  Now, on the general question of the place in philosophy of the reformation of natural language, I shall, in this article, have nothing to  say. I shall confine myself to the dispute in its relatio11 to the alleged  divergences mentioned at the outset. I have, moreover, no intention  of entering the fray on behalf of either contestant. I ,, ish, rather, to  maintain that the common assumption of the conte·.tants that the  divergences do in fact exist is (broadly speaking) a common mistake,  and that the mistake arises from an inadequate attention to the nature  and importance of the conditions governing conversation. I shall,  therefore, proceed at once to inquire into the general r:onditions that,  in one way or another, apply to conversation as such, irrespective of  its subject matter.  Suppose that A and B arc talking about a mutual friend, C, who is  now working in a bank. A asks B how C is getting on in his job, and  B replies, Oh quite well, I think  he likes his colleagues, and he  hasn't been to prison yet. At this point, A might well inquire what B  was implying, what he was suggesting, or even what he meant by  saying that C had not yet been to prison. The answer mi ~~ht be any  one of such things aS that C is the sort of person likely to ) ield to the  temptation provided by his occupation, that C' s colleague' are really  very unpleasant and treacherous people, and so forth. It might, of  course, be quite unnecessary for A to make such an inquiry of B, the  answer to it being, in the context, clear in advance. I think it is clear  that whatever B implied, suggested, meant, etc., in this example, is  distinct from what B said, which was simply that C had not been to  prison yet. I wish to introduce, as terms of art, the verl implicate and  •  the related nouns implicature (cf. implying) and implicatum (cf.  what is implied). The point of this maneuver is to avoid having, on  each occasion, to choose between this or that member of the family  of verbs for which implicate is to do general duty. I shall, for the  time being at least, have to assume to a considerable extent an intuitive understanding of the meaning of say in such contexts, and an  ability to recognize particular verbs as members of the family with  which implicate is associated. I can, however, make one or two  remarks that may help to clarify the more problematic of these assumptions, namely, that connected with the meaning of the word  sa[/.  In the sense in which I am using the word say, I intend what  someone has said to be closely related to the conventional meaning  of the words (the sentence) he has uttered. Suppose someone to have  uttered the sentence He is in the grip of a vice. Given a knowledge  of the English language, but no knowledge of the circumstances of  the utterance, one would know something about what the speaker  had said, on the assumption that he was speaking standard English,  and speaking literally. One would know that he had said, about some  particular male person or animal x, that at the time of the utterance  (whatever that was), either (1) x was unable to rid himself of a certain  kind of bad character trait or (2) some part of x' s person was caught in  a certain kind of tool or instrument (approximate account, of course).  But for a full identification of what the speaker had said, one would  need to know (a) the identity of x, (b) the time of utterance, and (c)  the meaning, on the particular occasion of utterance, of the phrase in  the grip of a vice [a decision between (1) and (2)]. This brief indication of my use of say leaves it open whether a man who says (today)  Harold Wilson is a great man and another who says (also today) The  British Prime Minister is a great man would, if each knew that the  two singular terms had the same reference, have said the same thing.  But whatever decision is made about this· question, the apparatus  that I am about to provide will be capable of accounting for any  implicatures that might depend on the presence of one rather than  another of these singular terms in the sentence uttered. Such implicatures would merely be related to different maxims.  In some cases the conventional meaning of the words used will determine what is implicated, besides helping to determine what is  said. If I say (smugly), He is an Englishman  he is, therefore, brave, I  have certainly committed myself, by virtue of the meaning of my  words, to its being the case that his being brave is a consequence of  (follows from) his being an Englishman. But while I have said that  l Logic and Conversation 45  he is an Englishman, and said that he is brave, I do not want to say  that I have SAID (in the favored sense) that it follows from his being  an Englishman that he is brave, though I have certainly indicated,  and so implicated, that this is so. I do not want to say that my utterance of this sentence would be, STIUCTL Y SPEAKING, false should the  consequence in question fail to hold. So SOME implicatures are conventional, unlike the one with which I introduced this discussion of  implicature.  I wish to represent a certain subclass of no11conventional implicaturcs, which I shall call CONVJ<:IISATIONAL implicaturcs, as being essentially connected with certain ge11cral features of discourse  so my  next step is to try to say what these features are.  The following may provide a first approximation to a general principle. Our talk exchanges do not normally consist of a succession of  disconnected remarks, and would not be rational if they did. They  are characteristically, to some degree at least, cooperative efforts  and  each participant recognizes in them, to some extent, a common purpose or set of purposes, or at least a mutually accepted direction.  This purpose or direction may be fixed from the start (e.g., by an initial proposal of a question for discussion), or it may evolve during the  exchange  it may be fairly definite, or it may be so indefinite as to  leave very considerable latitude to the participants (as in a casual  conversation). But at each stage, SOME possible conversational moves  would be excluded as conversationally unsuitable. We might then  formulate a rough general principle which participants will be expected (ceteris paribus) to observe, namely: Make your conversational contribution such as is required, at the stage at which it  occurs, by the accepted purpose or direction of the talk exchange in  which you are engaged. One might label this the COOPEHATIVE  PIUNCIPLE.  On the assumption that some such general principle as this is  acceptable, one may perhaps distinguish four categories under one  or another of which will fall certain more specific maxims and submaxims, the following of which will, in general, yield results in accordance with the Cooperative Principle. Echoing Kant, I call these  categories Quantity, Quillity, Relation, and Manner. The category of  QUANTITY relates to the quantity of information to be provided, and  under it fall the following maxims:  1. Make your contribution as informative as is required (for the  current purposes of the exchange).  2. Do not make your contribution more informative than is  required.  •  (The second maxim is disputable  it might be said that to be overinfoimative is not a transgression of the CP but merely a waste of time.  However, it might be answered that such overinformativeness may  be confusing in that it is liable to raise side issues  and there may  also be an indirect effect, in that the hearers may be misled as a  result of thinking that there is some particular POINT in the provision  of the excess of information. However this may be, there is perhaps a  different reason for doubt about the admission of this second maxim,  namely, that its effect will be secured by a later maxim, which concems relevance.)  Under the category of QUALITY falls a supennaxim- 'Try to make  your contribution one that is true' -and two more specific maxims:  1. Do not say what you believe to be false.  2. Do not say that for which you lack adequate evidence.  Under the category of RELATION I place a single maxim, namely,  'Be relevant.' Though the maxim itself is terse, its formulation conceals a number of problems that exercise me a good deal: questions  about what different kinds and focuses of relevance there may be,  how these shift in the course of a talk exchange, how to allow for the  fact that subjects of conversation are legitimately changed, and so on.  I find the treatment of such questions exceedingly difficult, and I  hope to revert to them in a later work.  Finally, under the category of MANNER, which I understand as  relating not (like the previous categories) to what is said but, rather,  to HOW what is said is to be said, I include the supermaxim- 'Be  perspicuous' -and various maxims such as:  1. Avoid obscurity of expression.  2. Avoid ambiguity.  3. Be brief (avoid unnecessary prolixity).  4. Be orderly.  And one might need others.  It is obvious that the observance of some of these maxims is a  matter of less urgency than is the observance of others  a man who  has expressed himself with undue prolixity would, in general, be  open to milder comment than would a man who has said something  he believes to be false. Indeed, it might be felt that the importance  of at least the first maxim of Quality is such that it should not be  included in a scheme of the kind I am constructing  other maxims  come into operation only on the assumption that this maxim of Quality is satisfied. While this may be correct, so far as the generation of  '  I  Logic and Conversation 47  implicatures is concerned it seems to play a role not totally different  from the other maxims, and it will be convenient, for the present at  least, to treat it as a member of the list of maxims.  There are, of course, all sorts of other maxims (aesthetic, social, or  moral in character), such as 'Be polite', that are also nom1ally observed by participants in talk exchanges, and these may also generate  nonconventional implicatures. The conversational maxims, however,  and the conversational implicatures connected with them, are specially connected (I hope) with the particular purposes that talk (and  so, talk exchange) is adapted lo serve and is prilllarily employed to  serve. I have stated my maxims as if this purpose were a maximally  effective exchange of information  this specification is, of course, too  narrow, and the scheme needs to be generalized to allow for such  general purposes as influencing or directing the actions of others.  As one of my avowed aims is to see talking as a special case or variety of purposive, indeed rational, behavior, it may be worth noting  that the specific expectations or presumptions connected with at  least some of the foregoing maxims have their analogues in the  sphere of transactions that are not talk exchanges. I list briefly one  such analog for each conversational category.  1. Quantity. If you are assisting me to mend a car, I expect your  contribution to be neither more nor less than is required  if, for example, at a particular stage I need four screws, I expect you to hand  me four, rather than two or six.  2. Quality. I expect your contributions to be genuine and not  spurious. If I need sugar as an ingredient in the cake you are assisting me to make, I do not expect you to hand me salt  if I need a  spoon, I do not expect a trick spoon made of rubber.  3. Relation. I expect a partner's contribution to be appropriate to  immediate needs at each stage of the transaction  if I am mixing  ingredients for a cake, I do not expect to be handed a good book, or  even an oven cloth (though this might be an appropriate contribution  at a later stage).  4. Manner. I expect a partner to make it clear what contribution  he is making, and to execute his performance with reasonable dispatch.  These analogies are relevant to what I regard as a fundamental  question about the CP and its attendant maxims, namely, what the  basis is for the assumption which we seem to make, and on which (I  hope) it will appear that a great range of implicatures depend, that  talkers will in general (ceteris paribus and in the absence of indica- ..  tions to the contrary) proceed in the manner that these principles  prescribe. A dull but, no doubt at a certain level, adequate answer is  that it is just a well-recognized empirical fact that people DO behave  in these ways  they have learned to do so in childhood and not lost  the habit of doing so  and, indeed, it would involve a good deal of effort to make a radical departure from the habit. It is much easier, for  example, to tell the truth than to invent lies.  I am, however, enough of a rationalist to want to find a basis that  underlies these facts, undeniable though they may be  I would like  to be able to think of the standard type of conversational practice not  merely as something that all or most do IN FACT follow but as something that it is HEASONAllLE for us to follow, that we SHOULD NOT  abandon. For a time, I was attracted by the idea that observance of  the CP and the maxims, in a talk exchange, could be thought of as a  quasi-contractual matter, with parallels outside the realm of discourse. If you pass by when I am struggling with my stranded car, I  no doubt have some degree of expectation that you will offer help,  but once you join me in tinkering under the hood, my expectations  become stronger and take more specific forms (in the absence of indications that you are merely an incompetent meddler)  and talk  exchanges seemed to me to exhibit, characteristically, certain features that jointly distinguish cooperative transactions:  1. The participants have some common immediate aim, like getting a car mended  their ultimate aims may, of course, be independent and even in conflict-each may want to get the car mended in  order to drive off, leaving the other stranded. In characteristic talk  exchanges, there is a common aim even if, as in an over-the-wall  chat, it is a second-order one, namely, that each party should, for the  time being, identify himself with the transitory conversational interests of the other.  2. The contributions of the participants .should be dovetailed,  mutually dependent.  3. There is some sort of understanding (which may be explicit but  which is often tacit) that, otl1er things being equal, the transaction  should continue in appropriate style unless both parties are agreeable that it should terminate. You do not just shove off or start doing  something else.  But while some such quasi-contractual basis as this may apply to  some cases, there are too many types of exchange, like quarreling  and letter writing, that it fails to fit comfortably. In any case, one  feels that the talker who is irrelevant or obscure has primarily let  Logic and Conversation 49  down not his audience but himself. So I would like t< be able to  show that observance of the CP and maxims is reasonal de (rational)  along the following lines: that any one who cares about the goals that  are central to conversation/communication (e.g., giving and receiving  information, influencing and being influenced by others) must be expected to have an interest, given suitable circumstances, in participation in talk exchanges that will be profitable only on the assumption  that they are conducted in general accordance with the CP and the  maxims. Whether any such conclusion can be reached, I am uncertain  in any case, I am fairly sure that I cannot reach it until I am a  good deal clearer about the nature of relevance and of the circumstances in which it is required.  It is now time to show the connection between the CP and  maxims, on the one hand, and conversational implicature on the  other.  A participant in a talk exchange may fail to fulfill a maxim in  various ways, which include the following:  1. He may quietly and unostentatiously VIOLATE a ma .,im  if so, in  some cases he will be liable to mislead.  2. He may OPT OUT from the operation both of the maxim and of  the CP  he may say, indicate, or allow it to become plai 1 that he is  unwilling to cooperate in the way the maxim requires. I le may say,  for example, I cannot say more  my lips are sealed.  3. He may be faced by a CLASH: He may be unable, for example,  to fulfill the first maxim of Quantity (Be as informative as is required)  without violating the second maxim of Quality (Have aclequate evidence for what you say).  4. He may FLOUT a maxim  that is, he may BLATANTL. fail to fulfill it. On the assumption that the speaker is able to fulfill the maxim  and to do so without violating another maxim (because oi a clash), is  not opting out, and is not, in view of the blatancy of his pt~rformance,  trying to mislead, the hearer is faced with a minor problem: How can  his saying what he did say be reconciled with the supposition that he  is observing the overall CP? This situation is one that characteristically gives rise to a conversational implicature  and when a conversational implicature is generated in this way, I shall say that a  maxim is being EXPLOITED.  I am now in a position to characterize the notion of conversational  implicature. A man who, by (in, when) saying (or making as if to say)  that p has implicated that q, may be said to have conversationally  implicated that q, PROVIDED THAT (1) he is to be presumed to be ob- - serving the conversational maxims, or at least the cooperative principle  (2) the supposition that he is aware that, or thinks that, q is  required in order to make his saying or making as if to say p (or doing  so in THOSE terms) consistent with this presumption  and (3) the  speaker thinks (and would expect the hearer to think that the speaker  thinks) that it is within the competence of the hearer to work out, or  grasp intuitively, that the sup:_)osition mentioned in (2) IS required.  Apply this to my initial example, to B's remark that C has not yet  been to prison. In a suitable setting A might reason as follows: '(1) B  has apparently violated the maxim 'Be relevant' and so may he  regarded as having flouted one of the maxims conjoining perspicuity,  yet I have no reason to suppose that he is opting out from the operation of the CP  (2) given the circumstances, I can regard his irrelevance as only apparent if, and only if, I suppose him to think that C  is potentially dishonest  (3) B knows that I am capable of working out  step (2). So B implicates that C is potentially dishonest.'  The presence of a conversational implicature must be capable of  being worked out  for even if it can in fact be intuitively grasped,  unless the intuition is replaceable by an argument, the implicature  (if present at all) will not count as a CONVERSATIONAL implicature  it  will be a CONVENTIONAL implicature. To work out that a particular  conversational implicature is present, the hearer will reply on the  following data: (1) the conventional meaning of the words used,  together with the identity of any references that may be involved  (2)  the CP and its maxims  (3) the context, linguistic or otherwise, of the  utterance  (4) other items of background knowledge  and (5) the fact  (or supposed fact) that all relevant items falling under the previous  headings are available to both participants and both participants  know or assume this to be the case. A general pattern for the working  out of a conversational implicature might be given as follows: 'He has  said that p  there is no reason to suppose. that he is not observing the  maxims, or at least the CP  he could not be doing this unless he  thought that q  he knows (and knows that I know that he knows) that  I can see that the supposition that he thinks that q IS required  he has  done nothing to stop me thinking that q  he intends me to think, or is  at least willing to allow me to think, that q  and so he has implicated  that q.'  Examples  I shall now offer a number of examples, which I shall divide into  three groups.  Logic and Conversation 51  Gnoup A: Examples in which no maxim is violated. or at least in  which it is not clear that any maxim is violated  A is standing by an obviously immobilized car and is approached  by B  the following exchange takes place:  (1) A: I am out of petrol.  B: There is a garage round the corner. (Gloss: B would be  infringing the maxim 'Be relevant' unless he thinks, or thinks it possible, that the garage is open, and has petrol to sell  so he implicates  that the garage is, or at least may he open, etc.)  In this example, unlike the case of the remark He hasn't been to  prison yet, the unstated connection between B's remark and A's  remark is so obvious that, even if one interprets the supermaxim of  Manner, 'Be perspicuous,' as applying not only to the expression of  what is said but also to the connection of what is said with adjacent  remarks, there seems to be no case for regarding that supermaxim as  infringed in this example. The next example is perhaps a little less  clear in this respect:  Smith doesn't seem to have a girlfriend these days.  He has been paying a lot of visits to New York lately.  B implicates that Smith has, or may have, a girlfriend in New York.  (A gloss is unnecessary in view of that given for the previous  example.)  In both examples, the speaker implicates that which he must be assumed to believe in order to preserve the assumption that he is observing the maxim of relation.  GnouP B: An example in which a maxim is violated, hut its  violation is to be explained by the supposition of a clash with  another maxim  A is planning with B an itinerary for a holiday in France. Both  know that A wants to see his friend C, if to do so would not involve  too great a prolongation of his journey:  reason to suppose that B is opting out  his answer is, as he well  knows, less informative than is required to meet A's needs. This  infringement of the first maxim of Quantity can be explained only by  the supposition that B is aware that to be more informative would be  to say something that infringed the maxim of Quality, 'Don't say  - what you lack adequate evidence for', so B implicates that he does  not know in which town C lives.)  GROUP C: Examples that involve exploitation, that is, a procedure by which a maxim is flouted for the purpose of getting in a conversational implicature by means of something of the nature of a figure of speech  In these examples, though some maxim is violated at the level of  what is said, the hearer is entitled to assume that that maxim, or at  least the overall Cooperative Principle, is observed at the level of  what is implicated.  (Ia) A flouting of the first maxim of Quantity  A is writing a testimonial about a pupil who is a candidate for a  philosophy job, and his letter reads as follows: 'Dear Sir, Mr. X's  command of English is excellent, and his attendance at tutorials has  been regular. Yours, etc.' (Gloss: A cannot be opting out, since if he  wished to be uncooperative, why write at all? He cannot be unable,  through ignorance, to say more, since the man is his pupil  moreover,  he knows that more information than this is wanted. He must, therefore, be wishing to impart information that he is reluctant to write  down. This supposition is tenable only on the assumption that he  thinks Mr. X is no good at philosophy. This, then, is what he is  implicating.)  Extreme examples of a flouting of the first maxim of Quantity are  provided by utterances of patent tautologies like Women are women  and War is war. I would wish to maintain that at the level of what is  said, in my favored sense, such remarks are totally noninformative  and so, at that level, cannot but infringe the first maxim of Quantity  in any conversational context. They are, of course, informative at the  level of what is implicated, and the hearer's identification of their informative content at this level is dependent on his ability to explain  the speaker's selection of this PARTICULAH patent tautology.  (3b) An infringement of the second maxim of Quantity, 'Do not  give more information than is required', on the assumption that the  existence of such a maxim should be admitted  A wants to know whether p, and B volunteers not only the information that p, but information to the effect that it is certain that p, and  that the evidence for its being the case that p is so-and-so and suchand-such.  B's volubility may be undesigned, and if it is so regarded by A it  may raise in A's mind a doubt as to whether B is as certain as he says  ' '  I  l  Logic and Conversation 53  he is ('Methinks the lady doth protest too much'). But if it is thought  of as designed, it would be an oblique way of conveying that it is to  some degree controversial whether or not p. It is, however, arguable  that such an implicature could be explained by reference to the  maxim of Relation without invoking an alleged second maxim of  Quantity.  (2a) Examples in which the first maxim of Quality is flouted  I. Irony. X, with whom A has been on close terms until now, has  betrayed a secret of A's to a business rival. A and his audience iJOth  know this. A says 'X is a fine friend'. (Gloss: It is perfec:tl  obvious to  A and his audience that what A has said or has made as if to say is  something he does not believe, and the audience knows that A  knows that this is obvious to the audience. So, unless A's utterance is  entirely pointless, A must be trying to get across some other proposition than the one he purports to be putting forward. This must be  some obviously related proposition  the most obviously related proposition is the contradictory of the one he purports to be putting  forward.)  2. Metaphor. Examples like You are the cream in my coffee characteristically involve categorial falsity, so the contradictory of what  the speaker has made as it to say will, strictly speaking, be a truism   so it cannot be THAT that such a speaker is trying to get across. The  most likely supposition is that the speaker is attributing to his audience some feature or features in respect of which the audience  resembles (more or less fancifully) the mentioned substance.  It is possible to combine metaphor and irony by imp >sing on the  hearer two stages of interpretation. I say You are the r·ream in my  coffee, intending the hearer to reach first the metaphor intcrpretant  'You are my pride and joy' and then the irony interprclant 'You are  my bane.'  3. Meiosis. Of a man known to have broken up all the furniture,  one says He was a little intoxicated.  4. Hyperbole. Every nice girl loves a sailor.  (2b) Examples in which the second maxim of Quality 'Do not say  that for which you lack adequate evidence', is flouted are perhaps  not easy to find, but the following seems to be a specimen. I say of  X's wife, She is probably deceiving him this evening. ln a suitable  context, or with a suitable gesture or tone of voice, it may be clear  that I have no adequate reason for supposing this to be the case. My  partner, to preserve the assumption that the conversational game is  still being played, assumes that I am getting at some related proposition for the acceptance of which I DO have a reasonable basis. The  related proposition might well be that she is given to deceiving her  husband, or possibly that she is the sort of person who would not  stop short of such conduct.  (3) Examples in which an implicature is achieved by real, as distinct from apparent, violation of the maxim of Relation are perhaps  rare, but the following seems to be a good candidate. At a genteel tea  party, A says Mrs. X is an old bag. There is a moment of appalled  silence, and then B says The weather has been quite delightful this  summer, hasn't it? B has blatantly refused to make what HE says relevant to A's preceding remark. He thereby implicates that A's remark  should not be discussed and, perhaps more specifically, that A has  committed a social gaffe.  (4) Examples in which various maxims falling under the supermaxim 'Be perspicuous' are flouted  1. Ambiguity. We must remember that we are concerned only  with ambiguity that is deliberate, and that the speaker intends or expects to be recognized by his hearer. The problem the hearer has to  solve is why a speaker should, when still playing the conversational  game, go out of his way to choose an ambiguous utterance. There are  two types of cases:  (a) Examples in which there is no difference, or no striking difference, between two interpretations of an utterance with respect to  straightforwardness  neither interpretation is notably more sophisticated, less standard, more recondite or more far-fetched than the  other. We might consider Blake's lines: 'Never seek to tell thy love,  Love that never told can be.' To avoid the complications introduced  by the presence of the imperative mood, I shall consider the related  sentence, I sought to tell my love, love that never told can be. There  may be a double ambiguity here. My love may refer to either a state  of emotion or an object of emotion, and love that never told can be  may mean either 'Love that cannot be told' or 'love that if told cannot  continue to exist.' Partly because of the sophistication of the poet and  partly because of internal evidence (that the ambiguity is kept up),  there seems to be no alternative to supposing that the ambiguities  are deliberate and that the poet is conveying both what he would be  saying if one interpretation were intended rather than the other, and  vice versa  though no doubt the poet is not explicitly SAYING any one  of these things but only conveying or suggesting them (cf. 'Since she  [nature] pricked thee out of women's pleasure, mine be thy love,  and thy love's use their treasure.)  (b) Examples in which one interpretation is notably less straightforward than another. Take the complex example of the British Gen- I  Logic and Conversation 55  eral who captured the town of Sind and sent back the message  Peccavi. The ambiguity involved ('I have Sind'/'I have sinned') is  phonemic, not morphemic  and the expression actually used is  unambiguous, but since it is in a language foreign to speaker and  hearer, translation is called for, and the ambiguity resides in the  standard translation into native English.  Whether or not the straightforward interpretant ('I have sinned') is  being conveyed, it seems that the nonslraightforward must be. There  might be stylistic reasons for conveying by a sentence merely its  nonstraightforward interprctant, but it would be pointless, and  perhaps also stylistically objectionable, to go to the trouble of finding  an expression that nonstraightforwardly conveys that p, thus imposing on an audience the effort involved in finding this interpretant, if  this interpretant were otiose so far as communication was concerned.  Whether the straightforward interpretant is also being conveyed  seems to depend on whether such a supposition would conflict with  other conversational requirements, for example, would it be relevant,  would it be something the speaker could be supposed to accept, and  so on. If such requirements are not satisfied, then the straightforward  interpretant is not being conveyed. If they are, it is. If the author of  Peccavi could naturally be supposed to think that he had committed  some kind of transgression, for example, had disobeyed his orders in  capturing Sind, and if reference to such a transgression would be relevant to the presumed interests of the audience, then he would have  been conveying both interpretants  otl1erwise he would be conveying only the nonstraightforward one.  2. Obscurity. How do I exploit, for the purposes of communication, a deliberate and overt violation of the requirement that I  should avoid obscurity? Obviously, if the Cooperative Principle is to  operate, I must intend my partner to understand what I am saying  despite the obscurity I import into my utterance. Suppose that A and  B are having a conversation in the presence of a third party, for example, a child, tl1en A might be deliberately obscure, though not too  obscure, in the hope that B would understand and the third party  not. Furthermore, if A expects B to see that A is being deliberately  obscure, it seems reasonable to suppose that, in making his conversational contribution in this way, A is implicating that the contents of  his communication should not be imparted to the third party.  3. Failure to be brief or succinct. Compare the remarks:  (a) Miss X sang 'Home sweet home.'  (b) Miss X produced a series of sounds tlzat corresponded  closely with the score of 'Home sweet home'.  •  Suppose that a reviewer has chosen to utter (b) rather than (a).  (Gloss: Why has he selected that rigmarole in place of the concise  1 and n~:lrlY synonymous sang? Presumably, to indicate some striking  difference between Miss X' s performance and those to which the  word singing is usually applied. The most obvious supposition is that  Miss X' s performance suffered from some hideous defect. The  reviewer knows that this supposition is what is likely to spring to  mind, so that is what he is implicating.)  I have so far considered only cases of what I might call particularized conversational implicature-that is to say, cases in w", "filename": "Grice - Logic and Conversation.pdf", "meta": {"bla": "huahaua"}}