{"text": "BY  With a Postscript edited by  Penelope A. Bulloch and Joseph Raz  Oxford University Press, Walton Street, Oxford ox2 6oP  Oxford New York  Athens Auckland Bangkok Bombay  Calcutta Cape Town Dares Salaam Delhi  Florence. Hong Kong Istanbul Karachi  Kuala Lumpur Madras Madrid Melbourne  Mexico City Nairobi Paris Singapore  Taipei Tokyo Toronto  and associated companies in  Berlin Ibadan  Oxford is a trade mark of Oxford University Press  Published in the United States  by Oxford University Press Inc., New York  © Oxford University Press 1961  First edition published 1961  Second edition published 1994  (with a new Postscript)  All rights reserved. No part of this publication may be reproduced,  stored in a retrieval .rystem, or transmitted, in a'!)' form or by a'!)' means,  without the prior permission in writing of Oxford University Press.  Within the UK, exceptions are allowed in respect of a'!)' fair dealing for the  purpose of research or private stut!J, or criticism or review, as permitted  under the Copyright, Designs and Patents Act, 1988, or in the case of  reprographic reproduction in accordance with the terms of the licences  issued by the Copyright Licensing Agen0'. Enquiries concerning  reproduction outside these terms and in other countries should be  sent to the Rights Department, Oxford University Press,  at the address above  This book is sold subject to the condition that it shall not, by wqy  of trade or otherwise, be lent, re-sold, hired out or otherwise circulated  without the publisher's prior consent in any form of binding or cover  other than that in which it is published and without a similar condition  including this condition being imposed on the subsequent purchaser  British Library Cataloguing in Publication Data  Data available  Library of Congress Cataloging in Publication Data  Data available  Printed in Great Britain  on acidjree paper by  Biddies Ltd., Guildford and King's Lynn  MY aim in this book has been to further the understanding  of law, coercion, and morality as different but related social  phenomena. Though it is primarily designed for the student  of jurisprudence, I hope it may also be of use to those whose  chief interests are in moral or political philosophy, or in sociology, rather than in law. The lawyer will regard the book  as an essay in analytical jurisprudence, for it is concerned  with the clarification of the general framework oflegal thought,  rather than with the criticism of law or legal policy. Moreover, at many points, I have raised questions which may well  be said to be about the meanings of words. Thus I have  considered: how 'being obliged' differs from 'having an obligation'  how the statement that a rule is a valid rule of law  differs from a prediction of the behaviour of officials  what is  meant by the assertion that a social group observes a rule  and how this differs from and resembles the assertion that its  members habitually do certain things. Indeed, one of the  central themes of the book is that neither law nor any other  form of social structure can be understood without an appreciation of certain crucial distinctions between two different  kinds of statement, which I have called 'internal' and 'external' and which can both be made whenever social rules are  observed.  Notwithstanding its concern with analysis the book may  also be regarded as an essay in descriptive sociology  for the  suggestion that inquiries into the meanings of words merely  throw light on words is false. Many important distinctions,  which are not immediately obvious, between types of social  situation or relationships may best be brought to light by an  examination of the standard uses of the relevant expressions  and of the way in which these depend on a social context,  itself often left unstated. In this field of study it is particularly  true that we may use, as Professor J. L. Austin said, 'a sharpened awareness of words to sharpen our perception of the  phenomena'.  I am heavily and obviously indebted to other writers   indeed much of the book is concerned with the deficiencies of  a simple model of a legal system, constructed along the lines  of Austin's imperative theory. But in the text the reader will  find very few references to other writers and very few footnotes. Instead, he will find at the end of the book extensive  notes designed to be read after each chapter  here the views  expressed in the text are related to those of my predecessors  and contemporaries, and suggestions are made as to the way  in which the argument may be further pursued in their writings. I have taken this course, partly because the argument of  the book is a continuous one  which comparison with other  theories would interrupt. But I have also had a pedagogic  aim: I hope that this arrangement may discourage the belief  that a book on legal theory is primarily a book from which  one learns what other books contain. So long as this belief is  held by those who write, little progress will be made in the  subject  and so long as it is held by those who read, the  educational value of the subject must remain very small.  I have been indebted for too long to too many friends to  be capable now of identifying all my obligations. But I have  a special debt to acknowledge to Mr A. M. Honore whose  detailed criticisms exposed many confusions of thought and  infelicities of style. These I have tried to eliminate, but I fear  that much is left of which he would disapprove. I owe to  conversations with Mr G. A. Paul anything of value in the  political philosophy of this book and in its reinterpretation of  natural law, and I have to thank him for reading the proofs.  I am also most grateful to Dr Rupert Cross and Mr P. F.  Strawson, who read the text, for their beneficial advice and  criticism.  WITHIN a few years of its publication The Concept Of Law  transformed the way jurisprudence was understood and studied in the English-speaking world and beyond. Its enormous  impact led to a multitude of publications discussing the book  and its doctrines, and not only in the context of legal theory,  but in political and moral philosophy too.  For many years Hart had it in mind to add a chapter to  Tlze Concept if Law. He did not wish to tinker with the text  whose influence has been so great, and in accordance with his  wishes it is here published unchanged, except for minor corrections. But he wanted to respond to the many discussions  of the book, defending his position against those who misconstrued it, refuting unfounded criticism, and-of equal importance in his eyes-conceding the force of justified criticism  and suggesting ways of adjusting the book's doctrines to meet  those points. That the new chapter, first thought of as a  preface, but finally as a postscript, was unfinished at the time  of his death was due only in part to his meticulous perfectionism. It was also due to persisting doubts about the wisdom of the project, and a nagging uncertainty whether he  could do justice to the vigour and insight of the theses of  the book as originally conceived. Nevertheless, and with many  interruptions, he persisted with work on the postscript and at  the time of his death the first of the two intended sections was  nearly complete.  When J enifer Hart asked us to look at the drafts and  decide whether there was anything publishable there our  foremost thought was not to let anything be published that  Hart would not have been happy with. We were, therefore,  delighted to discover that for the most part the first section of  the postscript was in such a finished state. We found only  hand-written notes intended for the second section, and they  were too fragmentary and inchoate to be publishable. In contrast the first section existed in several versions, having been  typed, revised, retyped, and rerevised. Even the most recent  version was obviously not thought by him to be in a final  state. There are numerous alterations in pencil and Biro.  Moreover, Hart did not discard earlier versions, but seems to  have continued to work on whichever version was to hand.  While this made the editorial task more difficult, the changes  introduced over the last two years were mostly changes of  stylistic nuance, which itself indicated that he was essentially  satisfied with the text as it was.  Our task was to compare the alternative versions, and where  they did not match establish whether segments of text which  appeared in only one of them were missing from the others  because he discarded them, or because he never had one  version incorporating all the emendations. The published text  includes all the emendations which were not discarded by  Hart, and which appear in versions of the text that he continued to revise. At times the text itself was incoherent. Often  this must have been the result of a misreading of a manuscript by the typist, whose mistakes Hart did not always notice.  At other times it was no doubt due to the natural way in  which sentences get mangled in the course of composition, to  be sorted out at the final drafting, which he did not live to do.  In these cases we tried to restore the original text, or to recapture, with minimum intervention, Hart's thought. One  special problem was presented by Section 6 (on discretion).  We found two versions of its opening paragraph, one in a  copy which ended at that point, and another in a copy containing the rest of the section. As the truncated version was  in a copy incorporating many of his most recent revisions,  and was never discarded by him, and as it is consonant with  his general discussion in the postscript, we decided to allow  both versions to be published, the one which was not continued appearing in an endnote.  Hart never had the notes, mostly references, typed. He had  a hand-written version of the notes, the cues for which were  most easily traced in the earliest typed copy of the main text.  Later he occasionally added references in marginal comments,  but for the most part these were incomplete, sometimes indicating no more than the need to trace the reference. Timothy  Endicott has checked all the references, traced all that were  incomplete, and added references where Hart quoted Dworkin  or closely paraphrased him without indicating a source.  Endicott also corrected the text where the quotations were  inaccurate. In the course of this work, which involved extensive research and resourcefulness, he has also suggested several  corrections to the main text, in line with the editorial guidelines set out above, which we gratefully incorporated.  There is no doubt in our mind that given the opportunity  Hart would have further polished and improved the text before  publishing it. But we believe that the published postscript contains his considered response to many of Dworkin's arguments.  Continuity of Law 5 I  2. The Persistence of Law 6I  3· Legal Limitations on Legislative Power 66  4· The Sovereign behind the Legislature 7 I  3· Finality and Infallibility in Judicial  Decision I4I  4· Uncertainty in the Rule of Recognition I47  (i) Positivism as a Semantic Theory 244  (ii) Positivism as an Interpretive Theory 24S  (iii) Soft Positivism 2SO  3· The Nature of Rules 2S4  (i) The Practice Theory of Rules 2S4  (ii) Rules and Principles 2S9  4· Principles and the Rule of Recognition 263  Pedigree and Interpretation 263  (ii) The Identification of the Law 269  6. judicial Discretion 272  Notes 277  Index gog  I  FEw questions concerning human society have been asked  with such persistence and answered by serious thinkers in  so many diverse, strange, and even paradoxical ways as the  question 'What is law?' Even if we confine our attention to  the legal theory of the last I 50 years and neglect classical and  medieval speculation about the 'nature' of law, we shall find  a situation not paralleled in any other subject systematically  studied as a separate academic discipline. No vast literature  is dedicated to answering the questions 'What is chemistry?'  or 'What is medicine?', as it is to the question 'What is law?'  A few lines on the opening page of an elementary textbook is  all that the student of these sciences is asked to consider  and  the answers he is given are of a very different kind from those  tendered to the student oflaw. No one has thought it illuminating or important to insist that medicine is 'what doctors do  about illnesses', or 'a prediction of what doctors will do', or  to declare that what is ordinarily recognized as a characteristic, central part of chemistry, say the study of acids, is not  really part of chemistry at all. Yet, in the case of law, things  which at first sight look as strange as these have often been  said, and not only said but urged with eloquence and passion,  as if they were revelations of truths about law, long obscured  by gross misrepresentations of its essential nature.  'What officials do about disputes is ... the law itself'  I 'The  prophecies of what the courts will do ... are what I mean by  the law' • Statutes are 'sources of Law ... not parts of the  Law itself'  3 'Constitutional law is positive morality merely' 4  'One shall not steal  if somebody steals he shall be punished.  ... If at all existent, the first norm is contained in the second  norm which is the only genuine norm .... Law is the primary  norm which stipulates the sanction'.'  These are only a few of many assertions and denials concerning the nature of law which at first sight, at least, seem  strange and paradoxical. Some of them seem to conflict with  the most firmly rooted beliefs and to be easily refutable  so  that we are tempted to reply, 'Surely statutes are law, at least  one kind of law even if there are others': 'Surely law cannot  just mean what officials do or courts will do, since it takes a  law to make an official or a court'.  Yet these seemingly paradoxical utterances were not made  by visionaries or philosophers professionally concerned to  doubt the plainest deliverances of common sense. They are  the outcome of prolonged reflection on law made by men who  were primarily lawyers, concerned professionally either to  teach or practise law, and in some cases to administer it as  judges. Moreover, what they said about law actually did in  their time and place increase our understanding of it. For,  understood in their context, such statements are both illuminating and puzzling: they are more like great exaggerations of  some truths about law unduly neglected, than cool definitions. They throw a light which makes us see much in law  that lay hidden  but the light is so bright that it blinds us to  the remainder and so leaves us still without a clear view of  the whole.  To this unending theoretical debate in books we find a  strange contrast in the ability of most men to cite, with ease  and confidence, examples of law if they are asked to do so.  Few Englishmen are unaware that there is a law forbidding  murder, or requiring the payment of income tax, or specifying what must be done to make a valid will. Virtually everyone except the child or foreigner coming across the English  word 'law' for the first time could easily multiply such examples, and most people could do more. They could describe, at  least in outline, how to find out whether something is the law  in England  they know that there are experts to consult and  courts with a final authoritative voice on all such questions.  Much more than this is quite generally known. Most educated  people have the idea that the laws in England form some sort  of system, and that in France or the United States or Soviet  Russia and, indeed, in almost every part of the world which  is thought of as a separate 'country' there are legal systems  which are broadly similar in structure in spite of important  differences. Indeed an education would have seriously failed  if it left people in ignorance ofthese facts, and we would hardly  think it a mark of great sophistication if those who knew this  could also say what are the important points of similarity  between different legal systems. Any educated man might be  expected to be able to identify these salient features in some  such skeleton way as follows. They comprise (i) rules forbidding or enjoining certain types of behaviour under penalty   (ii) rules requiring people to compensate those whom they  injure in certain ways  (iii) rules specifying what must be  done to make wills, contracts or other arrangements which  confer rights and create obligations  (iv) courts to determine  what the rules are and when they have been broken, and to  fix the punishment or compensation to be paid  (v) a legislature  to make new rules and abolish old ones.  If all this is common knowledge, how is it that the question  'What is law?' has persisted and so many various and extraordinary answers have been given to it? Is it because, besides  the clear standard cases constituted by the legal systems of  modern states, which no one in his senses doubts are legal  systems, there exist also doubtful cases, and about their 'legal  quality' not only ordinary educated men but even lawyers  hesitate? Primitive law and international law are the foremost  of such doubtful cases, and it is notorious that many find that  there are reasons, though usually not conclusive ones, for  denying the propriety of the now conventional use of the word  'law' in these cases. The existence of these questionable or  challengeable cases has indeed given rise to a prolonged and  somewhat sterile controversy, but surely they cannot account  for the perplexities about the general nature of law expressed  by the persistent question 'What is law?' That these cannot  be the root of the difficulty seems plain for two reasons.  First, it is quite obvious why hesitation is felt in these cases.  International law lacks a legislature, states cannot be brought  before international courts without their prior consent, and  there is no centrally organized effective system of sanctions.  Certain types of primitive law, including those out of which  some contemporary legal systems may have gradually evolved,  similarly lack these features, and it is perfectly clear to everyone that it is their deviation in these respects from the standard  case which makes their classification appear questionable.  There is no mystery about this.  Secondly, it is not a peculiarity of complex terms like 'law'  and 'legal system' that we are forced to recognize both clear  standard cases and challengeable borderline cases. It is now  a familiar fact (though once too little stressed) that this distinction must be made in the case of almost every general  term which we use in classifying features of human life and  of the world in which we live. Sometimes the difference between the clear, standard case or paradigm for the use of an  expression and the questionable cases is only a matter of  degree. A man with a shining smooth pate is clearly bald   another with a luxuriant mop clearly is not  but the question  whether a third man, with a fringe of hair here and there, is  bald might be indefinitely disputed, if it were thought worth  while or any practical issue turned on it.  Sometimes the deviation from the standard case is not a  mere matter of degree but arises when the standard case is in  fact a complex of normally concomitant but distinct elements,  some one or more of which may be lacking in the cases open  to challenge. Is a flying boat a 'vessel'? Is it still 'chess' if the  game is played without a queen? Such questions may be instructive because they force us to reflect on, and make explicit, our conception of the composition of the standard case   but it is plain that what may be called the borderline aspect  of things is too common to account for the long debate about  law. Moreover, only a relatively small and unimportant part  of the most famous and controversial theories of law are concerned with the propriety of using the expressions 'primitive  law' or 'international law' to describe the cases to which they  are conventionally applied.  When we reflect on the quite general ability of people to  recognize and cite examples of laws and on how much is  generally known about the standard case of a legal system, it  might seem that we could easily put an end to the persistent  question, 'What is law?', simply by issuing a series ofreminders of what is already familiar. Why should we not just repeat  the skeleton account of the salient features of a municipal  legal system which, perhaps optimistically, we put (on page  3) into the mouth of an educated man? We can then simply  say, 'Such is the standard case of what is meant by \"law\" and  \"legal system\"  remember that besides these standard cases  you will also find arrangements in social life which, while  sharing some ofthese salient features, also lack others of them.  These are disputed cases where there can be no conclusive  argument for or against their classification as law.'  Such a way with the question would be agreeably short.  But it would have nothing else to recommend it. For, in the  first place, it is clear that those who are most perplexed by  the question 'What is law?' have not forgotten and need no  reminder of the familiar facts which this skeleton answer  offers them. The deep perplexity which has kept alive the question, is not ignorance or forgetfulness or inability to recognize  the phenomena to which the word 'law' commonly refers.  Moreover, if we consider the terms of our skeleton account of  a legal system, it is plain that it does little more than assert  that in the standard, normal case laws of various sorts go  together. This is so because both a court and a legislature,  which appear in this short account as typical elements of a  standard legal system, are themselves creatures of law. Only  when there are certain types of laws giving men jurisdiction  to try cases and authority to make laws do they constitute a  court or a legislature.  This short way with the question, which does little more  than remind the questioner of the existing conventions governing the use ofthe words 'law' and 'legal system', is therefore  useless. Plainly the best course is to defer giving any answer  to the query 'What is law?' until we have found out what it  is about law that has in fact puzzled those who have asked or  attempted to answer it, even though their familiarity with the  law and their ability to recognize examples are beyond question. What more do they want to know and why do they want  to know it? To this question something like a general answer  can be given. For there are certain recurrent main themes  which have formed a constant focus of argument and counterargument about the nature of law, and provoked exaggerated  and paradoxical assertions about law such as those we have  already cited. Speculation about the nature of law has a long  and complicated history  yet in retrospect it is apparent that  it has centred almost continuously upon a few principal issues.  These were not gratuitously chosen or invented for the pleasure of academic discussion  they concern aspects oflaw which  seem naturally, at all times, to give rise to misunderstanding,  so that confusion and a consequent need for greater clarity  about them may coexist even in the minds of thoughtful men  with a firm mastery and knowledge of the law.  We shall distinguish here three such principal recurrent issues, and show later why they come together in the form of  a request for a definition of law or an answer to the question  'What is law?', or in more obscurely framed questions such as  'What is the nature (or the essence) of law?'  Two of these issues arise in the following way. The most  prominent general feature of law at all times and places is  that its existence means that certain kinds of human conduct  are no longer optional, but in some sense obligatory. Yet this  apparently simple characteristic of law is not in fact a simple  one  for within the sphere of non-optional obligatory conduct  we can distinguish different forms. The first, simplest sense in  which conduct is no longer optional, is when one man is  forced to do what another tells him, not because he is physically compelled in the sense that his body is pushed or pulled  about, but because the other threatens him with unpleasant  consequences if he refuses. The gunman orders his victim to  hand over his purse and threatens to shoot if he refuses  if the  victim complies we refer to the way in which he was forced  to do so by saying that he was obliged to do so. To some it has  seemed clear that in this situation where one person gives  another an order backed by threats, and, in this sense of  'oblige', obliges him to comply, we have the essence of law,  or at least 'the key to the science of jurisprudence'.' This is  the starting-point of Austin's analysis by which so much  English jurisprudence has been influenced.  There is of course no doubt that a legal system often presents  this aspect among others. A penal statute declaring certain  conduct to be an offence and specifying the punishment to  which the offender is liable, may appear to be the gunman  situation writ large  and the only difference to be the relatively minor one, that in the case of statutes, the orders are  addressed generally to a group which customarily obeys such  orders. But attractive as this reduction of the complex phenomena of law to this simple element may seem, it has been  found, when examined closely, to be a distortion and a source  of confusion even in the case of a penal statute where an analysis in these simple terms seems most plausible. How then  do law and legal obligation differ from, and how are they  related to, orders backed by threats? This at all times has  been one cardinal issue latent in the question 'What is law?'.  A second such issue arises from a second way in which  conduct may be not optional but obligatory. Moral rules impose obligations and withdraw certain areas of conduct from  the free option of the individual to do as he likes. Just as a  legal system obviously contains elements closely connected  with the simple cases of orders backed by threats, so equally  obviously it contains elements closely connected with certain  aspects of morality. In both cases alike there is a difficulty in  identifying precisely the relationship and a temptation to see  in the obviously close connection an identity. Not only do law  and morals share a vocabulary so that there are both legal  and moral obligations, duties, and rights  but all municipal  legal systems reproduce the substance of certain fundamental  moral requirements. Killing and the wanton use of violence  are only the most obvious examples of the coincidence between the prohibitions of law and morals. Further, there is  one idea, that of justice which seems to unite both fields: it is  both a virtue specially appropriate to law and the most legal  of the virtues. We think and talk of 'justice according to law'  and yet also of the justice or injustice if the laws.  These facts suggest the view that law is best understood  as a 'branch' of morality or justice and that its congruence  with the principles of morality or justice rather than its  incorporation of orders and threats is of its 'essence'. This is  the doctrine characteristic not only of scholastic theories of  natural law but of some contemporary legal theory which is  critical of the legal 'positivism' inherited from Austin. Yet  here again theories that make this close assimilation of law to  morality seem, in the end, often to confuse one kind of obligatory conduct with another, and to leave insufficient room for  differences in kind between legal and moral rules and for  divergences in their requirements. These are at least as important as the similarity and convergence which we may also  find. So the assertion that 'an unjust law is not a law\" has  the same ring of exaggeration and paradox, if not falsity, as  'statutes are not laws' or 'constitutional law is not law'. It is  characteristic of the oscillation between extremes, which make  up the history of legal theory, that those who have seen in  the close assimilation of law and morals nothing more than a  mistaken inference from the fact that law and morals share a  common vocabulary of rights and duties, should have protested against it in terms equally exaggerated and paradoxical. 'The prophecies of what the courts will do in fact, and  nothing more pretentious, are what I mean by the law.»  The third main issue perennially prompting the question  'What is law?' is a more general one. At first sight it might  seem that the statement that a legal system consists, in general at any rate, of rules could hardly be doubted or found  difficult to understand. Both those who have found the key to  the understanding of law in the notion of orders backed by  threats, and those who have found it in its relation to morality or justice, alike speak oflaw as containing, if not consisting  largely of, rules. Yet dissatisfaction, confusion, and uncertainty  concerning this seemingly unproblematic notion underlies  much of the perplexity about the nature of law. What are  rules? What does it mean to say that a rule exists? Do courts  really apply rules or merely pretend to do so? Once the notion  is queried, as it has been especially in the jurisprudence of  this century, major divergencies in opinion appear. These we  shall merely outline here.  It is of course true that there are rules of many different  types, not only in the obvious sense that besides legal rules  there are rules of etiquette and of language, rules of games  and clubs, but in the less obvious sense that even within any  one of these spheres, what are called rules may originate in  different ways and may have very different relationships to  the conduct with which they are concerned. Thus even within  the law some rules are made by legislation  others are not  made by any such deliberate act. More important, some rules  are mandatory in the sense that they require people to behave in certain ways, e.g. abstain from violence or pay taxes,  whether they wish to or not  other rules such as those prescribing the procedures, formalities, and conditions for the  making of marriages, wills, or contracts indicate what people  should do to give effect to the wishes they have. The same  contrast between these two types of rule is also to be seen  between those rules of a game which veto certain types of  conduct under penalty (foul play or abuse of the referee) and  those which specify what must be done to score or to win. But  even if we neglect for the moment this complexity and consider only the first sort of rule (which is typical of the criminal law) we shall find, even among contemporary writers, the  widest divergence of view as to the meaning of the assertion  that a rule of this simple mandatory type exists. Some indeed  find the notion utterly mysterious.  The account which we are at first perhaps naturally tempted to give of the apparently simple idea of a mandatory rule  has soon to be abandoned. It is that to say that a rule exists  means only that a group of people, or most of them, behave  'as a rule' i.e. generally, in a specified similar way in certain  kinds of circumstances. So to say that in England there is a  rule that a man must not wear a hat in church or that one  must stand up when 'God Save the Queen' is played means,  on this account of the matter, only that most people generally  do these things. Plainly this is not enough, even though it  conveys part of what is meant. Mere convergence in behaviour between members of a social group may exist (all may  regularly drink tea at breakfast or go weekly to the cinema)  and yet there may be no rule requiring it. The difference between the two social situations of mere convergent behaviour  and the existence of a social rule shows itself often linguistically. In describing the latter we may, though we need not,  make use of certain words which would be misleading if we  meant only to assert the former. These are the words 'must',  'should', and 'ought to', which in spite of differences share  certain common functions in indicating the presence of a rule  requiring certain conduct. There is in England no rule, nor is  it true, that everyone must or ought to or should go to the  cinema each week: it is only true that there is regular resort  to the cinema each week. But there is a rule that a man must  bare his head in church.  What then is the crucial difference between merely convergent habitual behaviour in a social group and the existence of  a rule of which the words 'must', 'should', and 'ought to' are  often a sign? Here indeed legal theorists have been divided,  especially in our own day when several things have forced  this issue to the front. In the case of legal rules it is very often  held that the crucial difference (the element of 'must' or  'ought') consists in the fact that deviations from certain types  of behaviour will probably meet with hostile reaction, and in  the case of legal rules be punished by officials. In the case of  what may be called mere group habits, like that of going  weekly to the cinema, deviations are not met with punishment or even reproof  but wherever there are rules requiring  certain conduct, even non-legal rules like that requiring men  to bare their heads in church, something of this sort is likely  to result from deviation. In the case oflegal rules this predictable consequence is definite and officially organized, whereas  in the non-legal case, though a similar hostile reaction to deviation is probable, this is not organized or definite in character.  It is obvious that predictability of punishment is one important aspect of legal rules  but it is not possible to accept  this as an exhaustive account of what is meant by the statement that a social rule exists or of the element of 'must' or  'ought' involved in rules. To such a predictive account there  are many objections, but one in particular, which characterizes a whole school of legal theory in Scandinavia, deserves  careful consideration. It is that if we look closely at the activity of the judge or official who punishes deviations from  legal rules (or those private persons who reprove or criticize  deviations from non-legal rules), we see that rules are involved  in this activity in a way which this predictive account leaves  quite unexplained. For the judge, in punishing, takes the rule  as his guide and the breach of the rule as his reason and justification for punishing the offender. He does not look upon the  rule as a statement that he and others are likely to punish  deviations, though a spectator might look upon the rule in  just this way. The predictive aspect of the rule (though real  enough) is irrelevant to his purposes, whereas its status as a  guide and justification is essential. The same is true of informal reproofs administered for the breach of non-legal rules.  These too are not merely predictable reactions to deviations,  but something which existence of the rule guides and is held  to justify. So we say that we reprove or punish a man because  he has broken the rule: and not merely that it was probable  that we would reprove or punish him.  Yet among critics who have pressed these objections to the  predictive account some confess that there is something obscure here  something which resists analysis in clear, hard,  factual terms. What can there be in a rule apart from regular  and hence predictable punishment or reproof of those who  deviate from the usual patterns of conduct, which distinguishes  it from a mere group habit? Can there really be something  over and above these clear ascertainable facts, some extra  element, which guides the judge and justifies or gives him a  reason for punishing? The difficulty of saying what exactly  this extra element is has led these critics of the predictive  theory to insist at this point that all talk of rules, and the  corresponding use of words like 'must', 'ought', and 'should',  is fraught with a confusion which perhaps enhances their  importance in men's eyes but has no rational basis. We merely  think, so such critics claim, that there is something in the rule  which binds us to do certain things and guides or justifies us  in doing them, but this is an illusion even if it is a useful one.  All that there is, over and above the clear ascertainable facts  of group behaviour and predictable reaction to deviation, are  our own powerful 'feelings' of compulsion to behave in  accordance with the rule and to act against those who do not.  We do not recognize these feelings for what they are but  imagine that there is something external, some invisible part  of the fabric of the universe guiding and controlling us in  these activities. We are here in the realm of fiction, with  which it is said the law has always been connected. It is only  because we adopt this fiction that we can talk solemnly of the  government 'of laws not men'. This type of criticism, whatever the merits of its positive contentions, at least calls for  further elucidation of the distinction between social rules  and mere convergent habits of behaviour. This distinction is  crucial for the understanding of law, and much of the early  chapters of this book is concerned with it.  Scepticism about the character of legal rules has not, however, always taken the extreme form of condemning the very  notion of a binding rule as confused or fictitious. Instead, the  most prevalent form of scepticism in England and the United  States invites us to reconsider the view that a legal system  wholly, or even primarily, consists of rules. No doubt the courts  so frame their judgments as to give the impression that their  decisions are the necessary consequence of predetermined rules  whose meaning is fixed and clear. In very simple cases this  may be so  but in the vast majority of cases that trouble the  courts, neither statutes nor precedents in which the rules are  allegedly contained allow of only one result. In most important cases there is always a choice. The judge has to choose  between alternative meanings to be given to the words of a  statute or between rival interpretations of what a precedent  'amounts to'. It is only the tradition that judges 'find' and do  not 'make' law that conceals this, and presents their decisions  as if they were deductions smoothly made from clear preexisting rules without intrusion of the judge's choice. Legal  rules may have a central core of undisputed meaning, and in  some cases it may be difficult to imagine a dispute as to the  meaning of a rule breaking out. The provision of s. g of the  Wills Act, 1837, that there must be two witnesses to a will  may not seem likely to raise problems of interpretation. Yet  all rules have a penumbra of uncertainty where the judge  must choose between alternatives. Even the meaning of the  innocent-seeming provision of the Wills Act that the testator  must sign the will may prove doubtful in certain circumstances.  What if the testator used a pseudonym? Or if his hand was  guided by another? Or if he wrote his initials only? Or if he  put his full, correct, name unaided, but at the top of the first  page instead of at the bottom of the last? Would all these  cases be 'signing' within the meaning of the legal rule?  If so much uncertainty may break out in humble spheres  of private law, how much more shall we find in the magniloquent phrases of a constitution such as the Fifth and Fourteenth Amendments to the Constitution of the United States,  providing that no person shall be 'deprived of life liberty or  property without due process of law'? Of this one writer' h", "filename": "Herbert Lionel Adolphus Hart - The Concept of Law.pdf", "meta": {"bla": "huahaua"}}