{"text": "Proofs and refutations : the logic of mathematical discovery / Imre Lakatos   edited by John Worrall and Elie Zahar.  Proofs and Refutations https:/www.cambridge.org/core/terms https://doi.org/10.1017/CBO9781316286425 https:/www.cambridge.org/core  https:/www.cambridge.org/core/terms https://doi.org/10.1017/CBO9781316286425 https:/www.cambridge.org/core  Proofs and Refutations The Logic of Mathematical Discovery B imre lakatos Edited by john worrall and elie zahar https:/www.cambridge.org/core/terms https://doi.org/10.1017/CBO9781316286425 https:/www.cambridge.org/core  University Printing House, Cambridge CB2 8BS, United Kingdom Cambridge University Press is part of the University of Cambridge. It furthers the University’s mission by disseminating knowledge in the pursuit of education, learning and research at the highest international levels of excellence. www.cambridge.org Information on this title: www.cambridge.org/9781107534056 © Cambridge University Press 1976 This publication is in copyright. Subject to statutory exception and to the provisions of relevant collective licensing agreements, no reproduction of any part may take place without the written permission of Cambridge University Press. First published 1976 Reprinted with corrections 1977, 1979, 1981 Printed in the United Kingdom by Clays, St Ives plc A catalogue record for this publication is available from the British Library Library of Congress Cataloging-in-Publication Data Lakatos, Imre, 1922–1974. Proofs and refutations : the logic of mathematical discovery / Imre Lakatos   edited by John Worrall and Elie Zahar. – Cambridge Philosophy Classics edition. pages cm Originally published: Cambridge : Cambridge University Press, 1976. Transferred to digital printing 2005 Cambridge University Press has no responsibility for the persistence or accuracy of URLs for external or third-party internet websites referred to in this publication, and does not guarantee that any content on such websites is, or will remain, accurate or appropriate. https:/www.cambridge.org/core/terms https://doi.org/10.1017/CBO9781316286425 https:/www.cambridge.org/core  Contents B Preface to this edition by paolo mancosu page vii Editors’ preface ix Acknowledgments xii Author’s introduction 1 Chapter 1 6 1 A problem and a conjecture 6 2 A proof 7 3 Criticism of the proof by counterexamples which are local but not global 10 4 Criticism of the conjecture by global counterexamples 14 a. Rejection of the conjecture. The method of surrender 14 b. Rejection of the counterexample. The method of monster-barring 15 c. Improving the conjecture by exception-barring methods. Piecemeal exclusions. Strategic withdrawal or playing for safety 26 d. The method of monster-adjustment 32 e. Improving the conjecture by the method of lemma-incorporation. Proof-generated theorem versus naive conjecture 35 5 Criticism of the proof-analysis by counterexamples which are global but not local. The problem of rigour 45 a. Monster-barring in defence of the theorem 45 b. Hidden lemmas 46 c. The method of proof and refutations 50 d. Proof versus proof-analysis. The relativisation of the concepts of theorem and rigour in proof-analysis 53 6 Return to criticism of the proof by counterexamples which are local but not global. The problem of content 60 a. Increasing content by deeper proofs 60 b. Drive towards final proofs and corresponding sufficient and necessary conditions 67 c. Different proofs yield different theorems 69 v https:/www.cambridge.org/core/terms https://doi.org/10.1017/CBO9781316286425 https:/www.cambridge.org/core  7 The problem of content revisited 70 a. The naiveté of the naive conjecture 70 b. Induction as the basis of the method of proofs and refutations 72 c. Deductive guessing versus naive guessing 74 d. Increasing content by deductive guessing 81 e. Logical versus heuristic counterexamples 87 8 Concept-formation 89 a. Refutation by concept-stretching. A reappraisal of monster-barring – and of the concepts of error and refutation 89 b. Proof-generated versus naive concepts. Theoretical versus naive classification 93 c. Logical and heuristic refutations revisited 98 d. Theoretical versus naive concept-stretching. Continuous versus critical growth 99 e. The limits of the increase in content. Theoretical versus naive refutations 101 9 How criticism may turn mathematical truth into logical truth 105 a. Unlimited concept-stretching destroys meaning and truth 105 b. Mitigated concept-stretching may turn mathematical truth into logical truth 108 Chapter 2 112 Editors’ introduction 112 1 Translation of the conjecture into the ‘perfectly known’ terms of vector algebra. The problem of translation 112 2 Another proof of the conjecture 123 3 Some doubts about the finality of the proof. Translation procedure and the essentialist versus the nominalist approach to definitions 126 Appendix 1 Another case-study in the method of proofs and refutations 135 1 Cauchy’s defence of the ‘principle of continuity’ 135 2 Seidel’s proof and the proof-generated concept of uniform convergence 139 3 Abel’s exception-barring method 141 4 Obstacles in the way of the discovery of the method of proof-analysis 144 Appendix 2 The deductivist versus the heuristic approach 151 1 The deductivist approach 151 2 The heuristic approach. Proof-generated concepts 153 a. Uniform convergence 153 b. Bounded variation 155 c. The Carathéodory definition of measurable set 162 Bibliography 164 Index of names 175 Index of subjects 178 vi contents https:/www.cambridge.org/core/terms https://doi.org/10.1017/CBO9781316286425 https:/www.cambridge.org/core  Preface to this edition paolo mancosu B Proofs and Refutations is one of the undeniable classics of the philosophy of mathematics. Fifty years have passed since the publication of the articles that make up its central core, but the book has lost neither its freshness nor its provocative vitality. It takes the form of a classroom dialogue in which a group of students and their teacher investigate the problem of whether there is a relation that holds between the number of vertices V, the number of edges E, and the number of faces F of regular polyhedra (e.g. the five Platonic solids). At the outset of the dialogues they have arrived at the formula V – E + F = 2. They conjecture that the result might extend to any polyhedron (Euler’s conjecture), and this is the starting point of a riveting development that carries the reader through the rational reconstruction, as embodied in the class dialogue, of the history of Euler’s conjecture, culminating in Poincaré’s proof. The reconstruction, in strong contrast to a piece of axiomatic mathematics, features contradictions, monsters, counterexamples, conjectures, concept-stretchings, hidden lemmas, proofs, and a wide range of informal moves meant to account for the rationality of the process leading to concept-formation and conjectures/proofs in mathematical practice. Yet Euler’s conjecture is just a case-study displaying Lakatos’s highly original approach to the philosophy of mathematics. A starker contrast with the formalist foundational approach dominant up to the 1960s (and embodied in philosophies of mathematics of neo-positivist inspiration) can scarcely be imagined. Whereas the latter, inspired by Euclid’s infallibilist dogmatic style, thought of mathematical theories statically as axiomatic systems, Lakatos was after an account of informal mathematics as a fallible dynamic body of knowledge. Rejecting the positivist distinction between context of discovery and context of justification, he claimed that mathematical practice and its history are not the domain of the irrational but rather display an objectivity and rationality that any philosophy of mathematics worth its name should account for. The tools for addressing the rationality of mathematical growth could not, however, be those of formal logic, whose ‘deductivist style’ could only address issues of the static variety and was thus unable to account for concept-formation and vii  the rational dynamics driving the development of informal mathematics. Rather, Lakatos found inspiration in Polya’s work on mathematical heuristics, Hegel’s dialectic, and Popperian conjecture and refutation. This led to Lakatos’s dialectical methodology, a ‘heuristic style’ that reveals the struggle and the adventure of mathematical creation. There will always be disagreements as to whether or to what extent Lakatos’s case studies are paradigmatic and can be extended to mathematics as a whole. Scholars will also continue to disagree about the suitability of the dialectical framework for accounting for mathematical growth and the role of mathematical logic in the history and philosophy of mathematics. But the characteristic trait of a classic is its rich and varied legacy. Proofs and Refutations stands up to this test, for it continues to be a source of inspiration to many historians, mathematicians, and philosophers who aspire to develop a philosophy of mathematics that does justice to the static and dynamic complexity of mathematical practice. viii preface to this edition  Editors’ preface B Our great friend and teacher Imre Lakatos died unexpectedly on 2 February 1974. At the time he was (as usual) engaged on many intellectual projects. One of the most important of these was the publication of a modified and extended version of his brilliant essay ‘Proofs and Refutations’, which appeared in four parts in The British Journal for the Philosophy of Science, 14, 1963–4. Lakatos had long had a contract for this book, but had held back publication in the hope of amending and further improving the essay, and of adding to it substantial extra material. This work was considerably delayed by the diversion of his interests to the philosophy of physical science, but in the summer of 1973 he finally decided to go ahead with the publication. During that summer we each discussed plans for the book with him, and we have tried to produce a book which, in the sadly changed circumstances, is as similar as possible to the one then projected by Lakatos. We have thus included three new items in addition to the original ‘Proofs and Refutations’ essay (which appears here as Chapter 1). First we have added a second part to the main text. This concerns Poincaré’s vector-algebraic proof of the Descartes–Euler conjecture. It is based on chapter 2 of Lakatos’s 1961 Cambridge Ph.D. thesis. (The original ‘Proofs and Refutations’ essay was a much amended and improved version of chapter 1 of that thesis.) A part of chapter 3 of this thesis becomes here appendix 1, which contains a further case-study in the method of proofs and refutations. It is concerned with Cauchy’s proof of the theorem that the limit of any convergent series of continuous functions is itself continuous. Chapter 2 of the main text and appendix 1 should allay the doubt, often expressed by mathematicians who have read ‘Proofs and Refutations’, that, while the method of proof-analysis described by Lakatos may be applicable to the study of polyhedra, a subject which is ‘near empirical’ and where the counterexamples are easily visualisable, it may be inapplicable to ‘real’ mathematics. The third additional item (appendix 2) is also based on a part of chapter 3 of Lakatos’s thesis. It is about the consequences of his position for the development, presentation and teaching of mathematics. ix  One of the reasons Lakatos delayed publication was his recognition that some of this extra material, whilst containing many new points and developments of his position, was in need of further consideration and further historical research. This is particularly true of the material (in appendix 1) on Cauchy and Fourier. We also are aware of certain difficulties and ambiguities in this material and of omissions from it. We felt, however, that we should not change the content of what Lakatos had written. As for elaborating on, and adding to, the material, neither of us was in a position to supply the necessary long and detailed historical research. Faced then with the alternatives of not publishing the material at all, or publishing it in an unfinished state, we decided on the latter option. We feel that there is much of interest in it, and hope that it will stimulate other scholars to extend and correct it if necessary. In general, we did not think it right to modify the content of Lakatos’s material, even those parts of it about which we were confident Lakatos had changed his position. We have therefore restricted ourselves to pointing out (in notes marked with asterisks) some of those things we should have tried to persuade Lakatos to change and (which often amounts to the same thing) some of those points we believe Lakatos would have changed in publishing this material now. (His intellectual position had, of course, changed considerably during the thirteen years between completing the Ph.D. thesis and his death. The major changes in his general philosophy are explained in his [1970]. We should mention that Lakatos thought that his methodology of scientific research programmes had important implications for his philosophy of mathematics.) Our approach to matters of presentation has been to leave the material which Lakatos had himself published (i.e. chapter 1 of the main text) almost entirely unchanged (the only exceptions are a few misprints and unambiguous minor slips). We have, however, rather substantially modified the previously unpublished material – though, to repeat, only in form and not in content. Since this may seem a rather unusual procedure, perhaps a few words of justification are in order. Lakatos always took a great deal of care over the presentation of any of his material which was to be published, and, prior to publication, he always had such material widely circulated amongst colleagues and friends, for criticism and suggested improvements. We are sure that the material here published for the first time would have undergone this treatment, and that the changes would have been more drastic than those we have dared to introduce. Our knowledge (through personal experience) of the pains Lakatos took to present his position as clearly as possible x editors’ preface  obliged us to try to improve the presentation of this material as best we could. It is certain that these new items do not read as well as they would have done, had Lakatos himself revised the material on which they are based, but we felt that we were close enough to Lakatos, and involved enough in some of his previous publications, to make a reasonable attempt at bringing the material up to somewhere near his own high standards. We are very pleased to have had the opportunity to produce this edition of some of Lakatos’s important work in the philosophy of mathematics, for it allows us to discharge part of the intellectual and personal debt we both owe him. john worrall elie zahar editors’ preface xi  Author’s introduction B It frequently happens in the history of thought that when a powerful new method emerges the study of those problems which can be dealt with by the new method advances rapidly and attracts the limelight, while the rest tends to be ignored or even forgotten, its study despised. This situation seems to have arisen in our century in the Philosophy of Mathematics as a result of the dynamic development of metamathematics. The subject matter of metamathematics is an abstraction of mathematics in which mathematical theories are replaced by formal systems, proofs by certain sequences of well-formed formulae, definitions by ‘abbreviatory devices’ which are ‘theoretically dispensable’ but ‘typographically convenient’.1 This abstraction was devised by Hilbert to provide a powerful technique for approaching some of the problems of the methodology of mathematics. At the same time there are problems which fall outside the range of metamathematical abstractions. Among these are all problems relating to informal (inhaltliche) mathematics and to its growth, and all problems relating to the situational logic of mathematical problemsolving. I shall refer to the school of mathematical philosophy which tends to identify mathematics with its formal axiomatic abstraction (and the philosophy of mathematics with metamathematics) as the ‘formalist’ school. One of the clearest statements of the formalist position is to be found in Carnap [1937]. Carnap demands that (a) ‘philosophy is to be replaced by the logic of science . . .’, (b) ‘the logic of science is nothing other than the logical syntax of the language of science . . .’, (c) ‘metamathematics is the syntax of mathematical language’ (pp. xiii and 9). Or: philosophy of mathematics is to be replaced by metamathematics. 1  Formalism disconnects the history of mathematics from the philosophy of mathematics, since, according to the formalist concept of mathematics, there is no history of mathematics proper. Any formalist would basically agree with Russell’s ‘romantically’ put but seriously meant remark, according to which Boole’s Laws of Thought (1854) was ‘the first book ever written on mathematics’.2 Formalism denies the status of mathematics to most of what has been commonly understood to be mathematics, and can say nothing about its growth. None of the ‘creative’ periods and hardly any of the ‘critical’ periods of mathematical theories would be admitted into the formalist heaven, where mathematical theories dwell like the seraphim, purged of all the impurities of earthly uncertainty. Formalists, though, usually leave open a small back door for fallen angels: if it turns out that for some ‘mixtures of mathematics and something else’ we can find formal systems ‘which include them in a certain sense’, then they too may be admitted (Curry [1951], pp. 56–7). On those terms Newton had to wait four centuries until Peano, Russell, and Quine helped him into heaven by formalising the Calculus. Dirac is more fortunate: Schwartz saved his soul during his lifetime. Perhaps we should mention here the paradoxical plight of the metamathematician: by formalist, or even by deductivist, standards, he is not an honest mathematician. Dieudonné talks about ‘the absolute necessity imposed on any mathematician who cares for intellectual integrity’ (my italics) to present his reasonings in axiomatic form ([1939], p. 225). Under the present dominance of formalism, one is tempted to paraphrase Kant: the history of mathematics, lacking the guidance of philosophy, has become blind, while the philosophy of mathematics, turning its back on the most intriguing phenomena in the history of mathematics, has become empty. ‘Formalism’ is a bulwark of logical positivist philosophy. According to logical positivism, a statement is meaningful only if it is either ‘tautological’ or empirical. Since informal mathematics is neither ‘tautological’ nor empirical, it must be meaningless, sheer nonsense.3 2 Russell [1901]. The essay was republished as chapter 5 of Russell’s [1918], under the title ‘Mathematics and the Metaphysicians’. In the 1953 Penguin edition the quotation can be found on p. 74. In the preface of his [1918] Russell says of the essay: ’Its tone is partly explained by the fact that the editor begged me to make the article “as romantic as possible’’.’ 3 According to Turquette, Gödelian sentences are meaningless ([1950], p. 129). Turquette argues against Copi, who claims that since they are a priori truths but not analytic, they refute the analytic theory of a priori ([1949] and [1950]). Neither of them notices that the 2 proofs and refutations  The dogmas of logical positivism have been detrimental to the history and philosophy of mathematics. The purpose of these essays is to approach some problems of the methodology of mathematics. I use the word ‘methodology’ in a sense akin to Pólya’s and Bernays’ ‘heuristic’4 and Popper’s ‘logic of discovery’ or ‘situational logic’.5 The recent expropriation of the term ‘methodology of mathematics’ to serve as a synonym for ‘metamathematics’ has undoubtedly a formalist touch. It indicates that in formalist philosophy of mathematics there is no proper place for methodology qua logic of discovery.6 peculiar status of Gödelian sentences from this point of view is that these theorems are theorems of informal mathematics, and that in fact they are discussing the status of informal mathematics in a particular case. uses the term ‘deductive sciences’ explicitly as a shorthand for ‘formalised deductive sciences’. He says: ‘Formalised deductive disciplines form the field of research of metamathematics roughly in the same sense in which spatial entities form the field of research in geometry.’ This sensible formulation is given an intriguing imperialist twist in the second paper: ‘The deductive disciplines constitute the subject-matter of the methodology of the deductive sciences in much the same sense in which spatial entities constitute the subject-matter of geometry and animals that of zoology. Naturally not all deductive disciplines are presented in a form suitable for objects of scientific investigation. Those, for example, are not suitable which do not rest on a definite logical basis, have no precise rules of inference, and the theorems of which are formulated in the usually ambiguous and inexact terms of colloquial language – in a word those which are not formalised. Metamathematical investigations are confined in consequence to the discussion of formalised deductive disciplines.’ The innovation is that while the first formulation stated that the subject matter of metamathematics is the formalised deductive disciplines, the second formulation states that the subject-matter of metamathematics is confined to formalised deductive disciplines only because non-formalised deductive sciences are not suitable objects for scientific investigation at all. This implies that the pre-history of a formalised discipline cannot be the subject-matter of a scientific investigation – unlike the pre-history of a zoological species, which can be the subject-matter of a very scientific theory of evolution. Nobody will doubt that some problems about a mathematical theory can only be approached after it has been formalised, just as some problems about human beings (say concerning their anatomy) can only be approached after their death. But few will infer from this that human beings are ‘suitable for scientific investigation’ only when they are ‘presented in “dead” form’, and that biological investigations are confined in consequence to the discussion of dead human beings – although, I should not be surprised if some enthusiastic pupil of Vesalius in those glorious days of early anatomy, when the powerful new method of dissection emerged, had identified biology with the analysis of dead bodies. In the preface of his [1941] Tarski enlarges on his negative attitude towards the possibility of any sort of methodology other than formal systems: ‘A course in the methodology of empirical sciences . . . must be largely confined to evaluations and introduction 3  According to formalists, mathematics is identical with formalisedmathematics. But what can one discover in a formalised theory? Two sorts of things. First, one can discover the solution to problems which a suitably programmed Turing machine could solve in a finite time (such as: is a certain alleged proof a proof or not?). No mathematician is interested in following out the dreary mechanical ‘method’ prescribed by such decision procedures. Secondly, one can discover the solutions to problems (such as: is a certain formula in a non-decidable theory a theorem or not?), where one can be guided only by the ‘method’ of ’unregimented insight and good fortune’. Now this bleak alternative between the rationalism of a machine and the irrationalism of blind guessing does not hold for live mathematics:7 an investigation of informal mathematics will yield a rich situational logic for working mathematicians, a situational logic which is neither mechanical nor irrational, but which cannot be recognised and still less, stimulated, by the formalist philosophy. The history of mathematics and the logic of mathematical discovery, i.e. the phylogenesis and the ontogenesis of mathematical thought,8 cannot be developed without the criticism and ultimate rejection of formalism. But formalist philosophy of mathematics has very deep roots. It is the latest link in the long chain of dogmatist philosophies of mathematics. For more than two thousand years there has been an argument between dogmatists and sceptics. The dogmatists hold that – by the power of our human intellect and/or senses – we can attain truth and know that we criticisms of tentative gropings and unsuccessful efforts.’ The reason is that empirical sciences are unscientific: for Tarski defines a scientific theory ‘as a system of asserted statements arranged according to certain rules’ (ibid.). 7 One of the most dangerous vagaries of formalist philosophy is the habit of (1) stating something – rightly – about formal systems  (2) then saying that this applies to ‘mathematics‘ – this is again right if we accept the identification of mathematics and formal systems  (3) subsequently, with a surreptitious shift in meaning, using the term ‘mathematics’ in the ordinary sense. So Quine says ([1951], p. 87) that ‘this reflects the characteristic mathematical situation  the mathematician hits upon his proof by unregimented insight and good fortune, but afterwards other mathematicians can check his proof’. But often the checking of an ordinary (informal) proof is a very delicate enterprise, and to hit on a ‘mistake’ requires as much insight and luck as to hit on a proof: the discovery of ’mistakes’ in informal proofs may sometimes take decades – if not centuries. 8 Both H. Poincaré and G. Pólya propose to apply E. Haeckel’s ‘fundamental biogenetic law’ about ontogeny recapitulating phylogeny to mental development, in particular to mathematical mental development. (Poincaré [1908], p. 135, and Pólya [1962b].) To quote Poincaré: ‘Zoologists maintain that the embryonic development of an animal recapitulates in brief the whole history of its ancestors throughout geologic time. It seems it is the same in the development of minds . . . For this reason, the history of science should be our first guide’ (C. B. Halsted’s authorised translation, p. 437). 4 proofs and refutations  have attained it. The sceptics on the other hand either hold that we cannot attain the truth at all (unless with the help of mystical experience), or that we cannot know if we can attain it or that we have attained it. In this great debate, in which arguments are time and again brought up to date, mathematics has been the proud fortress of dogmatism. Whenever the mathematical dogmatism of the day got into a ‘crisis’, a new version once again provided genuine rigour and ultimate foundations, thereby restoring the image of authoritative, infallible, irrefutable mathematics, ‘the only Science that it has pleased God hitherto to bestow on mankind’ (Hobbes [1651], p. 15). Most sceptics resigned themselves to the impregnability of this stronghold of dogmatist epistemology.9 A challenge is now overdue. The core of this case-study will challenge mathematical formalism, but will not challenge directly the ultimate positions of mathematical dogmatism. Its modest aim is to elaborate the point that informal, quasiempirical, mathematics does not grow through a monotonous increase of the number of indubitably established theorems but through the incessant improvement of guesses by speculation and criticism, by the logic of proofs and refutations. Since, however, metamathematics is a paradigm of informal, quasi-empirical mathematics just now in rapid growth, the essay, by implication, will also challenge modern mathematical dogmatism. The student of recent history of metamathematics will recognise the patterns described here in his own field. The dialogue form should reflect the dialectic of the story  it is meant to contain a sort of rationally reconstructed or ‘distilled’ history. The real history will chime in in the footnotes, most of which are to be taken, therefore, as an organic part of the essay. 9 For a discussion of the rôle of mathematics in the dogmatist-sceptic controversy, cf. my [1962]. introduction 5  Chapter 1 B 1. A problem and a conjecture The dialogue takes place in an imaginary classroom. The class gets interested in a PROBLEM: is there a relation between the number of vertices V, the number of edges E and the number of faces F of polyhedra – particularly of regular polyhedra – analogous to the trivial relation between the number of vertices and edges of polygons, namely, that there are as many edges as vertices: V = E? This latter relation enables us to classify polygons according to the number of edges (or vertices): triangles, quadrangles, pentagons, etc. An analogous relation would help to classify polyhedra. After much trial and error they notice that for all regular polyhedra V � E + F = 2.1 Somebody guesses that this may apply for any polyhedron 1 First noticed by Euler [1758a]. His original problem was the classification of polyhedra, the difficulty of which was pointed out in the editorial summary: ‘While in plane geometry polygons (figurae rectilineae) could be classified very easily according to the number of their sides, which of course is always equal to the number of their angles, in stereometry the classification of polyhedra (corpora hedris planis inclusa) represents a much more difficult problem, since the number of faces alone is insufficient for this purpose.’ The key to Euler’s result was just the invention of the concepts of vertex and edge: it was he who first pointed out that besides the number of faces the number of points and lines on the surface of the polyhedron determines its (topological) character. It is interesting that on the one hand he was eager to stress the novelty of his conceptual framework, and that he had to invent the term ‘acies’ (edge) instead of the old ‘latus’ (side), since latus was a polygonal concept while he wanted a polyhedral one, on the other hand he still retained the term ‘angulus solidus’ (solid angle) for his point-like vertices. It has been recently generally accepted that the priority of the result goes to Descartes. The ground for this claim is a manuscript of Descartes [c. 1639] copied by Leibniz in Paris from the original in 1675–6, and rediscovered and published by Foucher de Careil in 1860. The priority should not be granted to Descartes without a minor qualification. It is true that Descartes states that the number of plane angles equals 2ϕ +2α-4 where byϕ hemeans the number of faces and by α the number of solid angles. It is also true that he states that there are twice as many plane angles as edges (latera). The conjunction of these two statements of course yields the Euler formula. But Descartes did not see the point of doing so, since he still thought in terms of angles (plane and solid) and faces, and did not make a conscious revolutionary change to the concepts of 0-dimensional vertices, 1-dimensional edges and 2-dimensional faces as a necessary and sufficient basis for the full topological characterisation of polyhedra. 6  whatsoever. Others try to falsify this conjecture, try to test it in many different ways – it holds good. The results corroborate the conjecture, and suggest that it could be proved. It is at this point – after the stages problem and conjecture – that we enter the classroom.2 The teacher is just going to offer a proof. 2. A proof teacher: In our last lesson we arrived at a conjecture concerning polyhedra, namely, that for all polyhedra V � E + F = 2, where V is the number of vertices, E the number of edges and F the number of faces. We tested it by various methods. But we haven’t yet proved it. Has anybody found a proof? pupil sigma: ‘I for one have to admit that I have not yet been able to devise a strict proof of this theorem . . . As however the truth of it has been established in so many cases, there can be no doubt that it holds good for any solid. Thus the proposition seems to be satisfactorily demonstrated.’3 But if you have a proof, please do present it. teacher: In fact I have one. It consists of the following thoughtexperiment. Step 1: Let us imagine the polyhedron to be hollow, with a surface made of thin rubber. If we cut out one of the faces, we can stretch the remaining surface flat on the blackboard, without tearing it. The faces and edges will be deformed, the edges may become curved, but V and E will not alter, so that if and only if V � E + F = 2 for the original polyhedron, V � E + F = 1 for this flat network – remember that we have removed one face. (Fig. 1 shows the flat network for the case of a cube.) Step 2:Now we triangulate our map – it does indeed look like a geographical map. We draw (possibly curvilinear) diagonals in those (possibly curvilinear) polygons which are not already (possibly curvilinear) triangles. By drawing each diagonal we increase both E and F by one, so that the total V � E + F will not be altered (fig. 2). 2 Euler tested the conjecture quite thoroughly for consequences. He checked it for prisms, pyramids and so on. He could have added that the proposition that there are only five regular bodies is also a consequence of the conjecture. Another suspected consequence is the hitherto corroborated proposition that four colours are sufficient to colour a map. The phase of conjecturing and testing in the case of V � E + F = 2 is discussed in Pólya ([1954], vol. 1, the first five sections of the third chapter, pp. 35–41). Pólya stopped here, and does not deal with the phase of proving – though of course he points out the need for a heuristic of ’problems to prove’ ([1945], p. 144). Our discussion starts where Pólya stops. a proof 7  Step 3: From the triangulated network we now remove the triangles one by one. To remove a triangle we either remove an edge – upon which one face and one edge disappear (fig. 3(a)), or we remove two edges and a vertex-uponwhich one face, two edges and onevertex disappear (fig. 3(b)). Thus if V � E + F = 1 before a triangle is removed, it remains so after the triangle is removed. At the end of this procedure we get a single triangle. For this V � E + F = 1 holds true. Thus we have proved our conjecture.4 Fig. 1. Fig. 2. 4 This proof-idea stems from Cauchy [1813a]. 8 proofs and refutations  pupil delta: You should now call it a theorem. There is nothing conjectural about it any more.5 pupil alpha: I wonder. I see that this experiment can be performed for a cube or for a tetrahedron, but how am I to know that it can be performed for any polyhedron? For instance, are you sure, Sir, that any polyhedron, after having a face removed, can be stretched flat on the blackboard? I am dubious about your first step. pupil beta: Are you sure that in triangulating the map one will always get a new face for any new edge? I am dubious about your second step. pupil gamma: Are you sure that there are only two alternatives – the disappearance of one edge or else of two edges and a vertex – when one drops the triangles one by one? Are you even sure that one is left with a single triangle at the end of this process? I am dubious about your third step.6 teacher: Of course I am not sure. alpha: But then we are worse off than before! Instead of one conjecture we now have at least three! And this you call a ‘proof’! teacher: I admit that the traditional name ‘proof’ for this thought- experiment may rightly be considered a bit misleading. I do not think that it establishes the truth of the conjecture. Fig. 3. 6 The class is a rather advanced one. To Cauchy, Poinsot, and to many other excellent mathematicians of the nineteenth century these questions did not occur. a proof 9  delta: What does it do then? What do you think a mathematical proof proves? teacher: This is a subtle question which we shall try to answer later. Till then I propose to retain the time-honoured technical term ‘proof’ for a thought-experiment – or ‘quasi-experiment’ – which suggests a decomposition of the original conjecture into subconjectures or lemmas, thus embedding it in a possibly quite distant body of knowledge. Our ‘proof’, for instance, has embedded the original conjecture – about crystals, or, say, solids – in the theory of rubber sheets. Descartes or Euler, the fathers of the original conjecture, certainly did not even dream of this.7 3. Criticism of the proof by counterexamples which are local but not global teacher: This decomposition of the conjecture suggested by the proof opens new vistas for testing. The decomposition deploys the conjecture 7 Thought-experiment (deiknymi) was the most ancient pattern of mathematical proof. It prevailed in pre-Euclidean Greek mathematics (cf. Á. Szabó [1958]). That conjectures (or theorems) precede proofs in the heuristic order was a commonplace for ancient mathematicians. This followed from the heuristic precedence of ‘analysis’ over ‘synthesis’. (For an excellent discussion see Robinson [1936].) According to Proclus, ‘. . . it is . . . necessary to knowbeforehandwhat is sought’ (Heath [1925], 1, p. 129). ‘They said that a theorem is that which is proposed with a view to the demonstration of the very thing proposed’ – says Pappus (ibid. 1, p. 10). The Greeks did not think much of propositions which they happened to hit upon in the deductive direction without having previously guessed them. They called them porisms, corollaries, incidental results springing from the proof of a theoremor the solution of a problem, results not directly sought but appearing, as itwere, by chance,without any additional labour, and constituting, as Proclus says, a sort of windfall (ermaion) or bonus (kerdos) (ibid. 1, p. 278). We read in the editorial summary to Euler [1756–7] that arithmetical theorems ‘were discovered long before their truth has been confirmed by rigid demonstrations’. Both the Editor and Euler use for this process of discovery the modern term ‘induction’ instead of the ancient ‘analysis’ (ibid.). The heuristic precedence of the result over the argument, of the theorem over the proof, has deep roots in mathematical folklore. Let us quote some variations on a familiar theme: Chrysippus is said to have written to Cleanthes: ‘Just send me the theorems, then I shall find the proofs’ (cf. Diogenes Laertius [c. 200], VII. 179). Gauss is said to have complained: ‘I have had my results for a long time  but I do not yet know how I am to arrive at them’ (cf. Arber [1945], p. 47), and Riemann: ‘If only I had the theorems! Then I should find the proofs easily enough.’ (Cf. Hölder [1924], p. 487.) Pólya stresses: ‘You have to guess a mathematical theorem before you prove it’ ([1954], vol. 1, p. vi). The term ’quasi-experiment’ is from the above-mentioned editorial summary to Euler [1753]. According to the Editor: ‘As we must refer the numbers to the pure intellect alone, we can hardly understand how observations and quasi-experiments can be of use in investigating the nature of the numbers. Yet, in fact, as I shall show here with very good reasons, the properties of the numbers known today have been mostly discovered by observation . . .’ (Pólya’s translation  in his [1954], 1, p. 3 he mistakenly attributes the quotation to Euler). 10 proofs and refutations  on a wider front, so that our criticism has more targets. We now have at least three opportunities for counterexamples instead of one! gamma: I have already expressed my dislike of your third lemma (viz. that in removing triangles from the network which resulted from the stretching and subsequent triangulation, we have only two possibilities: either we remove an edge or we remove two edges and a vertex). I suspect that other patterns may emerge when removing a triang", "filename": "Imre Lakatos - Proofs and Refutations.pdf", "meta": {"bla": "huahaua"}}