{"text": "The Brain-shaped Mind : What the Brain Can Tell Us About the Mind  The Brain-Shaped Mind:  What the Brain Can Tell  Us about the Mind Naomi Goldblum Cambridge University Press The Brain-Shaped Mind What the Brain Can Tell Us about the Mind Will brain scientists ever be able to read our minds? Why are some things harder to remember than others? Based on recent brain research and neural network modeling, The Brain-Shaped Mind addresses these and other questions, and provides a clear account of how the structure of the brain influences the workings of the mind. Neuroscientists are now learning about our minds by examining how the neurons in the brain are connected with one another and the surrounding environment. This book explores how neural networks enable us to recognize objects and learn new things, and what happens when things go wrong. The reader is taken on a fascinating journey into what is arguably one of the most complicated and remarkable aspects of our lives. Born in New York, N a o m i  G o l d b l u m originally studied mathematics at Yeshiva University. She later moved to Israel where, at the Hebrew University, she extended her interests to the field of psychology. Her doctorate was entitled “A psycholinguistic study of metaphor.” Naomi Goldblum is now a lecturer in psychology at Bar-Ilan University, where she specializes in cognitive psychology, in particular psycholinguistics and the processes involved in creative endeavors. The Brain-Shaped Mind What the Brain Can Tell Us about the Mind Naomi Goldblum Illustrated by Shifra Glick http://www.cambridge.org First published in printed format  Naomi Goldblum 2004 2001 (netLibrary) © Contents  Preface vi Figure permissions and acknowledgments viii 1 Introduction 1 2 What the brain cannot tell us about the mind 12 3 How neurons form networks 21 4 Theories and models of how the mind functions 30 5 What are connectionist networks? 40 6 How our networks learn 54 7 Connecting the networks: how different things are related 66 8 Evidence for connectionist models 75 9 Two different types of memory 87 10 Coping with disaster 95 11 Practical implications 108 12 Criticism of connectionist theory 116 Annotated references and suggested readings 129 Index 135 Preface I first heard of connectionism in 1982, when I began studying cognitive psychology. I had read Edward deBono’s pioneering work, The Mechanism of Mind, twenty years earlier, and I had found it fascinating, but at that time the term “connectionism” had not yet been invented. When I learned about semantic networks, in which concepts were represented as points connected by links of various sorts, it seemed to me that concepts were much too rich to be described as mere points. Instead, I imagined them as long tangled threads meandering around in several dimensions, and I imagined the links between the concepts as the points where these threads met. When I described this image to my cognitive psychology professor, Benny Shanon, he said, “That’s the new theory everyone is talking about — it’s called connectionism.” He had just ordered the brand-new book on the topic, Hinton and Anderson’s collection of papers, Parallel Models of Associative Memory, and was waiting for it to arrive. When the book came we spent a lot of time arguing over who should get to read it first. Each of us would take it home for a week or two and try to read a few pages, then give it to the other for the next week or two. On the one hand, the new ideas were fascinating, but on the other, they were very difficult to grasp. Over the years since then I have read a great many papers on connectionism, but none of them was easy enough to recommend to a beginner. Even the few “introductory” textbooks that have been published on the topic require a great deal of prior knowledge, mainly of advanced mathematics and computer programming. After searching in vain for a clear, simple introduction to this difficult topic, I finally decided that I would have to write it myself. This book is the result of that decision. Originally I thought of connectionism as a theory of the “mind— [vi] brain,” as if mind and brain were simply two sides of one coin. After long discussions with my philosophy professor, Avishai Margalit, I began to realize that mind and brain must be thought of as two separate entities, no matter how closely they may be entwined. The mind is not just an aspect of the brain, but a product of the interaction between the human organism and the environment. Still, the brain is a most important factor in shaping the mind, and so understanding the way this shaping takes place is of utmost significance in understanding human thought processes. The present book is thus devoted to this task. I would like to thank my psycholinguistics professor I.M. Schlesinger and my research methods professors Maya Bar-Hillel, Ruma Falk and Yaakov Schul, as well as the two abovementioned professors, for teaching me how to think critically about both experimental results and theoretical pronouncements. My thanks also go to Benny Shanon and philosophy professor Avital Wohlman for comments on the manuscript of this book. My daughter, Shifra Glick, not only read the manuscript but also drew the cartoons. I greatly appreciate her contribution. Various other family members and friends supported me throughout the writing of the book, and I thank them all. Naomi Goldblum Jerusalem Preface vii Figure permissions and acknowledgments  [viii] 1 Introduction How is the brain related to the mind? Do our minds work like computers? Can science’s new knowledge about the brain tell us anything of importance about the way our minds work? How can a three-pound mass of tiny jelly-like blobs connected by vast numbers of microscopic filaments be the basis of all our thoughts, feelings, memories, hopes, intentions, knowledge? Will all the new knowledge scientists are gaining about our brains enable them to read our minds with electronic devices? There is a new way of thinking about the mind and the brain which takes it for granted that the human mind is inseparable from the human body. Since the evidence indicates that the center of our mental activities is the brain, the advocates of this approach try to understand the functioning of the mind on the basis of what we know about the functioning of the brain. This new scientific paradigm has led to the construction of new theories and models of the mind which are variously known as connectionist theories, or neural network models, or theories of parallel distributed processing (PDP). Although some of the ideas on which these new theories are based have been around for over a century, the detailed working out of these models began only in the 1970s. These new ideas are called connectionist theories because they claim that our mental processes and capacities – how we perceive what is out there in the world, how our knowledge about these things is organized, how we combine all this information to draw new conclusions, how we decide what to do next in order to get what we want — can be explained on the basis of what is known about the multiple interconnections between the neurons, or nerve cells, in the brain. They are called neural network models because they present detailed computer models of how interconnected units can work together to form networks analogous to those in [1] the brain. And they are called theories of parallel distributed processing because they claim that a variety of mental operations are carried out at the same time, in parallel, and that these operations are distributed over large numbers of units rather than occurring within individual units separately. Each of these concepts will be explained in detail shortly, but first I would like to say a little more about the relation between the mind and the brain. How are the mind and the brain related? The connectionist view is based on the idea that there can be different levels of explanation for talking about the same thing. The concept of levels of explanation is well known in such disciplines as physics. For example, there is a difference between the level of our ordinary talk about tables and the atomic level of description. In our ordinary way of talking, a table is a solid object that entirely fills the space it is in and can have a smooth surface with no bumps on it. On the atomic level, in contrast, there is a great deal of empty space between the atoms that make up the table, and since these atoms are constantly jiggling around, there is no clear boundary between the top of the table and the air above it. Similarly, there are both a mental and a physical level of explanation for talking about human mental functions. When we use the word “mind,” we are on the mental level of explanation. It is on this level that we talk about seeing a sunset, remembering our trip to the Grand Canyon, knowing that a canary is a bird, and knowing how to tie our shoelaces. When we use the word “brain,” we are on the physical level of explanation. On this level we can talk about individual nerve cells firing when they are activated by other nerve cells, the arrangement of nerve cells into columns in certain parts of the cortex, and the fibers that link one part of the cortex with another. But when we talk about red and blue color receptors being activated in the visual cortex, or the supplementary motor cortex sending electrical impulses to the primary motor cortex so that the muscles in our hands will contract in a particular way in order to cross one end of the shoelace over the other, we are combining two different levels of explanation of the same event — the mental and the physical, the mind and the brain. “Red” and “blue” are on the mental level of explanation, “receptors” on the physical level. In the field of perception almost all scientists use the physical level of explanation in trying to understand the mental one. At least part of the explanation of the way we see requires an understanding of how the brain processes the signals coming in from our eyes. In contrast, many scientists working in the field of the higher mental processes — cognitive scientists, who study such topics as memory, language processes and the organization of concepts — claim that the mental level of explanation can proceed independently of the physical level. Most of them agree that the mind is inseparable from the brain, but they do not believe that it is necessary to ground the mental level of explanation in the physical one. Some cognitive scientists also claim that mental explanations of cognitive processes should be the same whether the processes are taking place in a human or a computer, for example  these researchers are often called students of artificial intelligence, or AI for short. In contrast, connectionists believe that it is helpful to make use of our knowledge about the physical workings of the brain in our explanations of cognitive processes. The connectionist level of explanation may be thought of as a third level, intermediate between the mental and the physical ones. It is not identical to the physical level because it does not talk about individual nerve cells firing and is not concerned with the physical layout of the various parts of the brain. It is not identical to the mental level because it does not talk about our concepts, say, as abstract things that could be found in any entity that is able to process information. Rather, connectionists propose a description of mental processes that takes account of the physical structure of the brain and its interactions with the environment. As we shall see throughout the book, they try to explain how our concepts are formed, how they are related, and how they are used by looking at how the neurons in the brain are connected with one another and with the surrounding environment. Connectionists’ explanations of mental processes are thus based on what we know about brain processes in much the same way as physicists’ explanations of the different properties of wood and glass tables are based on the atomic composition of these materials. How are connectionist explanations different from other explanations of mental processes? The key to the difference between connectionist explanations and those given by other cognitive scientists, some of whom like to call themselves “classical,” lies in the words “parallel” and “distributed” of the expression “parallel distributed processing.” Classical explanations of mental Introduction 3 processes describe them as taking place serially, one after the other. A good example is what is often called “memory search.” When you actively and consciously search for a given memory, say, where you left your credit card when you notice that it is missing, you do a serial search: “I started out at the bookstore, then I went to the record shop, then to the video rental. Since I was able to use my card in all these places, I must have left it at the last one — the video rental.” This is the way conscious memory searches take place, because we can focus on only one thing at a time, so we have to do our thinking serially. But most of the time we seem to remember things without any conscious search of our memory. You see an unusual fruit, try to think of its name, and eventually “guava” just pops into your mind without any awareness of a search. Classical descriptions of this sort of remembering are modeled on conscious memory searches, due to an implicit assumption that the two types of remembering are similar. According to the classical theory, what happens when you see this unusual fruit is that you unconsciously go through a list of all the fruits you know and check each one to see if it matches the one you are looking at. This would have to occur very fast, of course, since “guava” pops into your mind fairly quickly, but in theory there could be a series of very fast processes. In contrast, connectionists claim that the names of the fruits you know are all activated to some degree when you see the guava. The more common fruits are activated more quickly, so it takes a while for the sight of the guava in front of you to make the word “guava” come to the forefront, but eventually it does. This is called “parallel processing” because the names of all the fruits are activated at the same time, in parallel, and no serial search is needed. This is explained in detail in the central chapter of the book, Chapter 5, “What are connectionist networks?” The other important difference is embodied in the word “distributed.” In classical explanations every concept, including “guava,” is stored in one particular place in the mind. “Guava” is associated with “tropical”, “fruit,” and its various other features, but these are separate concepts, as I explain in Chapter 4, “Theories and models of how the mind functions.” Connectionist explanations, in contrast, claim that every concept is made up of many parts, so that “tropical” and “fruit” are actually part of the concept “guava” rather than just being associated with it. This idea is explained in detail in Chapter 5. These different modes of explanation have had different degrees of success in explaining different sorts of mental functions. The degree of success is often judged by how well the mental process can be modeled by a computer program, as I explain in Chapter 4. Classical cognitive scientists have had great success in making computer models of the sort of things human beings generally find difficult, such as playing chess, solving mathematical problems, diagnosing rare diseases, or finding flaws in complicated machinery. These are processes that we often know how to describe, things we do with a good deal of conscious awareness of how we do them. Thus experts in these areas could tell classical computer scientists how they did these things, and the computer people could program their computers to do them just as well — or even better. But when the computer scientists tried to get their digital computers to do things humans do easily — such as making sense of simple stories with obvious details left out, or looking at a two-dimensional picture and seeing individual three-dimensional objects in it, or carrying on a sensible conversation — they had a very difficult time. Part of the reason is that we don’t really know how we do these things, since most of the work is done outside conscious awareness. Another part of the reason is that neither the brain nor the mind works like a digital computer. The brain isn’t programmed by anyone  it grows and develops the abilities it has. The brain does come equipped with its basic structure, but this structure is constantly being changed by our experience in the world. This is not like changing a program on a computer, where the “hardware” remains the same but the “software” changes. In the brain there is no distinction between “hardware” and “software.” Every change is a change of hardware. Every time we learn something new, every time we see a new scene, hear a new sentence or tune, touch a new fabric, taste a new dessert, smell a new flower, the connections between the neurons in our brain undergo some changes, and this constitutes a change in what we know — a change in our mind. Connectionists also use computer models, but they try to make them work in a parallel distributed way. This involves trying to make computers be more like the brain instead of assuming that the brain works like a computer. Chapter 8 describes some models of this sort. Is the mind in any way like the Internet? Instead of comparing the mind to a computer, it might be more useful to compare it to the Internet. I am not saying that the mind is actually very similar to the Internet, but only that there are some interesting aspects of Introduction 5 the mind that can be appreciated more easily by comparing them with properties of the Internet. One of the most interesting properties of the Internet is the fact that it is not hierarchical — it is not controlled at the top by anyone who tells everyone else what to do. Instead, every part of the Internet can communicate with every other part, sometimes directly and sometimes through one or a few intermediate stations. Connectionist theories claim that the brain, and therefore the mind, works this way too. The various parts of the mind — its individual networks — are all interconnected in a vast web, each part of which can communicate with any other part. In most of the book I will be describing the way the individual networks operate and how certain ones communicate with other ones, but it is important to remember that the flow of information can go in all directions. There is no “master” operator — no “DOS” — that determines where the information should go or what should be done with it when it gets there. The mind does indeed have what is often called an “executive function,” which is responsible for such activities as planning ahead. But although this function is generally in charge, it too can be overridden. My “executive function” may have determined that I will read a chapter of my physics textbook this evening, but if my external senses tell the sensory parts of my brain that the waterpipes in my kitchen have just burst, or if my internal sensors tell the proprioceptive parts of my brain — the parts that monitor internal states — that I am intensely thirsty, or if the person I love tells me that we need some time together, I may temporarily abandon my carefully thought-out study plans. And in case you are thinking that there is some “super-executive” function which decides that the flooding emergency is more important than studying physics, just think of the situation where you stop studying in order to watch a silly comedy on television. Different parts of your mind are in conflict here, and which one wins is not decided by some “super-judge”  the winner is simply the one that manages to gain the upper hand at that particular moment. Thus the “executive function” too is just one part of the mind among many, all of which talk to each other incessantly and jointly direct our actions. This is the most important way in which the mind is like the Internet. What about consciousness? The idea that there is no hierarchy in the mind is very similar to a notion expounded by Daniel Dennett in his book Consciousness Explained. In this book Dennett demonstrates that there is no one part of the brain in which consciousness is “located,” because all the various parts work together to produce our conscious experiences. The connectionist theories I describe in the present book fit in well with Dennett’s ideas. However, they center on specific areas of the brain, how they are organized internally, and how they interact with other specific areas. They have not yet reached the point where they can come to grips with the interplay of processes occurring in many parts of the brain that probably underlies consciousness. Therefore I will not be discussing the topic of consciousness in this book. It is very likely, nevertheless, that someday connectionism will have something interesting to say about consciousness, since I do not think that it is some mysterious entity that cannot in principle be explained by science. I am convinced that consciousness is embodied primarily in brain function, just like all other aspects of the mind. In fact, there are a number of possible scenarios that I can envisage if connectionists ever do try to explain consciousness. They may end up agreeing with Dennett that the concept of consciousness is not a particularly useful one for understanding the mind. They may come to the conclusion that it is such a complicated function of all the networks acting together that it is too difficult to explain. They may find out that it is grounded in a different part of the brain from the ones that hold the knowledge networks to be described in the following chapters, and so operates in a different way. But whatever may turn out to be the case for consciousness, I find that it is possible to understand a great many things about how our minds function without considering it. I shall therefore put aside the problem of consciousness in the present book. What about the emotions? The mind is sometimes considered to include the emotions as well as the intellect. In this book I will be discussing only the intellect, not the emotions. I will use the word “mind” rather than “intellect” because “mind” is the word that people generally use when they are speaking about such human functions as classifying things into categories, speaking, understanding speech, solving problems and the like. Introduction 7 It is possible that connectionist theory may turn out to apply to the emotions as well as the intellect, but it is also possible that it may not apply to the emotions. The reason for this is rooted in the structure of the brain. The part of the brain that is organized into neural networks is the cortex — the deeply folded outer part — which is primarily responsible for perception, thinking and the planning of action. Therefore it makes sense to use the properties of these neural networks to try to understand the mental functions that involve mainly the cortex. The emotions, in contrast, involve primarily the inner structures of the brain, which are not organized in quite the same way. Thus rather different models may be needed to describe how the emotions work. Perhaps network theory will someday be able to shed light on the human emotions as well as the human intellect, but it has not yet done so. The discussions in this book will therefore be limited to the intellectual functions of the mind. What questions does this book try to answer? Some of the questions about our mental processes that connectionist theories offer answers to, which I discuss in this book, are listed below. Will scientists ever be able to read our minds? If we understand the brain completely, will we be able to know what other people are thinking by looking inside their brain? In what ways are the minds of different people similar, and in what ways are they different? These questions are discussed in Chapter 2. How is the brain put together so as to serve as the basis for our mental functions? What are the physical connections that allow us to form mental associations between the different things we know about the world? What are the physical bases of the changes in our minds that constitute learning? These are some of the questions discussed in Chapter 3. Chapter 4 discusses the following questions: What is the difference between a theory and a model? What models were used to explain the organization of our knowledge before connectionist theories were developed? How can computers help us understand the way our minds work even though the mind doesn’t work like a computer? The essence of connectionist theory is discussed in Chapter 5, with emphasis on the following questions: How do we put things into categories? How do we know, for example, that the animal we are looking at is a dog and not a cat? How are all the things we know about various animals connected with each other, so that we can instantly produce a long list of properties of any animal, or provide the name of the animal from a description of it? Another central problem is how these connections form in the first place. How do children learn the difference between a cat and a dog? Why do some children call all four-legged animals “dog” or “horse” at first, although they never call a bird “horse”? How do they later learn to distinguish between different types of dogs, and even between individual dogs? These are some of the questions addressed in Chapter 6. Of course, not all our mental associations are between objects and their names or physical properties. We also know that various things are related, such as mothers and fathers, or salt and pepper, or even properties of things, such as high and low, or sweet and sour. But how do we know in what way these things are related? How do we know that a wolfhound is a kind of dog rather than a kind of wolf? Why do we say “dog” and not “tiger” when we are asked for a word associated with “cat,” even though cats and tigers are more closely related than cats and dogs? These questions are discussed in Chapter 7. What sort of experimental evidence is there that the models discussed in this book actually describe what goes on in the human mind? Chapter 8 describes some of this evidence, including computer models of how children learn to talk and how they learn the past tenses of verbs. Chapter 9 discusses the difference between things we remember for a long time and things we remember for only a little while. For example, how do we know that today we had eggs for breakfast, even though we usually have cereal, and why is it that next year we will still remember that we had cereal for breakfast most of the time this year, but we will not remember that we had eggs today? How do we remember before we go to the bank that we have to go to the bank this morning, yet instantly afterwards remember that we already performed this errand? All the questions so far have involved the normal functioning of the mind in the intact brain. What happens if this functioning is disrupted by damage to the brain, such as that caused by strokes, head injuries or degenerative diseases like Alzheimer’s? Chapter 10 discusses the different sorts of dysfunction associated with each of these causes and the prospects for regaining normal mental functioning in certain cases even if the brain damage itself cannot be repaired. Is there any way we can use all this knowledge to improve our mental functioning in our daily lives? Can it help us study better, or teach others Introduction 9 more effectively, or solve our personal problems? These and other practical implications of connectionist theory are discussed in Chapter 11. Neural network models are still fairly speculative at this point. Although the experimental evidence supports the theory that the brain and the mind work in this parallel distributed manner, the evidence that the mind works this way is rather less certain than the evidence with regard to the brain. As a result, there has been much criticism of connectionist theory, particularly by people who advocate other theories about mental functioning that are less closely tied to the workings of the brain. A sampling of these criticisms is presented in Chapter 12, together with replies that have been offered by researchers in connectionist theory. Despite the fact that connectionism has its critics, it does reflect one of the most prevalent ways of thinking about the mind at the present time. In my discussion of what the models imply about how the mind works, I will therefore assume that they are true, and present their exciting implications by saying simply that this is what our minds do, rather than continually repeating that this is what the models say that our minds do. In essence, although I describe a fairly simple neural network model in some detail, my discussion of this model is not meant to be an end in itself. I see it, rather, as a way of showing how our developing understanding of how the brain works can help us understand some aspects of how the mind works as well. Brain processes are only one of the forces that shape the mind — it is also shaped by input from the environment, both physical and social. Describing how these two types of forces interact requires another book entirely. I have tried to keep the descriptions in this book clear and the explanations simple, without losing sight of the essential points of this complex subject. I hope you will enjoy this journey into what is not only the most complex but, for me at least, also the most fascinating object in the universe. Introduction 11 2 What the brain cannot tell us about the mind Why should we base our theories about the mind on our knowledge of how the brain functions? Why shouldn’t we study the mind as philosophers and scientists did for centuries, by introspecting to find out how we ourselves think and then asking other people questions to find out how they think? Or if we want to be more scientific, and we can figure out how to make a computer do what human beings do, why not assume that the way the computer does it is the way humans do it too? One reason is that there is a very great difference between our ability to know what we are thinking and our ability to understand how this thinking takes place. We are aware mainly of the contents of our thoughts, because this is the knowledge we need in order to be able to function. I need to know that the object I am looking at is an apple in order to know that I should pick it and eat it rather than the leaf next to it. I do not need to know how I recognize it as an apple in order to eat it and be nourished. Our consciousness has therefore evolved to be aware of what we are thinking, but not of how we go from one thought to another, or how we go from a perception to a thought, or from a thought to an action. But our minds at some point, perhaps at the time of the Greek philosophers, began to consider the way they themselves work. As human beings, we cannot be satisfied with just knowing facts about the world “outside” ourselves. We want to understand how we think, how we come to know what we know. The world “inside” our heads seems very different from the world “outside,” and we long to find out how it operates. But since we are not built to be able to get at this knowledge directly, we have sought all sorts of indirect ways of finding it out. [12] Dualists and monists Many philosophers — most notably Descartes — have been so impressed by the differences between what we sense when we observe the “outside” world and what we sense when we turn “inward” to discover what is in our minds that they are convinced that the “outer” and the “inner” constitute two totally separate “worlds.” This is the dualist approach — the belief that mind and body are two totally different aspects of existence. Dualists believe that since the brain is a physical entity it has nothing to teach us about the nonphysical mind. And because most of them do not distinguish between the contents of our thoughts and the processes of our thinking, they believe nothing we can learn about the brain will ever be able to explain how our minds work. Monists, on the other hand, believe that the mind and the brain are one and the same, looked at from two different aspects, so that advances in the study of the brain will eventually teach us all we need to know about the workings of the mind. Many of them also do not make the distinction between the contents of our thoughts and the processes of our thinking, and they believe that there is nothing about the mind that would remain unknown if we knew all there was to know about the brain. To me, however, this distinction seems crucial. I believe that we can learn a great deal about how our minds work, about the processes of our thinking, by studying the workings of the brain. The contents of our minds, on the other hand, will always need to be studied separately. In other words, while the mental level of explanation of our cognitive processes can usefully be anchored in the physical level of explanation, there is no point in trying to explain our particular pieces of knowledge or belief in this way. I will now try to make this distinction clear. The difference between process and content What we can learn about the mind from studying the brain is how the mind operates, in the sense of how it processes information. Scientists are now learning more and more about the way neurons send information to one another, the way they are organized into networks, the way these networks incorporate new information and the way they make use of the information they already have. This new knowledge about the brain can be used for building models of how we recognize people and things, how we classify things into categories, how we learn to do things we couldn’t What the brain cannot tell us about the mind 13 do before, how we learn to speak and later to read, and how we act on the basis of what we believe and what we want. What we cannot learn from studying the brain is what information there is in the mind — what you or anyone else is thinking at any particular moment, or what knowledge you or anyone else possesses in general. The rest of this book is devoted to those aspects of the mind that I believe we can understand better by using our knowledge of how the brain works. In this chapter I explain why I nevertheless believe that no one will ever be able to find out what you are thinking or what you know by finding out what state your brain is in, no matter how much we learn about the brain and how well we are able to monitor what your brain is doing. Token—token identity The particular belief that I hold about the relation between the mind and the brain is a sort of monism, since I believe that the mind is inseparable from the brain. The sort of monism I accept is based on the difference between types and tokens. For example, a cat is a type of animal, while an individual cat — say, your pet Lucky — is a token of this type. Some facts are true about cats in general, while others are true only about Lucky. The facts about cats in general can be considered scientific laws about cats — for example, “All cats have fur.” Facts about a particular cat — say, that Lucky wears a purple ribbon with her name printed on it in yellow letters — do not have the status of laws. What does this distinction between types and tokens have to do with the mind and the brain? It marks the difference between two ways of thinking about the relation between mind and brain. One of these, called the “type identity thesis,” claims that this relation can be described in terms of general laws. In other words, for every type of mental event — all stabbing pains in the left big toe, all thoughts that the grass is yellow, all intentions to go to Alaska, all wishes to be a millionaire — there is a particular type of brain state or brain process that corresponds to it in every person who is experiencing this type of mental event. This means that the mind can be “reduced” to the brain — that is, once the brain has been described in physical terms we will know everything there is to know about the mind. A different way of thinking about the relation between mind and brain is called the “token identity thesis.” Although the advocates of this thesis also believe that the brain is the basis substrate of the mind, they do not agree that each type of mental event corresponds to a particular type of brain state. What they claim, instead, is that there is a correspondence between tokens of mental states and tokens of brain states — that every time we think or feel or sense or want something there is some process occurring in our brain. In other words, when I see a red square and you see the same red square, neurons are activated in the visual areas of my brain and neurons are also activated in the visual areas of your brain. However, the neurons firing in my brain when I see a red square are probably not the same as the ones that are firing in your brain, in the sense of “same” that we use when we say that if I am typing the word “red” on my PC and you are typing the word “red” on your PC with an identical keyboard we are both depressing the same keys in the same order. Similarly, if I am thinking that Arafat needs a shave and you are thinking that Arafat needs a shave, it is most unlikely that the neurons activated in my brain are the same as the ones that are activated in yours. Thus the correspondence between mind and brain involves only tokens, not types. Why no brain-scanning machine will ever be able to read minds This is why I believe that there is no need to worry that someday scientists will be able to find out what we are thinking by hooking us up to machines that can tell them which neurons are active in our brains. There are, to be sure, machines that perform PET scans, which can tell what sort of processes are going on in our brains. These machines produce pictures that show in vivid color which parts of our brains are most active when we are performing a mental calculation or watching a movie or listening intently to our favorite music. Then why am I so certain that further scientific progress won’t enable us to pick out the exact neurons that are active when we are thinking that “2+2=4” or watching Casablanca or listening to the Beatles’ rendition of “Yesterday”? To explain why I am so sure that this will never happen, I will detail my reasons for believing that the neurons that are active in my brain when I am thinking that “2+2=4” are not the same as the ones that are active in yours when you are thinking the same thing. If this is the case, then it is enough to ensure that no one will be able to “read your mind” by “reading your brain.” Let’s assume for the sake of the argument that scientists will someday be able to pick out the exact neurons that are firing What the brain cannot tell us about the mind 15 in my brain when I am thinking that “2+2=4” or when I am seeing a red square or when I am intending to get some chocolate ice cream out of the freezer. But if the neurons that are firing in my brain when I am thinking that “2+2=4” are not the same as the ones that are active in yours when you are thinking the same thing, then it won’t do the scientists any good to know which ones are firing in my brain, because even if they could see the “very same” neurons firing in your brain — that is, if they could find neurons active in exactly the same physical location in your brain as in mine — they would not be able to deduce that you are also thinking that “2+2=4.” Although they might be able to deduce that you are thinking", "filename": "Naomi Goldblum, Shifra Glick - The brain-shaped mind_ what the brain can tell us about the mind-Cambridge University Press (2001).pdf", "meta": {"bla": "huahaua"}}