{"text": "Microsoft Word - Document3  P. F. STRAWSON:   FREEDOM AND RESENTMENT       1. Some philosophers say they do not know what the thesis of determinism is. Others say,  or imply, that they do know what it is. Of these, some—the pessimists perhaps—hold that if  the thesis is true, then the concepts of moral obligation and responsibility really have no  application, and the practices of punishing and blaming, of expressing moral condemnation  and approval, are really unjustified. Others—the optimists perhaps—hold that these  concepts and practices in no way lose their raison d’être if the thesis of determinism is true.  Some hold even that the justification of these concepts and practices requires the truth of  the thesis. There is another opinion which is less frequently voiced: the opinion, it might be  said, of the genuine moral sceptic. This is that the notions of moral guilt, of blame, of moral  responsibility are inherently confused and that we can see this to be so if we consider the  consequences either of the truth of determinism or of its falsity. The holders of this opinion  agree with the pessimists that these notions lack application if determinism is true, and add  simply that they also lack it if determinism is false. If I am asked which of these parties I  belong to, I must say it is the first of all, the party of those who do not know what the  thesis of determinism is. But this does not stop me from having some sympathy with the  others, and a wish to reconcile them. Should not ignorance, rationally, inhibit such  sympathies? Well, of course, though darkling, one has some inkling—some notion of what  sort of thing is being talked about. This lecture is intended as a move towards  reconciliation  so. is likely to seem wrongheaded to everyone.     But can there be any possibility of reconciliation between such clearly opposed positions as  those of pessimists and optimists about determinism? Well, there might be a formal  withdrawal on one side in return for a substantial concession on the other. Thus, suppose  the optimist’s position were put like this: (1) the facts as we know them do not show  determinism to be false  (2) the facts as we know them supply an adequate basis for the  concepts and practices which the pessimist feels to be imperilled by the possibility of  determinism’s truth. Now it might be that the optimist is right in this, but is apt to give an  inadequate account of the facts as we know them, and of how they constitute an adequate  basis for the problematic concepts and practices  that the reasons he gives for the adequacy  of the basis are themselves inadequate and leave out something vital. It might be that the  pessimist is rightly anxious to get this vital thing back and, in the grip of his anxiety, feels  he has to go beyond the facts as we know them  feels that the vital thing can be secure  only if, beyond the facts as we know them, there is the further fact that determinism is  false. Might he not be brought to make a formal withdrawal in return for a vital concession?     2. Let me enlarge very briefly on this, by way of preliminary only. Some optimists about  determinism point to the efficacy of the practices of punishment, and of moral  condemnation and approval, in regulating behaviour in socially desirable ways. (1) In the  fact of their efficacy, they suggest, is an adequate basis for these practices  and this fact  certainly does not show determinism to be false. To this the pessimists reply, all in a rush,  that just punishment and moral condemnation imply moral guilt and guilt implies moral  responsibility and moral responsibility implies freedom and freedom implies the falsity of  determinism. And to this the optimists are wont to reply in turn that it is true that these  practices require freedom in a sense, and the existence of freedom in this sense is one of  the facts as we know them. But what ‘freedom’ means here is nothing but the absence of  certain conditions the presence of which would make moral condemnation or punishment  inappropriate. They have in mind conditions like compulsion by another, or innate  incapacity, or insanity, or other less extreme forms of psychological disorder, or the  existence of circumstances in which the making of any other choice would be morally  inadmissible or would be too much to expect of any man. To this list they are constrained to  add other factors which, without exactly being limitations of freedom, may also make moral  condemnation or punishment inappropriate or mitigate their force: as some forms of  ignorance, mistake, or accident. And the general reason why moral condemnation or  punishment are inappropriate when these factors or conditions are present is held to be that  the practices in question will be generally efficacious means of regulating behaviour in  desirable ways only in cases where these factors are not present. Now the pessimist admits  that the facts as we know them include the existence of freedom, the occurrence of cases of  free action, in the negative sense which the optimist concedes  and admits, or rather  insists, that the existence of freedom in this sense is compatible with the truth of  determinism. Then what does the pessimist find missing? When he tries to answer this  question, his language is apt to alternate between the very familiar and the very  unfamiliar.(2) Thus he may say, familiarly enough, that the man who is the subject of  justified punishment, blame or moral condemnation must really deserve it  and then add,  perhaps, that, in the case at least where he is blamed for a positive act rather than an  omission, the condition of his really deserving blame is something that goes beyond the  negative freedoms that the optimist concedes. It is, say, a genuinely free identification of  the will with the act. And this is the condition that is incompatible with the truth of  determinism.     The conventional, but conciliatory, optimist need not give up yet. He may say: Well, people  often decide to do things, really intend to do what they do, know just what they’re doing in  doing it  the reasons they think they have for doing what they do, often really are their  reasons and not their rationalizations. These facts, too, are included in the facts as we know  them. If this is what you mean by freedom—by the identification of the will with the act— then freedom may again be conceded. But again the concession is compatible with the truth  of the determinist thesis. For it would not follow from that thesis that nobody decides to do  anything  that nobody ever does anything intentionally  that it is false that people  sometimes know perfectly well what they are doing. I tried to define freedom negatively.  You want to give it a more positive look. But it comes to the same thing. Nobody denies  freedom in this sense, or these senses, and nobody claims that the existence of freedom in  these senses shows determinism to be false.     But it is here that the lacuna in the optimistic story can be made to show. For the pessimist  may be supposed to ask: But why does freedom in this sense justify blame, etc.? You turn  towards me first the negative, and then the positive, faces of a freedom which nobody  challenges. But the only reason you have given for the practices of moral condemnation and  punishment in cases where this freedom is present is the efficacy of these practices in  regulating behaviour in socially desirable ways. But this is not a sufficient basis, it is not  even the right sort of basis, for these practices as we understand them.     Now my optimist, being the sort of man he is, is not likely to invoke an intuition of  fittingness at this point. So he really has no more to say. And my pessimist, being the sort  of man he is, has only one more thing to say  and that is that the admissibility of these  practices, as we understand them, demands another kind of freedom, the kind that in turn  demands the falsity of the thesis of determinism. But might we not induce the pessimist to  give up saying this by giving the optimist something more to say?     3. I have mentioned punishing and moral condemnation and approval  and it is in  connection with these practices or attitudes that the issue between optimists and  pessimists—or, if one is a pessimist, the issue between determinists and libertarians—is felt  to be particularly important. But it is not of these practices and attitudes that I propose, at  first, to speak. These practices or attitudes permit, where they do not imply, a certain  detachment from the actions or agents which are their objects. I want to speak, at least at  first, of something else: of the non-detached attitudes and reactions of people directly  involved in transactions with each other  of the attitudes and reactions of offended parties  and beneficiaries  of such things as sratitude, resentment, forgiveness, love, and hurt  feelings. Perhaps something like the issue between optimists and pessimists arises in this  neighbouring field too  and since this field is less crowded with disputants, the issue might  here be easier to settle  and if it is settled here, then it might become easier to settle it in  the disputant-crowded field.     What I have to say consists largely of commonplaces. So my language, like that of  commonplaces generally, will be quite unscientific and imprecise. The central commonplace  that I want to insist on is the very great importance that we attach to the attitudes and  intentions towards us of other human beings, and the great extent to which our personal  feelings and reactions depend upon, or involve, our beliefs about these attitudes and  intentions. I can give no simple description of the field of phenomena at the centre of which  stands this commonplace truth  for the field is too complex. Much imaginative literature is  devoted to exploring its complexities  and we have a large vocabulary for the purpose.  There are simplifying styles of handling it in a general way. Thus we may, like La  Rochefoucauld, put self-love or self-esteem or vanity at the centre of the picture and point  out how it may be caressed by the esteem, or wounded by the indifference or contempt, of  others. We might speak, in another jargon, of the need for love, and the loss of security  which results from its withdrawal  or, in another, of human self-respect and its connection  with the recognition of the individual’s dignity. These simplifications are of use to me only if  they help to emphasize how much we actually mind, how much it matters to us, whether  the actions of other people—and particularly of some other people—reflect attitudes towards  us of goodwill, affection, or esteem on the one hand or contempt, indifference, or  malevolence on the other. If someone treads on my hand accidentally, while trying to help  me, the pain may be no less acute than if he treads on it in contemptuous disregard of my  existence or with a malevolent wish to injure me. But I shall generally feel in the second  case a kind and degree of resentment that I shall not feel in the first. If someone’s actions  help me to some benefit I desire, then I am benefited in any case  but if he intended them  so to benefit me because of his general goodwill towards me, I shall reasonably feel a  gratitude which I should not feel at all if the benefit was an incidental consequence,  unintended or even regretted by him, of some plan of action with a different aim.     These examples are of actions which confer benefits or inflict injuries over and above any  conferred or inflicted by the mere manifestation of attitude and intention themselves. We  should consjder also in how much of our behaviour the benefit or injury resides mainly or  entirely in the manifestation of attitude itself. So it is with good manners, and much of what  we call kindness, on the one hand  with deliberate rudeness, studied indifference, or insult  on the other. Besides resentment and gratitude, I mentioned just now forgiveness. This is a  rather unfashionable subject in moral philosophy at present  but to be forgiven is something  we sometimes ask, and forgiving is something we sometimes say we do. To ask to be  forgiven is in part to acknowledge that the attitude displayed in our actions was such as  might properly be resented and in part to repudiate that attitude for the future (or at least  for the immediate future)  and to forgive is to accept the repudiation and to forswear the  resentment.     We should think of the many different kinds of relationship which we can have with other  people—as sharers of a common interest  as members of the same family  as colleagues   as friends  as lovers  as chance parties to an enormous range of transactions and  encounters. Then we should think, in each of these connections in turn, and in others, of the  kind of importance we attach to the attitudes and intentions towards us of those who stand  in these relationships to us, and of the kinds of reactive attitudes and feelings to which we  ourselves are prone. In general, we demand some degree of goodwill or regard on the part  of those who stand in these relationships to us, though the forms we require it to take vary  widely in different connections. The range and intensity of our reactive attitudes towards  goodwill, its absence or its opposite vary no less widely. I have mentioned, specifically,  resentment and gratitude  and they are a usefully opposed pair. But, of course, there is a  whole continuum of reactive attitude and feeling stretching on both sides of these and—the  most comfortable area—in between them.     The object of these commonplaces is to try to keep before our minds something it is easy to  forget when we are engaged in philosophy, especially in our cool, contemporary style, viz.  what it is actually like to be involved in ordinary interpersonal relationships, ranging from  the most intimate to the most casual.     4. It is one thing to ask about the general causes of these reactive attitudes I have alluded  to  it is another to ask about the variations to which they are subject, the particular  conditions in which they do or do not seem natural or reasonable or appropriate  and it is a  third thing to ask what it would be like, what it is like, not to suffer them. I am not much  concerned with the first question  but I am with the second  and perhaps even more with  the third.     Let us consider, then, occasions for resentment: situations in which one person is offended  or injured by the action of another and in which—in the absence of special considerations— the offended person might naturally or normally be expected to feel resentment. Then let us  consider what sorts of special considerations might be expected to modify or mollify this  feeling or remove it altogether. It needs no saying now how multifarious these  considerations are. But, for my purpose, I think they can be roughly divided into two kinds.  To the first group belong all those which might give occasion for the employment of such  expressions as ‘He didn’t mean to’, ‘He hadn’t realized’, ‘He didn’t know’  and also all those  which might give occasion for the use of the phrase ‘He couldn’t help it’, when this is  supported by such phrases as ‘He was pushed’, ‘He had to do it’, ‘It was the only way’,  ‘They left him no alternative’, etc. Obviously these various pleas, and the kinds of situations  in which they would be appropriate, differ from each other in striking and important ways.  But for my present purpose they have something still more important in common. None of  them invites us to suspend towards the agent, either at the time of his action or in general,  our ordinary reactive attitudes. They do not invite us to view the agent as one in respect of  whom these attitudes are in any way inappropriate. They invite us to view the injury as one  in respect of which a particular one of these attitudes is inappropriate. They do not invite us  to see the agent as other than a fully responsible agent. They invite us to see the injury as  one for which he was not fully, or at all, responsible. They do not suggest that the agent is  in any way an inappropriate object of that kind of demand for goodwill or regard which is  reflected in our ordinary reactive attitudes. They suggest instead that the fact of in jury was  not in this case incompatible with that demand’s being fulfilled, that the fact of injury was  quite consistent with the agent’s attitude and intentions being just what we demand they  should be.(3) The agent was just ignorant of the injury he was causing, or had lost his  balance through being pushed or had reluctantly to cause the injury for reasons which  acceptably override his reluctance. The offering of such pleas by the agent and their  acceptance by the sufferer is something in no way opposed to, or outside the context of,  ordinary inter-personal relationships and the manifestation of ordinary reactive attitudes.  Since things go wrong and situations are complicated, it is an essential and integral element  in the transactions which are the life of these relationships.     The second group of considerations is very different. I shall take them in two subgroups of  which the first is far less important than the second. In connection with the first subgroup  we may think of such statements as ‘He wasn’t himself’, ‘He has been under very great  strain recently’, ‘He was acting under post-hypnotic suggestion’  in connection with the  second, we may think of ‘He’s only a child’, ‘He’s a hopeless schizophrenic’, ‘His mind has  been systematically perverted’, ‘That’s purely compulsive behaviour on his part’. Such pleas  as these do, as pleas of my first general group do not, invite us to suspend our ordinary  reactive attitudes towards the agent, either at the time of his action or all the time. They do  not invite us to see the agent’s action in a way consistent with the full retention of ordinary  inter-personal attitudes and merely inconsistent with one particular attitude. They invite us  to view the agent himself in a different light from the light in which we should normally view  one who has acted as he has acted. I shall not linger over the first subgroup of cases.  Though they perhaps raise, in the short term, questions akin to those raised, in the long  term, by the second subgroup, we may dismiss them without considering those questions  by taking that admirably suggestive phrase, ‘He wasn’t himself’, with the seriousness that— for all its being logically comic—it deserves. We shall not feel resentment against the man  he is for the action done by the man he is not  or at least we shall feel less. We normally  have to deal with him under normal stresses  so we shall not feel towards him, when he  acts as he does under abnormal stresses, as we should have felt towards him had he acted  as he did under normal stresses.     The second and more important subgroup of cases allows that the circumstances were  normal, but presents the agent as psychologically abhormal—or as morally undeveloped.  The agent was himself  but he is warped or deranged, neurotic or just a child. When we see  someone in such a light as this, all our reactive attitudes tend to be profoundly modified. I  must deal here in crude dichotomies and ignore the ever-interesting and ever-illuminating  varieties of case. What I want to contrast is the attitude (or range of attitudes) of  involvement or participation in a human relationship, on the one hand, and what might be  called the objective attitude (or range of attitudes) to another human being, on the other.  Even in the same situation, I must add, they are not altogether exclusive of each other  but  they are, profoundly, opposed to each other. To adopt the objective attitude to another  human being is to see him, perhaps, as an object of social policy  as a sub ject for what, in  a wide range of sense, might be called treatment  as something certainly to be taken  account, perhaps precautionary account, of  to be managed or handled or cured or trained   perhaps simply to be avoided, though this gerundive is not peculiar to cases of objectivity of  attitude. The objective attitude may be emotionally toned in many ways, but not in all  ways: it may include repulsion or fear, it may include pity or even love, though not all kinds  of love. But it cannot include the range of reactive feelings and attitudes which belong to  involvement or participation with others in inter-personal human relationships  it cannot  include resentment, gratitude, forgiveness, anger, or the sort of love which two adults can  sometimes be said to feel reciprocally, for each other. If your attitude towards someone is  wholly objective, then though you may light him, you cannot quarrel with him, and though  you may talk to him, even negotiate with him, you cannot reason with him. You can at most  pretend to quarrel, or to reason, with him.     Seeing someone, then, as warped or deranged or compulsive in behaviour or peculiarly  unfortunate in his formative circumstances—seeing someone so tends, at least to some  extent, to set him apart from normal participant reactive attitudes on the part of one who so  sees him, tends to promote, at least in the civilized, objective attitudes. But there is  something curious to add to this. The objective attitude is not only something we naturally  tend to fall into in cases like these, where participant attitudes are partially or wholly  inhibited by abnormalities or by immaturity, It is also something which is available as a  resource in other cases too. We look with an objective eye on the compulsive behaviour of  the neurotic or the tiresome behaviour of a very young child, thinking in terms of treatment  or training. But we can sometimes look with something like the same eye on the behaviour  of the normal and the mature. We have this resource and can sometimes use it  as a  refuge, say, from the strains of involvement  or as an aid to policy  or simply out of  intellectual curiosity. Being human, we cannot, in the normal case, do this for long, or  altogether. If the strains of involvement, say, continue to be too great, then we have to do  something else -- like severing a relationship. But what is above all interesting is the  tension there is, in us, between the participant attitude and the objective attitude. One is  tempted to say: between our humanity and our intelLigence. But to say this would be to  distort both notions.     What I have called the participant reactive attitudes are essentially natural human reactions  to the good or ill will or indifference of others towards us, as displayed in their attitudes and  actions. The question we have to ask is: What effect would, or should, the acceptance of the  truth of a general thesis of determinism have upon these reactive attitudes? More  specifically, would, or should, the acceptance of the truth of the thesis lead to the decay or  the repudiation of all such attitudes? Would, or should, it mean the end of gratitude,  resentment, and forgiveness  of all reciprocated adult loves  of all the essentially personal  antagonisms?     But how can I answer, or even pose, this question without knowing exactly what the thesis  of determinism is? Well, there is one thing we do know  that if there is a coherent thesis of  determinism, then there must be a sense of ‘determined’ such that, if that thesis is true,  then all behaviour whatever is determined in that sense. Remembering this, we can  consider at least what possibilities lie formally open  and then perhaps we shall see that the  question can be answered without knowing exactly what the thesis of determinism is. We  can considçr what possibilities lie open because we have already before us an account of the  ways in which particular reactive attitudes, or reactive attitudes in general, may be, and,  sometimes, we judge, should be, inhibited. Thus I considered earlier a group of  considerations which tend to inhibit, and, we judge, should inhibit, resentment, in particular  cases of an agent causing an injury, without inhibiting reactive attitudes in general towards  that agent. Obviously this group of considerations cannot strictly bear upon our question   for that question concerns reactive attitudes in general. But resentment has a particular  interest  so it is worth adding that it has never been daimed as a consequence of the truth  of determinism that one or another of these considerations was operative in every case of  an injury being caused by an agent  that it would follow from the truth of determinism that  anyone who caused an injury either was quite simply ignorant of causing it or had  acceptably overriding reasons for acquiescing reluctantly in causing it or. . ., etc. The  prevalence of this happy state of affairs would not be a consequence of the reign of  universal determinism, but of the reign of universal goodwill. We cannot, then, find here the  possibility of an affirmative answer to our question, even for the particular case of  resentment.     Next, I remarked that the participant attitude, and the personal reactive attitudes in  general, tend to give place, and it is judged by the civilized should give place, to objective  attitudes, just in so far as the agent is seen as excluded from ordinary adult human  relationships by deep-rooted. psychological abnormality—or simply by being a child. But it  cannot be a consequence of any thesis which is not itself self-contradictory that abnormality  is the universal condition.     Now this dismissal might seem altogether too facile  and so, in a sense, it is. But whatever  is too quickly dismissed in this dismissal is allowed for in the only possible form of  affirmative answer that remains. We can sometimes, and in part, I have remarked, look on  the normal (those we rate as ‘normal’) in the objective way in which we have learned to  look on certain classified cases of abnormality. And our question reduces to this: could, or  should, the acceptance of the determinist thesis lead us always to look on everyone  exclusively in this way? For this is the only condition worth considering under which the  acceptancc of determinism could lead to the decay or repudiation of participant reactive  attitudes.     It does not seem to be self-contradictory to suppose that this might happen. So I suppose  we must say that it is not absolutely inconceivable that it should happen. But I am strongly  inclined to think that it is, for us as we are, practically inconceivable. The human  commitment to participation in ordinary inter-personal relationships is, I think, too  thoroughgoing and deeply rooted for us to take seriously the thought that a general  theoretical conviction might so change our world that, in it, there were no longer any such  things as inter-personal relationships as we normally understand them  and being involved  in inter-personal relationships as we normally understand them precisely is being exposed  to the range of reactive attitudes and feelings that is in question.     This, then, is a part of the reply to our question. A sustained objectivity of inter-personal  attitude, and the human isolation which that would entail, does not seem to be something of  which human beings would be capable, even if some general truth were a theoretical ground  for it. But this is not all. There is a further point, implicit in the foregoing, which must be  made explicit. Exceptionally, I have said, we can have direct dealings with human beings  without any degree of personal involvement, treating them simply as creatures to be  handled in our own interest, or our side’s, or society’s—or even theirs. In the extreme case  of the mentally deranged, it is easy to see the connection between the possibility of a wholly  objective attitude and the impossibility of what we understand by ordinary interpersonal  relationships. Given this latter impossibility, no other civilized attitude is available than that  of viewing the deranged person simply as something to be understood and controlled in the  most desirable fashion. To view him as outside the reach of personal relationships is  already, for the civilized, to view him in this way. For reasons of policy or self-protection we  may have occasion, perhaps temporary, to adopt a fundamentally similar attitude to a  ‘normal’ human being  to concentrate, that is, on understanding ‘how he works’, with a view  to determining our policy accordingly, or to finding in that very understanding a relief from  the strains of involvement. Now it is certainly true that in the case of the abnormal, though  not in the case of the normal, our adoption of the objective attitude is a consequence of our  viewing the agent as incapacitated in some or all respects for ordinary interpersonal  relationships. He is thus incapacitated, perhaps, by the fact that his picture of reality is pure  fantasy, that he does not, in a sense, live in the real world at all  or by the fact that his  behaviour is, in part, an unrealistic acting out of unconscious purposes  or by the fact that  he is an idiot, or a moral idiot. But there is something else which, because this is true, is  equally certainly not true. And that is that there is a sense of ‘determined’ such that (1) if  determinism is true, all behaviour is determined in this sense, and (2) determinism might  be true, i. e. it is not inconsistent with the facts as we know them to suppose that all  behaviour might be determined in this sense, and   (3) our adoption of the objective attitude towards the abnormal is the result of a prior  embracing of the belief that the behaviour, or the relevant stretch of behaviour, of the  human being in question is determined in this sense. Neither in the case of the normal,  then, nor in the case of the abnormal is it true that, when we adopt an objective attitude,  we do so because we hold such a belief. So my answer has two parts. The first is that we  cannot, as we are, seriously envisage ourselves adopting a thoroughgoing objectivity of  attitude to others as a result of theoretical conviction of the truth of determinism  and the  second is that when we do in fact adopt such an attitude in a particular case, our doing so is  not the consequence of a theoretical conviction which might be expressed as ‘Determinism  in this case’, but is a consequence of our abandoning, for different reasons in different  cases, the ordinary inter-personal attitudes.     It might be said that all this leaves the real question unanswered, and that we cannot hope  to answer it without knowing exactly what the thesis of determinism is. For the real  question is not a question about what we actually do, or why we do it. It is not even a  question about what we would in fact do if a certain theoretical conviction gained general  acceptance. It is a question about what it would be rational to do if determinism were true,  a question about the rational justification of ordinary inter-personal attitudes in general. To  this I shall reply, first, that such a question could seem real only to one who had utterly  failed to grasp the purport. of the preceding answer, the fact of our natural human  commitment to ordinary inter-personal attitudes. This commitment is part of the general  framework of human life, not something that can come up for review as particular cases can  come up for review within this general framework. And I shall reply, second, that if we could  imagine what we cannot have, viz, a choice in this matter, then we could choose rationally  only in the light of an assessment of the gains and losses to human life, its enrichment or  impoverishment  and the truth or falsity of a general thesis of determinism would not bear  on the rationality of this choice.(4)     5. The point of this discussion of the reactive attitudes in their relation -- or lack of it—to  the thesis of determinism was to bring us, if possible, nearer to a position of compromise in  a more usual area of debate. We are not now to discuss reactive attitudes which are  essentially those of offended parties or beneficiaries. We are to discuss reactive attitudes  which are essentially not those, or only incidentally are those, of offended parties or  beneficiaries, but are nevertheless, I shall claim, kindred attitudes to those I have  discussed. I put resentment in the centre of the previous discussion. I shall put moral  indignation—or, more weakly, moral disapprobation—in the centre of this one.     The reactive attitudes I have so far discussed are essentially reactions to the quality of  others’ wills towards us, as manifested in their behaviour: to their good or ill will or  indifference or lack of concern. Thus resentment, or what I have called resentment, is a  reaction to injury or indifference. The reactive attitudes I have now to discuss might be  described as the sympathetic or vicarious or impersonal or disinterested or generalized  analogues of the reactive attitudes I have already discussed. They, are reactions to the  qualities of others’ wills, not towards ourselves, but towards others. Because of this  impersonal or vicarious character, we give them different names. Thus one who experiences  the vicarious analogue of resentment is said to be indignant or disapproving, or morally  indignant or disapproving. What we have here is, as it were, resentment on behalf of  another, where one’s own interest and dignity are not involved  and it is this impersonal or  vicarious character of the attitude, added to its others, which entitle it to the qualification  ‘moral’. Both my description of, and my name for, these attitudes are, in one important  respect, a little misleading. It is not that these attitudes are essentially vicarious—one can  feel indignation on one’s own account—but that they are essentially capable of being  vicarious. But I shall retain the name for the sake of its suggestiveness  and I hope that  what is misleading about it will be corrected in what follows.     The personal reactive attitudes rest on, and reflect, an expectation of, and demand for, the  manifestation of a certain degree of goodwill or regard on the part of other human beings  towards ourselves  or at least on the expectation of, and demand for, an absence of the  manifestation of active ill will or indifferent disregard. (What will, in particular cases, count  as manifestations of good or ill will or disregard will vary in accordance with the particular  relationship in which we stand to another human being.) The generalized or vicarious  analogues of the personal reactive attitudes rest on, and reflect, exactly the same  expectation or demand in a generalized form  they rest on, or reflect, that is, the demand  for the manifestation of a reasonable degree of goodwill or regard, on the part of others, not  simply towards oneself, but towards all those on whose behalf moral indignation may be  felt, i. e., as we now think, towards all men. The generalized and non-generalized forms of  demand, and the vicarious and personal reactive attitudes which rest upon, and reflect,  them are connected not merely logically. They are connected humanly  and not merely with  each other. They are connected also with yet another set of attitudes which I must mention  now in order to complete the picture. I have considered from two points of view the  demands we make on others and our reactions to their possibly injurious actions. These  were the points of view of one whose interest was directly involved (who suffers, say, the  injury) and of others whose interest was not directly involved (who do not themselves suffer  the injury). Thus I have     spoken of personal reactive attitudes in the first connection and of their vicarious analogues  in the second. But the picture is not cornplete unless we consider also the correlates of  these attitudes on the part of those on whom the demands are made, on the part of the  agents. Just as there are personal. and vicarious reactive attitudes associated with demands  on others for oneself and demands on others for others, so there are self-reactive attitudes  associated with demands on oneself for others. And here we have to mention such  phenomena as feeling bound or obliged (the ‘sense of obligation’)  feeling compunction   feeling guilty or remorseful or at least responsible  and the more complicated phenomenon  of shame.     All these three types of attitude are humanly connected. One who manifested the personal  reactive attitudes in a high degree but showed no inclination at all to their vicarious  analogues would appear as an abnormal case of moral egocentricity, as a kind of moral  solipsist. Let him be supposed fully to acknowledge the claims to regard that others had on  him, to be susceptible of the whole range of self-reactive attitudes. He would then see  himself as unique both as one (the one) who had a general claim on human regard and as  one (the one) on whom human beings in general had such a claim. This would be a kind of  moral solipsism. But it is barely more than a conceptual possibility  if it is that. In general,  though within varying limits, we demand. of others for others, as well as of ourselves for  others, something of the regard which we demand of others for ourselves. Can we imagine,  besides that of the moral solipsist, any other case of one or two of these three types of  attitude being fully developed, but quite unaccompanied by any trace, however slight, of the  remaining two or one? If we can, then we imagine something far below or far above the  level of our common humanity—a moral idiot or a saint. For all these types of attitude alike  have common roots in our human nature and our membership of human communities.     Now, as of the personal reactive attitudes, so of their vicarious analogues, we must ask in  what ways, and by what considerations, they tend to be inhibited. Both types of attitude  involve, or express, a certain sort of demand for inter-personal regard. The fact of injury  constitutes a prima fade appearance of this demand’s being flouted or unfulfilled. We saw,  in the case of resentment, how one class of considerations may show this appearance to be  mere appearance, and hence inhibit resentment, without inhibiting, or displacing, the sort of  demand of which resentment can be an expression, without in any way tending to make us  suspend our ordinary interpersonal attitudes to the agent. Considerations of this class  operate in just the same way, for just the same reasons, in connection with moral  disapprobation or indignation  they inhibit indignation without in any way inhibiting the sort  of demand on the agent of which indignation can be an expression, the range of attitudes  towards him to which it belongs. But in this connection we may express the facts with a new  emphasis. We may say, stressing the moral, the generalized aspect of the demand:  considerations of this group have no tendency to make us see the agent as other than a  morally responsible agent  they simply make us see the- injury as one for which he was not  morally responsible. The offering and acceptance of such exculpatory pleas as are here in  question in no way detracts in our eyes from the agent’s status as a term of moral  relationships. On the contrary, since things go wrong and situations are complicated, it is an  essential part of the life of such relationships.     But suppose we see the agent in a different light: as one whose picture of the world is an  insane delusion  or as one whose behaviour, or a part of whose behaviour, is unintelligible  to us, perhaps even to him, in terms of conscious purposes, and intelligible only in terms of  unconscious purposes  or even, perhaps, as one wholly impervious t", "filename": "Peter Strawson - Freedom and Resentment.pdf", "meta": {"bla": "huahaua"}}