{"text": "Making It Explicit  Reasoning, Representing,  and Discursive Commitment  Robert B. Brandom  Harvard University Press  Cambridge, Massachusetts  London, England  To Wilfrid Sellars and Richard Rorty  Without whom most of it would not even be implicit  Copyright © 1994 by the President and Fellows of Harvard College  All rights reserved  Printed in the United States of America  Page xxiv constitutes an extension of the copyright page.  Fourth printing, 2001  First Harvard University Press paperback edition, 1998  Library of Congress Cataloging-in-Publication Data  Brandom, Robert.  Making it explicit: reasoning, representing, and discursive commitment /  Robert B. Brandom.  p. cm.  · . . both a new world,  and the old made explicit ...  We shall not cease from exploration  And the end of all our exploring  Will be to arrive where we started  And know the place for the first time.  Contents  Preface xi  1. Toward a Nonnative Pragmatics 3  I. Introduction 3  VI. From Intentional Interpretation to Original Intentionality 55  Appendix: Wittgenstein's Use of Regel 64  2. Toward an Inferential Semantics 67  I. Content and Representation 67  II. The Priority of the Propositional 79  ill. Conceptual Classification and Inference 85  IV. Material Inference, Conceptual Content, and Expression 94  V. Circumstances and Consequences of Application 116  VI. Conclusion 132  viii Contents  3. Linguistic Practice and Discursive Commitment 141  I. Intentional States and Linguistic Practices 141  II. Deontic Status and Deontic Attitudes 157  III. Asserting and Inferring 167  IV. Scorekeeping: Pragmatic Significance and Semantic Content 180  4. Perception and Action: The Conferral of Empirical and  Practical Conceptual Content 199  I. Assertions as Knowledge Claims 199  II. Reliability 206  III. Observation Reports and Noninferential Authority 213  IV. Rational Agency 229  V. Practical Reasoning: Inferences from Doxastic  to Practical Commitments 243  v.I. Intentions 253  5. The Expressive Role of Traditional Semantic Vocabulary:  'True' and 'Refers' 275  I. From Inference to Truth, Reference, and Representation 275  II. Truth in Classical Pragmatism 285  m. From Pragmatism to Prosentences 299  IV. Reference and Anaphorically Indirect Descriptions 305  V. The Function of Traditional Semantic Vocabulary Is  Expressive, Not Explanatory 322  6. Substitution: What Are Singular Terms, and Why Are There Any? 334  I. Multivalued Logic and Material Inference 334  v.I. Objections and Replies 384  v.I1. Conclusion 399  Appendix I: From Substitutional Derivation of Categories  to Functional Derivation of Categories 404  Appendix II: Sentence Use Conferring the Status of Singular Terms on Sub sentential Expressions-An Application 409  7. Anaphora: The Structure of Token Repeatables 413  I. Frege's Grundlagen Account of Picking Out Objects 413  II. Definite Descriptions and Existential Commitments 432  III. Substitution, Token Recurrence, and Anaphora 449  IV. Deixis and Anaphora 459  Contents ix  V. Interpersonal Anaphora and Communication 473  Appendix: Other Kinds of Anaphora-Paychecks,  Donkeys, and Quantificational Antecedents 490  8. Ascribing Propositional Attitudes: The Social Route from  Reasoning to Representing 495  I. Representation and De Re Ascription of Propositionally 495  Contentful Commitments  IT. Interpretation, Communication, and De Re Ascriptions 508  ITI. De Re Ascriptions and the Intentional Explanation of Action 520  IV. From Implicit Attribution to Explicit Ascription 529  V. Epistemically Strong De Re Attitudes: Indexicals,  Quasi-Indexicals, and Proper Names 547  VI. The Social-Perspectival Character of Conceptual Contents  and the Objectivity of Conceptual Norms 584  Appendix: The Construction and Recursive Interpretation  of Iterated Ascriptions That Mix De Dicta and De Re  Content Specifications 608  9. Conclusion 614  I. Two Concepts of Concepts 614  Abbreviations 653  Notes 655  Index 717  Preface  We work in the dark-we do what we can-we give what we have. Our  doubt is our passion and our passion is our task. The rest is the madness  of art.  That old philosopher Fred Allen used to say he could not understand why  someone would spend years writing a novel, when for a few dollars you could  buy one practically anywhere. A similar remark might be made about contributions to that peculiar genre of creative nonfiction writing to which  philosophical works such as this one belong. This book is an investigation  into the nature of language: of the social practices that distinguish us as  rational, indeed logical, concept-mongering creatures-knowers and agents.  This is of course a topic that has been much explored by philosophers, both  the mighty dead and the ablest contemporary thinkers. Surrounded as we are  by the riches they have bequeathed, it is hard to avoid asking why one should  bother reading-let alone writing-yet another such work. This question  may seem all the more urgent inasmuch as it is acknowledged (indeed, some  pains are taken to show) that the basic building blocks out of which this  account is constructed-its motivating insights, commitments, and strategies-are not novel or original.  Still, though the ways of thinking and talking about thinking and talking  presented here arise naturally out of a reading of the philosophical tradition  (above all Kant, Frege, and Wittgenstein) and of its development by more  recent thinkers, both that tradition and its significance for us today are by  current standards seen decidedly on a slant. As a result, the story told in these  pages comes at familiar things from an unfamiliar direction. Its promise lies  xii Preface  in the sort of added depth and dimension that only binocular vision affords   that is the point of laying a substantially different conceptual perspective  alongside our more accustomed line of sight. In keeping with this understanding of the sort of payoff that can be hoped for, the body of the work aims  to set criteria of adequacy for a theory of discursive practice, motivate the  approach adopted, work the model out in detail, and apply it. The idea is to  show what kind of understanding and explanatory power one gets from  talking this way, rather than to argue that one is somehow rationally obliged  to talk this way.  Of course I take it that the claims made in what follows are true  I endorse  those assertions  they express my commitments. One of the central tenets of  the account of linguistic practice put forward here is that the characteristic  authority on which the role of assertions in communication depends is  intelligible only against the background of a correlative responsibility to  vindicate one's entitlement to the commitments such speech acts express. It  is possible to secure entitlement to the commitments (assertional, inferential, and referential) implicit in an idiom without gainsaying the possibility  of entitlement to a different one. But even such a modest justificatory project  is of interest only to someone who both understands the commitments in  question and has some reason to want to become entitled to talk in ways  that presuppose them.  Both of these ends are served by starting the story with some historical  lessons. Accordingly, Chapters 1 and 2 form an entrance hall to the rest of  the edifice, one whose main architectural features are made more noticeable  by the judicious placement of ancestor portraits. The same figure appears on  many walls, almost always recognizable, but often portrayed from unusual  vantage points (from behind, from above) or highlighting something other  than the familiar face. In particular, the portrait of Frege will seem to some  to be like one of those odd photographs of a reclining figure taken with the  lens so close that the subject's left foot assumes gigantic proportions, dwarfing the rest of the individual, whose head and torso dwindle to the dimensions of insignificant appendages. Nonetheless, the tradition that is retrospectively constituted by the unusual emphases and filiations to be found  here is meant to be coherent and compelling in its own terms. It is not just  whatever rewriting of the history of philosophy happens to be needed to  make the waning years of the twentieth century safe for the views I put  forward. Rather, those views have the shape they do because of this reading  of now we got to where we are.  One of the overarching methodological commitments that orients this  project is to explain the meanings of linguistic expressions in terms of their  use-an endorsement of one dimension of Wittgenstein's pragmatism. For  although he drove home the importance of such an approach, other features  of his thought-in particular his theoretical quietism-have discouraged his  admirers from attempting to work out the details of a theory of meaning or,  Preface xiii  for that matter, of use. One result has been a substantial disjunction between  semantic theorizing (about the sorts of contents expressed by various locutions), on the one hand, and pragmatic theorizing (about the linguistic practices in which those locutions are employed), on the other. The explanatory  strategy pursued here is to begin with an account of social practices, identify  the particular structure they must exhibit in order to qualify as specifically  linguistic practices, and then consider what different sorts of semantic contents those practices can confer on states, performances, and expressions  caught up in them in suitable ways. The result is a new kind of conceptualrole semantics. It is at once firmly rooted in actual practices of producing and  consuming speech acts, and sufficiently finely articulated to make clear how  those practices are capable of conferring the rich variety of kinds of content  that philosophers of language have revealed and reveled in.  Claims about the relations between meaning and use have a clear sense only  in the context of a specification of the vocabulary in which that use is  described or ascribed. At one extreme, use clearly determines meaning in the  strongest possible sense if admissible specifications of the use can include  such phrases as \"using the word 'not' to express negation\" or \"using the term  'Julius Caesar' to refer to Julius Caesar.\" At an opposite extreme, if admissible specifications of use are restricted to descriptions of the movements of  particles expressed in the vocabulary of physics, not only will the use, so  described, fail to settle what is meant or expressed by various noises or  inscriptions, it will fail to settle even that anything is meant or expressed by  them. The specification of use employed here is neither so generous as to  permit semantic or intentional vocabulary nor so parsimonious as to insist  on purely naturalistic vocabulary.  Instead, it makes essential use of normative vocabulary. The practices that  confer propositional and other sorts of conceptual content implicitly contain  norms concerning how it is correct to use expressions, under what circumstances it is appropriate to perform various speech acts, and what the appropriate consequences of such performances are. Chapter 1 introduces and  motivates this normative pragmatics, which is rooted in considerations advanced by Kant, Frege, and Wittgenstein. No attempt is made to eliminate,  in favor of nonnormative or naturalistic vocabulary, the normative vocabulary employed in specifying the practices that are the use of a language.  Interpreting states, performances, and expressions as semantically or intentionally contentful is understood as attributing to their occurrence an  inelirninably normative pragmatic significance.  Though this normative dimension of linguistic practice is taken to be  ineliminable, it is not treated as primitive or inexplicable. It is rendered less  mysterious in two ways. First, linguistic norms are understood as instituted  by social-practical activity. The pragmatic significances of different sorts of  speech acts are rendered theoretically in terms of how those performances  xiv Preface  affect the commitments (and entitlements to those commitments) acknowledged or otherwise acquired by those whose performances they are. The  norms implicit in linguistic practice are accordingly presented in a specifically deontic form. But these deontic statuses are understood in tum as a  form of social status, instituted by the practical attitudes of those who  attribute and acknowledge such statuses.  The natural world does not come with commitments and entitlements in  it  they are products of human activity. In particular, they are creatures of  the attitudes of taking, treating, or responding to someone in practice as  committed or entitled (for instance, to various further performances). Mastering this sort of norm-instituting social practice is a kind of practical  know-how-a matter of keeping deontic score by keeping track of one's own  and others' commitments and entitlements to those commitments, and altering that score in systematic ways based on the performances each practitioner produces. The norms that govern the use of linguistic expressions are  implicit in these deontic scorekeeping practices.  The second way norms are rendered less mysterious is by explaining  exactly what is expressed by normative vocabulary. Beginning with basic  deontic scorekeeping attitudes and the practices that govern them, an account is offered of how locutions must be used in order to express explicitly the very normative notions-is committed, is permitted, ought, and  so on-that are appealed to in laying out the normative pragmatics. This  is an explication of explicitly normative conceptual contents in terms of  implicitly normative practices, rather than a reduction of normative terms  to nonnormative ones. It illuminates the normative dimension of discursive practice in line with the methodological principle that implicit  structures are often best understood by looking at how they can be made  explicit.  The first step in the project is accordingly the elaboration of a pragmatics  (a theory of the use of language) that is couched in terms of practical scorekeeping attitudes of attributing and acknowledging deontic statuses of  commitment and entitlement. The pragmatic significance of performanceseventually, speech acts such as assertions-is then understood to consist in  the difference those performances make to the commitments and entitlements attributed by various scorekeepers. The next step is to say what  structure such a set of social practices must have in order to qualify as  specifically discursive practice. This is a matter of moving from pragmatics  to semantics. The defining characteristic of discursive practice is the production and consumption of specifically propositional contents. It is argued in  Chapter 2 that propositional contentfulness should be understood in terms  of inferential articulation  propositions are what can serve as premises and  conclusions of inferences, that is, can serve as and stand in need of reasons.  Chapter 3 describes (in deontic scorekeeping terms) a model of social practices of giving and asking for reasons-specifically linguistic discursive prac- Preface xv  tices, which suffice to confer propositional contents on states, attitudes,  performances, and expressions that play suitable roles in those practices.  This account of the conferral of semantic content by inferentially articulated,  social scorekeeping practice is further generalized in two different directions.  First, it is shown how this model can be applied in order to understand not  only linguistic meanings but intentional contents generally. The propositional contentfulness of beliefs, no less than of claims, should be understood  in terms of their role in reasoning of various kinds. The inferentially articulated commitments expressed by assertional speech acts are doxastic commitments. Much of the theoretical work done by the concept of belief can be  done instead by appeal to this sort of deontic status, and to the practical  scorekeeping attitudes of acknowledging or undertaking such commitments.  A social, linguistic account of intentionality is accordingly elaborated in  Chapter 3.  It is extended in Chapter 4 to incorporate treatments of perception and  action and of the contribution those phenomena make to the empirical and  practical dimensions of the propositional contents of the states, acts, and  attitudes involved in them. It is not denied that it makes sense to talk about  nonlinguistic creatures as having intentional states, but it is claimed that our  understanding of such talk is parasitic on our understanding of the sort of  full-blooded linguistic intentionality characteristic of states and attitudes  that only beings who engage in discursive social practices can have. This  story amounts, then, to an account of the relations of mindedness-in the  sense of sapience rather than mere sentience-to behavior. As in the parallel  case of meaning and use, the clarification of these relations must begin with  a determination of what vocabulary it is admissible to use in specifying the  relevant behavior  again there is a spectrum of possibilities, from allowing  intentional vocabulary with semantic locutions, such as /I acting as if one  believed that snow is white,\" ranging down to restrictions to physicalistic or  other naturalistic vocabulary, such as \"one's left wrist rotating twenty degrees.\" The via media pursued here eschews intentional or semantic specifications of behavior but permits normative and therefore social specifications  of what is in fact linguistic behavior.  Where the first sort of generalization involves moving from consideration  of language to consideration of mind, from talking to thinking and believing,  the second involves moving from an account of the practices that constitute  treating something as proposition ally contentful to the practices that constitute treating something as conceptually contentful in a broader sense. In  Chapter 6 the notion of substitution and substitutional inferences is used to  show how expressions such as singular terms and predicates, which cannot  directly play the inferential role of premise or conclusion in an argument,  nonetheless can play an indirectly inferential role in virtue of their systematic contributions to the directly inferential roles of sentences in which they  xvi Preface  occur. In Chapter 7 the notion of anaphora (whose paradigm is the relation  between a pronoun and its antecedent) and anaphoric inheritance of substitutional commitment is used to show how even unrepeatable expressions  such as demonstrative tokenings play substitution-inferential roles and  hence express conceptual contents. The result is a kind of conceptual-role  semantics that is distinguished first by the nature of the functional system  with respect to which such roles are individuated and attributed: what is  appealed to is role in the implicitly normative linguistic social practices of a  community, rather than the behavioral economy of a single individual. It is  also different from familiar ways of using the notion of conceptual role in  conceiving of the conceptual in terms of specifically inferential articulation,  and in its elaboration of the fundamental substitutional and anaphoric substructures of that inferential articulation.  This semantic explanatory strategy, which takes inference as its basic  concept, contrasts with the one that has been dominant since the Enlightenment, which takes representation as its basic concept. The inferentialist  approach is by no means without precedent-though it has been largely a  minority platform. Indeed, the distinction canonically drawn between Continental rationalists such as Spinoza and Leibniz, on the one hand, and British  empiricists such as Locke and Hume, is for many purposes more perspicuously rendered as a distinction between those endorsing an inferentialist  order of explanation and those endorsing a representationalist order of explanation. The elements of the contemporary inferentialist program are extracted (in Chapter 2) from Frege of the Begriffsschrift, Sellars, and some of  Dummett's writings.  The complementary theoretical semantic strategies of representationalism and inferentialism are bound by the same pair of general explanatory obligations: to explicate the concept treated as primitive, and to offer  an account of other semantic concepts in terms of that primitive. The representationalist tradition has developed good answers to the second sort of  concern, primarily by employing a variety of set-theoretic methods to show  how proprieties of inference can be determined by representational properties  of the claims that serve as their premises and conclusions. The explanatory  challenge to that tradition lies rather in the first sort of demand, in saying  what it is for something to have representational content, and in what the  grasp or uptake of that content by speakers and thinkers consists. As the  inferentialist program is pursued here, the proprieties of inference that serve  as semantic primitives are explicated in the pragmatics  they are implicit in  the practices of giving and asking for reasons. The major explanatory challenge for inferentialists is rather to explain the representational dimension of  semantic content-to construe referential relations in terms of inferential  ones.  The second part of the book responds to this challenge. Chapter 5 explains  the expressive role of traditional representational semantic vocabulary. An  account is offered there of the use of the sort of expression of which 'true'  Preface xvii  and 'refers' are paradigmatic. Following the lead of the prosentential approach  to truth, the key semantic concept employed in that unified account is  anaphora. Chapter 7 then explains anaphoric relations in terms of the substitution-inferential structure of discursive scorekeeping elaborated in Chapter 6. Chapter 6 also offers an account in those terms of what it is for  claims-which are understood in the first instance (in Chapter 3) as what can  serve as premises and conclusions of inferences-to be and be understood to  be about objects, and to characterize them as having properties and standing  in relations.  The primary treatment of the representational dimension of conceptual  content is reserved for Chapter 8, however. There the representational properties of semantic contents are explained as consequences of the essentially  social character of inferential practice. Words such as the 'of' that expresses  intentional directedness, and 'about' and 'represents' in their philosophically  significant uses, have the expressive role they do-making representational  relations explicit-in virtue of the way they figure in de re ascriptions of  propositional attitudes. These are the tropes used to say explicitly what  someone is thinking about, what a belief represents, what a claim is true of.  Chapter 8 offers a discursive scorekeeping account of the practices that  constitute using locutions to express such de re ascriptions, and hence of how  expressions must be used in order to mean 'of', 'about', or 'represents'. This  account of what is expressed by the fundamental explicitly representational  locutions makes possible an explanation of the objectivity of concepts. It  takes the form of a specification of the particular sort of inferential structure  social scorekeeping practices must have in order to institute objective norms,  according to which the correctness of an application of a concept answers to  the facts about the object to which it is applied, in such a way that anyone  (indeed everyone) in the linguistic community may be wrong about it.  In summary, in the theoretical place usually occupied by the notion of  intentional states, the pragmatics presented here elaborates a conception of  normative statuses  in the place usually occupied by the notion of intentional interpretation, it puts deontic scorekeeping-that is, the social practices of attributing and acknowledging commitments and entitlements,  which implicitly institute those statuses. The theoretical work typically  done by semantic assessments according to correctness of representation and  satisfaction of truth conditions is done by assessments of proprieties of  inference. Semantic articulation is attributed and acknowledged by keeping  score not only of directly inferential commitments, which relate sentential  (that is, claimable or believable) contents, but also of indirectly inferential  substitutional and anaphoric commitments, which relate the sub sentential  contents of expressions of other grammatical categories.  The pragmatics and semantics maintain particularly intimate relations  throughout. The aim is always to show how some bit of vocabulary must be  used-the significance its utterance must have in various circumstances, the  xviii Preface  practical scorekeeping attitudes its usage must elicit and be elicited by-in  order for it to express a certain kind of semantic content: to be being taken  or treated in practice by the linguistic community as a conditional, a singular  term, a bit of normative vocabulary, a propositional-attitude-ascribing locution, and so on. A fundamental methodological criterion of adequacy of the  account is that the theorist not attach semantic contents to expressions by  stipulation  it must always be shown how such contents can be conferred on  expressions by the scorekeeping activities the theorist attributes to the linguistic practitioners themselves. That is, the aim is to present conditions on  an interpretation of a community as discursive scorekeepers that are sufficient (though perhaps not necessary) to ensure that interpreting the community as engaged in those implicitly normative practices is interpreting them  as taking or treating their speech acts as expressing the sorts of semantic  contents in question.  The obligation to say what it is about the use of locutions in virtue of  which they express various sorts of content dictates that the master concept  articulating the relation between the pragmatic and semantic portions of the  theory is that of expression. To express something is to make it explicit.  What is explicit in the fundamental sense has a propositional content-the  content of a claim, judgment, or belief (claimable, judgeable, believable contents). That is, making something explicit is saying it: putting it into a form  in which it can be given as a reason, and reasons demanded for it. Putting  something forward in the explicit form of a claim is the basic move in the  game of giving and asking for reasons.  The relation of expression between what is implicit in what practitioners  do and what is explicit in what they say structures the story told here at two  different levels. At the basic level, the question is how the capacity to  entertain principles, and so to know that something is the case, arises out of  the capacity to engage in practices-to know how to do something in the  sense of being able to do it. What must practitioners be able to do in order  to be able thereby to say that things are thus and so-that is, to express  something explicitly? The explanatory force of a response to this question  can be judged by the constraints that are acknowledged on the vocabulary in  which those practical capacities are specified  normative vocabulary is employed here, but intentional vocabulary (which would permit at the outset  the ascription of propositionally contentful states, attitudes, and performances) is not. The first level of the account of expression accordingly  consists in explaining-making theoretically explicit-the implicit structure  of linguistic practices in virtue of which they count as making anything  explicit at all.  The second level of the account of expression consists in working out a  theory of the expressive role distinctive of logical vocabulary. The claim is  that logical vocabulary is distinguished by its function of expressing explicitly within a language the features of the use of that language that confer  Preface xix  conceptual contents on the states, attitudes, performances, and expressions  whose significances are governed by those practices. Conditionals serve as a  paradigm illustrating this expressive role. According to the inferential approach to semantics and the deontic scorekeeping approach to pragmatics,  practitioners confer determinate propositional contents on states and expressions in part by their scorekeeping practice of treating the acknowledgment  of one doxastic commitment (typically through assertional utterance of a  sentence) as having the pragmatic significance of an undertaking of further  commitments that are related to the original commitment as its inferential  consequences. At the basic level, treating the claim expressed by one sentence as an inferential consequence of the claim expressed by another sentence is something practitioners can do, and it is because such practical  attitudes can be implicit in the way they respond to each other's performances that their sentences come to mean what they do. With the introduction of conditional locutions linking sentences, however, comes the expressive power to say explicitly that one claim is a consequence of another.  The expressive role distinctive of conditionals is making implicit inferential  commitments explicit in the form of declarative sentences, the assertion of  which acknowledges a propositionally contentful doxastic commitment. In  a similar way, at the basic level, scorekeepers can treat the claims expressed  by two sentences as incompatible-namely by treating commitment to one  as in practice precluding entitlement to the other. The introduction of a  locution with the expressive power of negation makes it possible to express  such implicit practical scorekeeping attitudes explicitly-by saying that two  claims are incompatible (one entails the negation of the other). Identity and  quantificational expressions are analyzed on this model as making explicit  the substitutional relations characteristic of singular terms and predicates  respectively, and further locutions are considered that playa corresponding  expressive role in making anaphoric relations explicit.  So an expressive theory of logic is presented here. On this view, the  philosophical significance of logic is not that it enables those who master the  use of logical locutions to prove a special class of claims-that is, to entitle  themselves to a class of commitments in a formally privileged fashion. The  significance of logical vocabulary lies rather in what it lets those who master  it say-the special class of claims it enables them to express. Logical vocabulary endows practitioners with the expressive power to make explicit as the  contents of claims just those implicit features of linguistic practice that  confer semantic contents on their utterances in the first place. Logic is the  organ of semantic self-consciousness. It brings out into the light of day the  practical attitudes that determine the conceptual contents members of a  linguistic community are able to express-putting them in the form of explicit claims, which can be debated, for which reasons can be given and  alternatives proposed and assessed. The formation of concepts-by means of  which practitioners can come to be aware of anything at all-comes itself to  xx Preface  be something of which those who can deploy logical vocabulary can be  aware. Since plans can be addressed to, and intentional practical influence  exercised over, just those features of things of which agents can become  explicitly aware by the application of concepts, the formation of concepts  itself becomes in this way for the first time an object of conscious deliberation and control.  Explaining the features of the use of logical vocabulary that confer its  characteristic sort of semantic content is accordingly explaining how the sort  of expressive power the theorist requires to explain the features of the use of  nonlogical vocabulary that confer semantic content on it can become available to those whose linguistic practice is being theorized about. It is this fact  that sets the expressive scope of the project pursued here. The aim is twofold:  to make explicit deontic scorekeeping social practices that suffice to confer  conceptual contents on nonlogical sentences, singular terms, and predicates  in general  and to make explicit the deontic scorekeeping social practices in  virtue of which vocabulary can be introduced as playing the expressive roles  characteristic of a variety of particular logical locutions. How much logical  vocabulary is worth reconstructing in this fashion? In this project, neither  more nor less than is required to make explicit within the language the  deontic scorekeeping social practices that suffice to confer conceptual contents on nonlogical vocabulary in general. At that point it will have been  specified what practices a theorist must attribute to a community in order  to be interpreting its members as engaging not just in specifically linguistic  practices but in linguistic practices that endow them with sufficient expressive power to say how their practices confer conceptual content on their  states, attitudes, performances, and expressions. That is, they will be able to  express the theory offered here.  To make the semantic theory explicit requires logical vocabulary capable  of expressing inferential, substitutional, and anaphoric relations. This vocabulary corresponds pretty well to the language of standard first-order logic,  with the addition of classical semantic vocabulary. To make the pragmatic  theory explicit requires logical vocabulary expressing the endorsement of  norms generally, and the attribution and acknowledgment of the deontic  statuses of commitment and entitlement in particular. The discussion of  action in Chapter 4 includes an account of the use of vocabulary that makes  norms explicit, and Chapter 8 explains how the social-practical attitudes of  attributing and acknowledging deontic statuses (paradigmatically doxastic  commitment) are made explicit by the use of propositional-attitude-ascribing  locutions such as the regimented ' ... is committed to the claim that ... \"  which does duty here for ' ... believes that ... '. Along this expressive dimension, the project eats its own tail, or lifts itself up by its own bootstrapspresenting an explanation of what it is to say something that is powerful  enough to explain what it itself is saying.  Interpreting the members of a community as engaging in specifically  Preface xxi  discursive practices, according to the view put forward here, is interpreting  them as engaging in social practices that include treating some performances  as having the pragmatic significance of assertions. For it is in terms of the  constellation of inferentially articulated commitments and entitlements  characteristic of the making (staking) of claims that the notion of specifically  propositional contentfulness is to be understood. Since all other varieties of  conceptual contentfulness derive (substitutionally) from the propositional,  this is to say that the application of concepts is a linguistic affair-not in the  sense that one must be talking in order to do it, but in the sense that one  must be a player of the essentially linguistic game of giving and asking for  reasons in order to be able to do it. There can be sets of practices that are  linguistic in this sense but that do not incorporate the expressive resources  provided by logical vocabulary. Indeed, the way the use of such vocabulary  in making explicit what is implicit in the use of nonlogical vocabulary is  specified is by showing what would be required to introduce vocabulary with  that expressive function into idioms that did not already contain it. The  contribution made by logical locutions to the reflective processes in virtue  of which the evolution of our concepts and commitments qualifies as rational is so important, however, that linguistic practices that at least permit  their introduction form a special class. In a weak sense, any being that  engages in linguistic practices, and hence applies concepts, is a rational  being  in the strong sense, rational beings are not only linguistic beings but,  at least potentially, also logical beings. This is how we should understand  ourselves: as beings that meet: this dual expressive condition.  It turns out that there is ~ mrprising connection between being a rational  creature-in the sense that Jlcludes the possibility of using the expressive  resources of specifically logical vocabulary to reflect on one's conceptual  content-conferring linguistic practices--{)n the one hand, and the structure  of the facts that make up the world one can become aware of by applying  those concepts, on the other. Rational beings live in a world of propertied  and related particulars. Chapter 6 presents an expressive deduction of the  necessity of this structure  it shows not why there is something rather than  nothing but why what there is must come in the form of things  it shows  why judgments or beliefs-the commitments expressed by claims-must in  the basic case be about particulars (paradigmatically objects) and their properties and relations.  Particular objects are what is referred to by singular terms, and the demonstration proceeds by showing that the only semantically significant subsentential structure that is compatible with the introduction of logical  vocabulary is one that decomposes basic sentences into singular terms and  predicates. This would not be a surprising result if the logical vocabulary  appealed to included identity and quantificational locutions, for (it will be  argued) these have precisely the expressive role of making explicit in the  form of claims the substitution-inferential commitments characteristic of  xxii Preface  singular terms and predicates. But the result presented here is much stronger:  any discursive practices that permit the introduction even of sententiallogical operators such as negation and conditionals require that any subsentential substitutional structure be of the term-predicate variety. Thus the  investigation of the nature and limits of the explicit expression in principles  of what is implicit in discursive practices yields a powerful transcendental  argument-a formal answer to the question, Why are there objects? that  turns on a deep relation between the expressive capacities required to think  critically about the inferential connections among claims and the structures  in virtue of which those claims are properly understood as characterizing  objects as having properties and standing in relations.  This is a long book. Its length is a consequence of the demands made by its  governing methodological aspirations: to eschew representational primitives,  to show how content is related to use, and to achieve self-referential expressive completeness. The first is pursued by elaborating inferentialist and expressivist alternatives to the representationalist idiom for thinking and  talking about thinking and talking that has been so well worked out over the  last three centuries. The aim is not to replace that familiar idiom but to  enrich it. The promised enrichment is of two sorts. First, there is the greater  depth of field afforded by the stereoscopic vision made available by an alternative to familiar ways of talking about intentional phenomena. Second,  there is the grounding and illumination of representational tropes secured by  displaying the implicit features of discursive practice that are expressed  explicitly by their use. Doing this requires that both the p", "filename": "Robert Brandom - Making it Explicit.pdf", "meta": {"bla": "huahaua"}}